module.exports = [
  {
    title: 'Компьютерлікграфика түсінігіне сипаттама беріңіз',
    answer: `Компьютерлік технологиялардың дамуы графикалық кескіндерді компьютер көмегімен тұрғызуға алып келді. Қазіргі таңда бұл компьютерлік графика деп аталатын жеке пән ретінде қарастырыла. Негізінен графика деп сызылған кескіндерді айтамыз. Ал осы кескіндерді электронды есептеу машинасы көмегімен сызсақ ол компьютерлік графика болады.
    Компьютерлік графика көптеген түрлерге бөлінеді. Оның қолданылуы салалары да өте көп. 
    Компьютерлік графиканың қолданылу аясы тек көркемдік әсерлермен шектелмейді. Ғылымның, техниканың, медицинаның барлық салаларында, коммерциялық және басқарушылық қызметте әр түрлі ақпаратты көрнекі түрде көрсетуге арналған компьютерлік сызбалар, графиктер, диаграммалар қолданылады. Автомобильдер мен ұшақтардың жаңа модельдерін жасайтын дизайнерлер өнімнің соңғы түрін ұсыну үшін үш өлшемді графикалық нысандарды пайдаланады. Сәулетшілер монитор экранында ғимараттың көлемді бейнесін жасайды және бұл оның ландшафтқа қалай сәйкес келетінін көруге мүмкіндік береді.
    `,
  },
  {
    title: 'Компьютерлік графиканың түрлеріне сипаттама беріңіз',
    answer: `2D (екі өлшем) – компьютерлік графиканың бір түрі. Мұндай сурет әрқашан тегіс көрінеді, өйткені ол тек екі өлшемді – ені мен биіктігін пайдаланады. 
    Үш өлшемді графика-объектілерді үш өлшемде модельдеу арқылы кескіндер немесе бейнелер жасау әдістеріне арналған компьютерлік графика бөлімі.
    Растрлык графика – бұл компьютер мониторындағы, қағаздағы және басқа да дисплей құрылғылары мен материалдарындағы пиксельдер немесе түстер нүктелерінің торы (әдетте тікбұрышты).
    Векторлық графика-бұл арнайы бағдарламалық жасақтамада математикалық сипаттаманы өңдеу арқылы құрылған компьютерлік кескінді құру әдісі. Әр түрлі түстердің пиксельдер жиынтығын білдіретін нүктелік кескіннен айырмашылығы, векторлық кескін-бұл математикалық формулалармен сипатталған примитивтер жиынтығы (сызықтар, қисықтар, квадраттар, шеңберлер).
    Фракталдық графика математикалық есептеулерге негізделген. Фракталдық графиканың негізгі элементі - математикалық формула, яғни, компьютердің жадында ешқандай нысандар сақталмайды және кескін тек теңдеулермен салынбайды. Осылайша, қарапайым тұрақты құрылымдар да табиғи ландшафттар мен үш өлшемді заттарға еліктейтін салынып, күрделі иллюстрациялар болып табылады.
    `,
  },
  {
    title: 'Компьютерлік графиканың қолданылу ерекшеліктерін сипаттаңыз',
    answer: `Компьютерлік графиканың қолданылу аясы тек көркемдік әсерлермен шектелмейді. 2D компьютерлік графикасы негізінен дәстүрлі басып шығару және сурет салу технологиясы үшін жасалған қосымшаларда қолданылады, мысалы , типография , картография , техникалық сурет , жарнама және т.б. бұл қосымшаларда екі өлшемді кескін тек нақты әлем объектісінің көрінісі ғана емес, сонымен қатар қосылған семантикалық құндылығы бар тәуелсіз артефакт; сондықтан екі өлшемді модельдерге артықшылық беріледі, өйткені олар үш өлшемді компьютерлік графикаға қарағанда кескінді тікелей басқаруға мүмкіндік береді (олардың көзқарасы типографияға қарағанда фотосуретке ұқсас).
    3D графикалық технологиялар және 3D басып шығару технологиялары адам қызметінің көптеген салаларына еніп, үлкен пайда әкеледі.
    Үш өлшемді бейнелер күн сайын бізді теледидарда, кинода, компьютермен жұмыс кезінде және 3D ойындарда, билбордтардан 3Д графикасының барлық күші мен жетістіктерін көрнекі түрде таныстырады.
    Заманауи 3D графикасының жетістіктері келесі салаларда қолданылады
    Кино және анимация-үш өлшемді кейіпкерлер мен нақты арнайы эффектілерді жасау.Компьютерлік ойындарды құру-3D кейіпкерлерін, қоршаған ортаның виртуалды шындығын, ойындарға арналған 3D нысандарын дамыту.
    Жарнама-3D графикасының мүмкіндіктері өнімді нарыққа тиімді түрде ұсынуға мүмкіндік береді, үш өлшемді графиканың көмегімен сіз кристалды-ақ көйлек немесе шоколадты чипсы бар дәмді жеміс балмұздақының елесін жасай аласыз және т.б. сонымен қатар, нақты жарнамаланған өнімде әдемі және сапалы суреттердің артында оңай жасырылатын көптеген кемшіліктер болуы мүмкін.
    `,
  },
  {
    title: 'Компьютерлік графикамен жұмыс істеуге арналған бағдарламаларға жалпы сипаттама беріңіз',
    answer: `Ищи: Adobe photo shop растрлік өңдеу бағдарламасына сипаттама беріңіз или Corel draw-тың жұмыс ортасын сипатаңыз`,
  },
  {
    title: 'Компьютерлік графиканың даму тарихын талдаңыз',
    answer: `Компьютерлік графика тарихы компьютерлік технологияның дамуымен тығыз байланысты. Сонымен, алғашқы компьютерлерде графикамен жұмыс істеудің арнайы құралдары болмаса да, олар кескіндерді алу және өңдеу үшін қолданылған. Олардың бағдарламаланатын жады үлгіні алуға мүмкіндік беретін шам матрицасы негізінде салынған. Компьютерлік графиканың даму тарихы ХХ ғасырда басталды. және бүгін жалғасуда. Бұл компьютерлер жылдамдығының өсуіне ықпал еткен графика екені жасырын емес.
    1940-1970-үлкен компьютерлердің уақыты (персоналға дейінгі компьютерлер дәуірі). Графика принтерге шығарылған кезде ғана жасалды. Осы кезеңде математикалық негіздер қаланды. Мүмкіндіктер: пайдаланушы мониторға қол жеткізе алмады, графика математикалық деңгейде дамыды және үлкен қашықтықта кескінге ұқсайтын мәтін түрінде пайда болды.
    1961 жылы бағдарламашы с. Расселл графикасы бар алғашқы компьютерлік ойын құру жобасын басқарды. "Spacewar" ("Ғарыштық соғыстар") ойынының құрылуы шамамен 200 адам-сағатты алды. Ойын PDP-1 машинасында жасалды.
    1963 жылы американдық ғалым Айвен Сазерленд сандық қаламмен түтікке нүктелер, сызықтар мен шеңберлер салуға мүмкіндік беретін Sketchpad бағдарламалық-аппараттық кешенін жасады. Примитивтермен негізгі әрекеттер сақталды: жылжыту, көшіру және т.б. іс жүзінде бұл компьютерде енгізілген алғашқы векторлық редактор болды. Сондай-ақ, бағдарламаны бірінші графикалық интерфейс деп атауға болады және ол терминнің өзі пайда болғанға дейін болған.
    1960 жылдардың ортасында. компьютерлік графиканың өнеркәсіптік қосымшаларында әзірлемелер пайда болды. Сонымен, Т. Мофетт пен И. Тейлордың басшылығымен Itek сандық электронды сурет машинасын жасады. 1964 жылы General Motors IBM-мен бірге жасалған DAC-1 Автоматтандырылған жобалау жүйесін ұсынды. Алғашқы компьютерлерде графикамен жұмыс істеуге арналған жеке құралдар болған жоқ, бірақ олар суреттерді алу және өңдеу үшін қолданылған. Шам матрицасы негізінде салынған алғашқы электронды машиналардың жадын бағдарламалау арқылы өрнектерді алуға болады.
    `,
  },
  {
    title: 'Компьютерлік графиканы кескіндерді жасау тәсілдеріне қарай жіктеп, анықтама беріңіз',
    answer: `2D (екі өлшем) – компьютерлік графиканың бір түрі. Мұндай сурет әрқашан тегіс көрінеді, өйткені ол тек екі өлшемді – ені мен биіктігін пайдаланады. Логотиптер, карталар, сайттар, жарнамалық баннерлер, ойындар мен қолданбалы интерфейстер, мультфильмдер мен бейнелер жасау үшін қолданылады. 2D графикасы жалпақ кескінге ұқсайтынына қарамастан, көлеңкелердің арқасында көлемді заттардың әсеріне қол жеткізуге болады (бірақ фотореализм емес).
    2D графикасының жақсы мысалы-Pac-Man және Mario сияқты ескі аркада ойындары. Тегіс боялған фигуралар жалпақ заттарды жинап, сол жалпақ әлемді шарлайды.
    Үш өлшемді графика-объектілерді үш өлшемде модельдеу арқылы кескіндер немесе бейнелер жасау әдістеріне арналған компьютерлік графика бөлімі.
    3D модельдеу-объектінің үш өлшемді моделін құру процесі. 3D модельдеудің міндеті-қалаған объектінің визуалды көлемді бейнесін жасау. Бұл жағдайда модель нақты әлемдегі объектілерге (автомобильдер, ғимараттар, дауыл, астероид) сәйкес келуі мүмкін және толығымен дерексіз (төрт өлшемді фракталдың проекциясы) болуы мүмкін.
    Үш өлшемді нысандардың графикалық бейнесі мамандандырылған бағдарламаларды қолдана отырып, жазықтықтағы көріністің үш өлшемді моделінің геометриялық проекциясын (мысалы, компьютер экраны) салуды қамтиды. Алайда, 3D дисплейлер мен 3D принтерлерді құру және енгізу арқылы үш өлшемді графика міндетті түрде ұшаққа проекциялауды қамтымайды.
    Үшөлшемді графика ғылыми есептеулерде, инженерлік жобалауда, физикалық объекттерді компьютерлік модельдеуде кеңінен орын алады.
    `,
  },
  {
    title: 'Компьютерлік графиканы қолдану салалары бойынша жіктеп, анықтама беріңіз',
    answer: `Ищи: Компьютерлік графиканың қолданылу ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Әртүрлі сфераларда компьютерлік графиканы қолдану ерекшеліктерін талдаңыз',
    answer: `Ищи: Компьютерлік графиканың қолданылу ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Компьютерлік графиканың жарнама қызметіндегі рольін талдаңыз',
    answer: `Жарнамалық графика графикалық дизайнның бір түріне жатады. Сату саны жарнаманың сапасы мен берілуіне байланысты. Сондықтан маркетологтар нарықты зерттейді, клиенттердің назарын аудару үшін тұтынушылармен байланысады. Айта кету керек, баспа басылымдарындағы жарнама екінші орынға шығады.
    Цифрландырылған суреттер қазір сәнде, тауарлар мен қызметтерді жарнамалайды. Осыған байланысты жарнамалық графиканы әзірлеу және құру бойынша мамандарға сұраныстың артуы байқалады.
    Қазіргі уақытта графикалық жарнаманы барлық жерде кездестіруге болады, өйткені ол әр түрлі формада ұсынылған. Ең танымал жарнама орналастырылған: баннерлерде; флаерлерде; плакаттар; баспа басылымдарының беттерінде; сайттарда; ғимараттардың қабырғаларында.
    Бизнесмендер мен маркетологтар үшін көркем жарнама графикасы сапалы және адамдарға жағымды әсер қалдыруы маңызды. Сапалы графикалық өнімді жасау үшін аналитикалық ойлау, шығармашылық көзқарас, редакторлар мен қосымшаларда тәжірибе қажет.Өте күшті графикалық пакеттерді пайдалану бізге мынадай мүмкіндіктер береді
    Реклама үшін бейнеклиптер түсіру;
    Компьютерге немесе мобильді телефонға ойындар жаса;, 
    Аннимациялық мультфильмдер түсіру; 
    Яғни, жарнама графикасы графикалық бейнелерді құру және өңдеу үшін қолданылады.Архитектурада сызба дайындау процесін автоматтандыруға және ғимараттарды қабаты бойынша жобалауға мүмкіндік береді.
    `,
  },
  {
    title: 'Анимацияны жарнама қызметінде қолдану ерекшеліктерін сипаттаңыз',
    answer: `Технология жақсарған сайын жарнамада анимацияны қолданудың өсуі байқалады.
    Анимация көптеген тауашаларда өзінің тиімділігін дәлелдеді, өйткені ол дәстүрлі жарнаманың әлдеқайда төмен құнын қамтамасыз ете алады және сіздің аудиторияңызды және басқа да көптеген артықшылықтарды тарту үшін тиімді.
    Нақты уақыттағы әрекет өте қымбатқа түсуі мүмкін, өйткені анимациядан гөрі қателер мен кідірістерге көбірек мүмкіндіктер бар, олар жоғары сапалы түпкілікті өнімді жасау үшін бірнеше аниматорлар мен дауыстық актерлерді қажет етеді. Көптеген компаниялар өз өнімдерін, қызметтерін және тұжырымдамаларын жарнамалау үшін анимацияға жүгінеді, мысалы:
    Анимацияны көру әдетте қызықты және ол дәстүрлі жарнамаларға қарағанда көбірек көрермендерді тартады.
    Анимация көбінесе көрерменді ұзақ уақыт қызықтыратын әзіл-оспақ немесе комедиялық аспектілерді қамтиды, сонымен қатар бонустық маркетинг әлеуетін бөлісуге ықпал етеді.
    Анимация сізге креативті болуға мүмкіндік береді, өйткені сіз анимациядағы кез-келген нәрсені елестете аласыз, тірі бейнелер сияқты нақты немесе мүмкін нәрсені ұстанудың қажеті жоқ. Қиялды өз тарихыңызбен араластыру сонымен қатар көрермендердің назарын ұзақ уақытқа аударудың жақсы тәсілі болып табылады.
    Анимация сіздің брендіңіздің мәнін ашып, аудиторияңыздың сіздің өніміңіз немесе қызметіңіз туралы не түсінетінін дәл көрсете алады.
    Жарнамалық анимация, әдетте, ақпаратты анық және тез жеткізетін және есте қаларлық ақпаратты шығармашылықпен жеткізетін қысқа бейнелерден тұрады.
    Көптеген жағдайларда анимация күлкілі жеңілдік береді, бұл оны жалпы көрермендер үшін қызықты етеді.
    `,
  },  {
    title: 'Жарнама қызметіндегі мультимедияның маңызын сипаттаңыз',
    answer: `Мультимедиялық технологиялар адам қызметінің әртүрлі салаларын ақпараттық қамтамасыз ету үшін қолданылады. Жарнамалық қызметте мультимедиялық технологиялар жарнама өнімдерін жасау технологиялары болып табылады. Мультимедиялық құралдардың көмегімен жарнамалық бейне және аудио роликтер жасалады, логотиптер мен анимациялық баннерлер жасалады, жарнамалық буклеттер жасалады.
    Жарнамадағы мультидедианың бірқатар артықшылықтары бар, олар жарнаманың аудиторияға әсер ету мүмкіндіктерін едәуір кеңейтеді. Олардың кейбіреулері психология саласына жатады. Мультфильм мейірімді көзқарас тудырады, ал анимациялық кейіпкердің аралас бейнесіне қатысу бейнені күлкілі және ерекше етеді. Сондықтан, мұндай бейне көбінесе ойын немесе ойын-сауық ретінде қабылданады және көрерменді қандай-да бір өнімді сатып алуға мәжбүрлеу әрекеті емес. Басқа артықшылықтар техникалық болып табылады. Суреттелген кейіпкерлер сценарист пен режиссердің кез-келген қиялын жүзеге асыруға көмектеседі, жарнаманы керемет және есте қаларлық етеді. Анимациялық роликтерде фантастикалық тіршілік иелері жиі қолданылады, әртүрлі заттар" өмірге келеді". Сонымен қатар, компьютерлік анимациясы бар бейне ойынға қарағанда арзанырақ.
    `,
  },
  {
    title: 'Растрлық графиканың ерекшеліктерін сипаттаңыз',
    answer: `Нүктелік кескін-бұл компьютер мониторындағы, қағаздағы және басқа да дисплей құрылғылары мен материалдарындағы пиксельдер немесе түстер нүктелерінің торы (әдетте тікбұрышты). Кескіннің маңызды сипаттамалары:
    пиксельдер саны-ажыратымдылық. Ені мен биіктігі бойынша пикселдердің саны жеке көрсетілуі мүмкін(1024*768, 640*480,...) немесе сирек, пиксельдердің жалпы саны (көбінесе мегапиксельмен өлшенеді);
    пайдаланылған түстер саны немесе "түс тереңдігі" (бұл сипаттамалар келесі тәуелділікке ие: N = 2I, мұндағы n-түстер саны, ал I-түс тереңдігі);
    түс кеңістігі (түс моделі) RGB, CMYK, XYZ, YCbCr және т. б.
    Растрлық графика фотоаппараттармен, сканерлермен, тікелей растрлық редакторда, сондай-ақ векторлық редактордан немесе скриншоттар түрінде экспорттау арқылы жасалады.
    Растрлық графика күрделілігіне қарамастан, мысалы, вектордан айырмашылығы, кез-келген үлгіні жасауға (көбейтуге) мүмкіндік береді, мұнда файл өлшемін жоғалтпай бір түстен екіншісіне өту әсерін дәл жеткізу мүмкін емес.
    Таралуы-растрлық графика қазір барлық жерде қолданылады: кішкентай белгішелерден плакаттарға дейін.
    Масштабтау қажет болмаса, күрделі суреттерді өңдеудің жоғары жылдамдығы.
    Кескінді нүктелік бейнелеу мониторлар (вектордан басқа), матрицалық және сиялы принтерлер, сандық камералар, сканерлер сияқты көптеген графикалық ақпаратты енгізу-шығару құрылғылары үшін табиғи болып табылады.
    Кемшіліктері
    Қарапайым суреттері бар үлкен файл өлшемі.
    Мінсіз масштабтаудың мүмкін еместігі.
    Плоттерде басып шығару мүмкін еместігі.
    Осы кемшіліктерге байланысты Қарапайым сызбаларды сақтау үшін тіпті Сығылған растрлық графиканың орнына векторлық графиканы қолдану ұсынылады.
    Растрлық графиканы өңдеудің бағдарламалық құралдарына растрлық графикалық редакторлар жатады: GIMP, Рисуй.NET, смокинг бояуы, Adobe Photoshop, Adobe Fireworks, Corel Photo-Paint, Corel Paint Shop Pro, Corel Painter, Microsoft Paint.
    `,
  },
  {
    title: 'Векторлық графиканың ерекшеліктерін сипаттаңыз',
    answer: `Векторлық графика-бұл арнайы бағдарламалық жасақтамада математикалық сипаттаманы өңдеу арқылы құрылған компьютерлік кескінді құру әдісі. Әр түрлі түстердің пиксельдер жиынтығын білдіретін нүктелік кескіннен айырмашылығы, векторлық кескін-бұл математикалық формулалармен сипатталған примитивтер жиынтығы (сызықтар, қисықтар, квадраттар, шеңберлер). Сурет нүкте координаттары мен тірек нүктелерін кесіп өтетін сызық туралы мәліметтерді қамтитын файл түрінде жасалады. Сонымен қатар, файлда қолданылған әсерлер туралы ақпарат бар.
    Сандық кескінді құрудың бұл принципі оны масштабтауға, сапасын төмендетпей өлшемін өзгертуге, пішінін өзгертуге және бастапқы нысандар негізінде жаңа сызбалар жасау үшін примитивтерді қайта орналастыруға мүмкіндік береді. Сонымен қатар, мұндай файл растр файлымен салыстырғанда әлдеқайда аз орын алады, онда әр пиксель, оның координаттары, түсі және басқа параметрлері туралы мәліметтер бар.
    Векторлық графиканың не екенін ескере отырып, оны қолдану саласы жоғары сапалы сақтай отырып өзгертуге және масштабтауға болатын жоғары дәлдіктегі графикалық кескіндерді алу маңызды болатын әртүрлі салаларды қамтитыны түсінікті.
    Векторлық суреттер мен схемаларды өңдеу арнайы бағдарламалық жасақтамамен жүзеге асырылады. Ең көп таралған бағдарламалар: AutoCAD, Adobe Illustrator, Adobe FreeHand, Adobe InDesign, CorelDraw, ArchiCAD.
    `,
  },
  {
    title: 'Фракталдық графиканың ерекшеліктерін сипаттаңыз',
    answer: `Фракталдық графика математикалық есептеулерге негізделген. Фракталдық графиканың негізгі элементі - математикалық формула, яғни, компьютердің жадында ешқандай нысандар сақталмайды және кескін тек теңдеулермен салынбайды. Осылайша, қарапайым тұрақты құрылымдар да табиғи ландшафттар мен үш өлшемді заттарға еліктейтін салынып, күрделі иллюстрациялар болып табылады.
    Фракталды графика негіздерімен танысу өнер Dabbler пакетінен басталады. Бұл редактор (фракталдық дизайн бойынша жасалған және қазір Corel-ге тиесілі) іс жүзінде суретші бағдарламасының қысқартылған нұсқасы болып табылады. Бұл тамаша оқу бағдарламасы ғана емес, тек компьютерлік графика емес, бірақ ең алдымен, Азам сурет салу. Жадтың аз мөлшері қажет (оны орнату үшін сізге тек 10 МБ қажет), сонымен қатар қарапайым интерфейс, сонымен қатар қарапайым интерфейс, тіпті балаға қол жетімді, оны мектеп бағдарламасына пайдалануға мүмкіндік береді. MS Paint Raster редакторы сияқты, өнер Dabbler фракталдық редакторы, әсіресе компьютерлік графиканың бастапқы кезеңінде тиімді.
    `,
  },
  {
    title: 'Графикалық мәліметтерді кодтау ерекшеліктерін анықтаңыз',
    answer: `Графикалық кескін оны үлкейту кезінде өзіне тән үлгіні құрайтын ең кішкентай нүктелер түрінде ұсынылуы мүмкін – растр. Осылайша, кез-келген кескінді жеке жарықтығы бар нүктелердің координаталары арқылы кодтауға болады. Кез-келген қара-ақ кескінді сұр түстің 256 градациясымен (ақтан қараға дейін) беруге болады, осылайша қара-ақ кескіннің әр нүктесінің жарықтығын 8 биттік екілік санмен – бір байтпен кодтауға болады.
    Түрлі-түсті графикалық кескіндерді кодтау үшін түстерді негізгі компоненттерге бөлу (ыдырау) принципі қолданылады: қызыл (қызыл), жасыл (жасыл) және көк (көк). Бұл принцип кез-келген түсті көрсетілген үш түсті араластыру арқылы алуға болатындығына негізделген. Негізгі аралас түстер атауларының алғашқы әріптерімен кодтау жүйесі RGB жүйесі деп аталады және қасиеттері түсті шеңберлермен суреттелген қосымша түс моделінің әрекетін сипаттайды. Егер әр компоненттің жарықтығын кодтау үшін қара-ақ кескін үшін әдеттегідей 256 градацияны (8 биттік Сан) қолдансаңыз, онда растрдың түрлі-түсті нүктесін кодтау үшін 24 биттік екілік сан жеткілікті.
    Түрлі-түсті графиканы ұсынудың бұл режимі толық түсті (True Color) деп аталады және 3 байт көмегімен шамамен 16,5 миллион түрлі түсті реңктерді бекітуге мүмкіндік береді. Негізгі түстердің әрқайсысы қосымша түске сәйкес келуі мүмкін, яғни.негізгі түстерді ақ түске толықтыратын түс. Қосымша түстерге: көк (Cyan), қызыл (Magenta) және сары (сары). Ыдырау принципі қосымша түстерге де қолданылады, яғни кез-келген түсті оларды араластыру арқылы алуға болады. Түсті кодтаудың бұл әдісі басып шығаруда қолданылады, онда төртінші бояу қосымша қолданылады – қара (қара). Бұл кодтау жүйесі CMYK деп аталады (қара түс оның атауының соңғы әрпімен аталады, оны қысқартулар мен қысқартуларда көк – көкпен шатастырмау үшін). Графиканы ұсынудың бұл режимі 32 разрядты қолданады және оны толық түс деп те атайды (Tgie Color). Егер сіз әр нүктені кодтау үшін қолданылатын екілік биттердің санын екі есе азайтсаңыз, онда деректер көлемін азайтуға болады, бірақ түстер диапазоны 65 536 реңкке дейін азаяды. 16 биттік екілік сандармен түрлі-түсті графиканы кодтау жоғары түс режимі деп аталады.
    Түрлі-түсті графикамен жұмыс істеу кезінде кодтаудың индекстік әдісі қолданылады. Мұнда әр нүктелік нүктелік код NS түсін сақтайды, тек оның нөмірі (индексі) графикалық деректерге қолданылуы керек палитра деп аталатын белгілі бір анықтамалық кестеде сақталады.
    Дисплей экранындағы Графикалық ақпарат нүктелерден (пиксельдерден) құралады. Пиксель-сурет элементінен, яғни сурет элементі. Қазіргі компьютерлерде ажыратымдылық (дисплей экранындағы нүктелер саны) бейне адаптерге байланысты және бағдарламалық түрде өзгеруі мүмкін. Түрлі түсті суреттерде әртүрлі режимдер болуы мүмкін: 16 түс, 256 түс, 65 536 түс (жоғары түс), 16 777 216 түс ( шынайы түс). Осылайша, мысалы, жоғары түс режимі үшін бір пиксельге 16 бит жад келеді және экранның ажыратымдылығы 800 × 600 нүкте болса, оның кескінін сақтау үшін қажет бейне жады v = 2 байт • 480000 = 960,000 байт = 937,5 Кбайт болады. Кескіннің бит картасын басқа бейне режимдерде сақтау үшін қажет бейне жадының көлемі де осылай есептеледі. Компьютердің бейне жадында бит жоспары сақталады, ол кадр жиілігіне сәйкес оқылатын және монитор экранында көрсетілетін екілік кескін коды болып табылады.
    `,
  },
  {
    title: 'Графикалық файлдардың форматтарына талдау жасаңыз.',
    answer: `Ең көп таралған векторлық форматтар:
    EPS-Adobe PostScript тілінде жасаған, көптеген арнайы бағдарламалар қолдайтын ең көп таралған формат.
    DWG-барлық инженерлер мен дизайнерлерге белгілі, Autodesk жасаған, AutoCAD әмбебап сурет бағдарламасында қолданылатын формат. Ерте және кеш нұсқаларының сәйкес келмеуі. Corel Draw-да ашылуы мүмкін.
    CDR-Corel Draw редакторына арналған формат. Басқа форматтармен және өзінің алғашқы нұсқаларымен үйлесімді емес.
    Adobe Illustrator редакторы жасаған AI файлдары. Ерте және кеш нұсқаларының сәйкес келмеуі мүмкін.
    Векторлык графиканын форматтары:
    BMP немесе Windows Bitmap — әдетте сығусыз қолданылады, дегенмен RLE алгоритмін қолдануға болады.
    GIF (Graphics Interchange Format) — бір уақытта 256 түстен аспайтын түстерді қолдайтын ескірген формат. Таза PNG-де жоқ анимациялық қолдаудың арқасында әлі де танымал, дегенмен ПО APNG-ді қолдай бастайды.
    PCX-бұл қарапайым сурет суреттерін жақсы сығуға мүмкіндік беретін ескірген формат (бірдей түсті пиксельдер тобын қатарынан қысқанда, олар осындай пикселдердің саны мен олардың түсі туралы жазбамен ауыстырылады).
    PNG (Portable Network Graphics) .
    JPEG-өте кең қолданылатын кескін пішімі. 
    `,
  },
  {
    title: 'Растрлық және векторлық графиканың бір-бірінен айырмашылықтарын сипаттаңыз',
    answer: `Растрлық графика-бұл компьютер мониторындағы, қағаздағы және басқа да дисплей құрылғылары мен материалдарындағы пиксельдер немесе түстер нүктелерінің торы (әдетте тікбұрышты)
    Растрлық графика фотоаппараттармен, сканерлермен, тікелей растрлық редакторда, сондай-ақ векторлық редактордан немесе скриншоттар түрінде экспорттау арқылы жасалады.
    Растрлық графика күрделілігіне қарамастан, мысалы, вектордан айырмашылығы, кез-келген үлгіні жасауға (көбейтуге) мүмкіндік береді, мұнда файл өлшемін жоғалтпай бір түстен екіншісіне өту әсерін дәл жеткізу мүмкін емес.
    Векторлық графика-бұл арнайы бағдарламалық жасақтамада математикалық сипаттаманы өңдеу арқылы құрылған компьютерлік кескінді құру әдісі. Әр түрлі түстердің пиксельдер жиынтығын білдіретін нүктелік кескіннен айырмашылығы, векторлық кескін-бұл математикалық формулалармен сипатталған примитивтер жиынтығы (сызықтар, қисықтар, квадраттар, шеңберлер). Сурет нүкте координаттары мен тірек нүктелерін кесіп өтетін сызық туралы мәліметтерді қамтитын файл түрінде жасалады. Сонымен қатар, файлда қолданылған әсерлер туралы ақпарат бар.
    Сандық кескінді құрудың бұл принципі оны масштабтауға, сапасын төмендетпей өлшемін өзгертуге, пішінін өзгертуге және бастапқы нысандар негізінде жаңа сызбалар жасау үшін примитивтерді қайта орналастыруға мүмкіндік береді. Сонымен қатар, мұндай файл растр файлымен салыстырғанда әлдеқайда аз орын алады, онда әр пиксель, оның координаттары, түсі және басқа параметрлері туралы мәліметтер бар.
    `,
  },
  {
    title: 'Екі өлшемді графикаға сипаттама беріңіз',
    answer: `2D (екі өлшем) – компьютерлік графиканың бір түрі. Мұндай сурет әрқашан тегіс көрінеді, өйткені ол тек екі өлшемді – ені мен биіктігін пайдаланады. Логотиптер, карталар, сайттар, жарнамалық баннерлер, ойындар мен қолданбалы интерфейстер, мультфильмдер мен бейнелер жасау үшін қолданылады. 2D графикасы жалпақ кескінге ұқсайтынына қарамастан, көлеңкелердің арқасында көлемді заттардың әсеріне қол жеткізуге болады (бірақ фотореализм емес).
    2D графикасының жақсы мысалы-Pac-Man және Mario сияқты ескі аркада ойындары. Тегіс боялған фигуралар жалпақ заттарды жинап, сол жалпақ әлемді шарлайды.
    2D компьютерлік графикасы негізінен дәстүрлі басып шығару және сурет салу технологиясы үшін жасалған қосымшаларда қолданылады, мысалы , типография , картография , техникалық сурет , жарнама және т.б. бұл қосымшаларда екі өлшемді кескін тек нақты әлем объектісінің көрінісі ғана емес, сонымен қатар қосылған семантикалық құндылығы бар тәуелсіз артефакт; сондықтан екі өлшемді модельдерге артықшылық беріледі, өйткені олар үш өлшемді компьютерлік графикаға қарағанда кескінді тікелей басқаруға мүмкіндік береді (олардың көзқарасы типографияға қарағанда фотосуретке ұқсас).
    Жұмыс үстеліндегі баспа жүйелері, инженерия және бизнес сияқты көптеген салаларда 2D компьютерлік графикалық әдістерге негізделген құжаттың сипаттамасы сәйкес сандық кескіннен әлдеқайда аз болуы мүмкін - көбінесе 1/1000 немесе одан да көп рет. Бұл көрініс икемді, өйткені оны әртүрлі Шығыс құрылғыларына сәйкес келетін әртүрлі рұқсаттармен көруге болады . Осы себептерге байланысты құжаттар мен иллюстрациялар көбінесе 2D графикалық файлдар ретінде сақталады немесе беріледі .
    `,
  },
  {
    title: 'Екі өлшемді графиканың түрлеріне анықтама беріңіз',
    answer: `Ищи: Растрлық графиканың ерекшеліктерін сипаттаңыз или Векторлық графиканың ерекшеліктерін сипаттаңыз или Фракталдық графиканың ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Үш өлшемді графикаға сипаттама беріңіз',
    answer: `3D графикасы (үш өлшемді графика) - бұл компьютерлік графиканың ерекше түрі – 3D объектілерінің (үш өлшемді нысандардың) суреттерін жасау үшін қолданылатын әдістер мен құралдар жиынтығы.
    3D кескінін екі өлшемді кескіннен ажырату қиын емес, өйткені ол мамандандырылған бағдарламалық өнімдерді қолдана отырып, жазықтықтағы көріністің 3D моделінің геометриялық проекциясын жасауды қамтиды. Алынған модель нақты шындықтан объект бола алады, мысалы, үй, автомобиль, комета моделі немесе мүлдем дерексіз болуы мүмкін. Мұндай үш өлшемді модельді құру процесі 3D модельдеу деп аталады және ең алдымен модельденген объектінің визуалды көлемді бейнесін жасауға бағытталған.
    3D графикалық технологиялар және 3D басып шығару технологиялары адам қызметінің көптеген салаларына еніп, үлкен пайда әкеледі.
    Үш өлшемді бейнелер күн сайын бізді теледидарда, кинода, компьютермен жұмыс кезінде және 3D ойындарда, билбордтардан 3Д графикасының барлық күші мен жетістіктерін көрнекі түрде таныстырады.
    Заманауи 3D графикасының жетістіктері келесі салаларда қолданылады
    Кино және анимация-үш өлшемді кейіпкерлер мен нақты арнайы эффектілерді жасау.Компьютерлік ойындарды құру-3D кейіпкерлерін, қоршаған ортаның виртуалды шындығын, ойындарға арналған 3D нысандарын дамыту.
    Жарнама-3D графикасының мүмкіндіктері өнімді нарыққа тиімді түрде ұсынуға мүмкіндік береді, үш өлшемді графиканың көмегімен сіз кристалды-ақ көйлек немесе шоколадты чипсы бар дәмді жеміс балмұздақының елесін жасай аласыз және т.б. сонымен қатар, нақты жарнамаланған өнімде әдемі және сапалы суреттердің артында оңай жасырылатын көптеген кемшіліктер болуы мүмкін.
    `,
  },
  {
    title: 'Үш өлшемді графиканың түрлеріне анықтама беріңіз',
    answer: `Үш өлшемді графика 3D графикасының келесі түрлерін қамтиды:
    көпбұрышты (векторлық)
    аналитикалық
    фракталдық
    сплайндық
    Векторлық графика (басқа атау — геометриялық модельдеу) — бұл компьютерлік графикада кескіндерді көрсету үшін нүктелер, сызықтар, сплайндар және көпбұрыштар сияқты геометриялық примитивтерді қолдану. Бұл термин кескіндерді пиксель (нүкте) матрицасы ретінде көрсететін растрлық графикаға қарама-қарсы қолданылады.
    Аналитикалық графика аналитикалық графикада объектілер аналитикалық түрде, яғни формулалармен беріледі.
    Мысалы: нүктеде центрі бар R радиусының шары (x0,y0,z0): (x-x0)2 +(y-y0)2 +(z-z0)2 =r2 аналитикалық нысандарды құрудың тағы бір тәсілі – айналу денелерін құру. Сонымен, шеңберді белгілі бір осьтің айналасында айналдыра отырып, сіз торды ала аласыз, ал бір уақытта өз және сыртқы осьтер айналасында созылған эллипсті айналдыра отырып, сіз әдемі гофрленген торды ала аласыз.
    Фракталдық графика фракталдық графика фрактал - өзіндік ұқсастық ұғымына негізделген. Нысанның үлкейтілген бөліктері объектінің өзіне және бір-біріне ұқсас болған кезде объектіні өзіне ұқсас деп атайды. "Өзіне ұқсас" сыныпқа рельеф жатады. Сондықтан сынған тастың жиектері көкжиектегі тау жотасына ұқсайды. Фракталдық графика, векторлық графика сияқты, математикалық есептеулерге негізделген. 
    Сплайн графикасы сплайн графикасы сплайн тұжырымдамасына негізделген. Ағылшын тіліндегі "сплайн" термині. Бұл Болаттың икемді жолағының атауы, оның көмегімен сызбашылар берілген нүктелер арқылы тегіс қисықтар жасайды. 
    `,
  },
  {
    title: 'Үш өлшемді графиктермен жұмыс істеу бағдарламаларына талдау жасаңыз',
    answer: `Әлемде 3D модельдеуге арналған көптеген бағдарламалық жасақтама бар. 
    3Ds MAX,  123D,.  AutoCAD,  Cinema 4D,  ARCHICAD,  SketchUP, Blender,  Wings 3D,  Paint 3D.
    Blender-ашық бағдарламалық жасақтама негізінде 3D объектілерімен жұмыс істеуге арналған ең танымал бағдарламалардың бірі. Бағдарламаны танымал OS қолдайды. Blender басқа кәсіби редакторларда қолданылатын барлық негізгі құралдарға ие. Бағдарламада текшелер, сақиналар, цилиндрлер және т.б. сияқты негізгі нысандар бар. Бұл бағдарламалық жасақтама үнемі жаңартылып отырады.
    Google SketchUp-бұл жаңадан бастаушыларға да ыңғайлы болуға мүмкіндік беретін ақысыз бағдарламалық жасақтама. Тегін бағдарламадан басқа, ақылы нұсқасы бар. Ақылы функционалдылық, сондай-ақ CAD форматтарына экспорттау қол жетімді.
    3ds Max-3D модельдеуге арналған ең көне және кең таралған бағдарламалардың бірі. Ол үшін ең көп бейне сабақтар, курстар және қосымша кеңейтімдер шығарылды. Көбінесе жаңадан бастаушылар оны таңдайды. Бағдарламаны жасаушылар студенттерге үш жылға арналған тегін нұсқаны ұсынады-оны рәсімдеу үшін студент ретінде тіркелу жеткілікті.
    `,
  },
  {
    title: 'Коммерциялық графикаға сипаттама беріңіз',
    answer: `Компьютерлік графиканың коммерциялық мақсатта қолданылатын, яғни сату сатып алу мақсатында қолданылатын түрі коммерциялық графика деп аталады. Оған жарнамалық мақсатта қолданылатын графикалық кескіндер жатады. Қазіргі уақытта кез келген бизнес үшін жарнаманың ролы өте жоғары. Жарнаманың тұтынушылардың назарын өзіне аударарлықтай көркем болуы аса маңызды. Осының барлығы компьютерлік графиканың көмегімен жүргізіледі. Осы графикалық кескіндерді топтастырып коммерциялық графика деп айтамыз. 
    Ірі бизнес иелерімен қатар қазір кез келген кішігірім дүкенге басаңыз да визиткалар ұсынады. Соның барлығы коммерциялық графиканың көмегімен жүргізіледі. Бұдан бөлек ақша табу мақсатында жасалатын графикалық кескіндерідің барлығын коммерциялық графикаға жатқызуға болады.
    `,
  },
  {
    title: 'Коммерциялық графиканы қолдану сфераларына талдау жасаңыз',
    answer: `Негізгі бизнес-құжаттардың мақсаты-инвесторларды, салымшыларды, демеушілерді және басқа да тұлғаларды коммерциялық саясатты мақұлдауға сендіру, күрделі салымдарды ынталандыру және т.б. алайда, тәжірибе көрсеткендей, тиімді жоспарлар жасай білу және оларды іске асыру жеткіліксіз. Ең бастысы - заставить сізге сену. Осыған байланысты коммерциялық графиканың міндеті - құжаттардың анықтығын, мәнерлілігін, анықтығын арттыру.
    Кестелер. Коммерциялық құжаттардағы негізгі ақпарат - пайда, кірістілік, тәуекел және т.б. көрсеткіштері. Бұл жолдағы алғашқы қадам-индикаторларды салыстыру мен талқылауға ықпал ететін кестеге біріктіру.
    Диаграммалар. Көрсеткіштердің көрінуін арттырудың келесі кезеңі-оларды MS Graph іскери графикалық бағдарламасында диаграмма түрінде ұсыну. Диаграммалардағы көрсеткіштер нүктелермен және пропорционалды өлшемдегі басқа геометриялық фигуралармен көрсетіледі. Екі жақты Dynamic Data Exchange (DDE) ерекше атап өтеміз. Ол автоматты жаңартуды қамтамасыз етеді:
    1) көрсеткіштер өзгерген кездегі диаграммалар және керісінше;
    2) диаграммада олардың көрсетілімдері өзгерген кездегі көрсеткіштер. Басқаша айтқанда, MS Graph-тегі кесте диаграмманың сандық көрінісі болып табылады.
    Компьютерлік желілердегі коммерциялық графика. Желілік графика құралдары әлеуетті инвесторлармен және басқа да мүдделі тұлғалармен ақпарат алмасу аясын кеңейтуге, қоғамдық пікірді басқару үшін қолайлы жағдайларды қамтамасыз етуге мүмкіндік береді. 
    `,
  },
  {
    title: 'Иллюстративті графикаға сипаттама беріңіз',
    answer: `Иллюстративті графика деп қоршаған ортадағы табиғи заттар мен әртүрлі бейнелерді компьютер көмегімен дәлме дәл салуды айтамыз. Ол графиканың күрделі түрі. Иллюстративті графикамен жұмыс істеу аса үлкен еңбекті, ізденісті, шығармашылық интеллекттің жоғарылығын талап етеді. Бірақ ол басқа графикалық кескіндерге қарағанда анағұрлым тартымды болып келеді. Оның қоладну салаларына 3Д кескіндерді жасау, аннимациялар, мультфилмдер жатады.
    Адамға компьютерді өз бетінше сурет салуға, қарындаштар, щеткалар, бояулар, компастар, сызғыштар және басқа құралдардың көмегімен қағазға қалай жасайтыны сияқты қолдануға мүмкіндік беретін бағдарламалық құралдар иллюстрациялық графикаға жатады.
    `,
  },  {
    title: 'Интерактивті машиналық графиканың ерекшеліктерін сипаттаңыз',
    answer: `Интерактивті машиналық графика дегеніміз компьютерлік графика. дальше ищи: Компьютерлікграфика түсінігіне сипаттама беріңіз`,
  },
  {
    title: 'Интерактивті машиналық графиканы түрлерін сипаттаңыз.',
    answer: `Интерактивті машиналық графика дегеніміз компьютерлік графика. дальше ищи: Компьютерлік графиканың түрлеріне сипаттама беріңіз`,
  },
  {
    title: 'Графикалық пакеттерге сипаттама беріңіз',
    answer: `Графикалық пакет-компьютерлік графикамен жұмыс істеуге арналған бағдарламалар жиынтығы. Негізгі айырмашылығы графикалық редакторы ең көп функционалдығын қамтамасыз етілетін ішкі ерекшелігі болып табылады. Әдетте, негізгі бағдарламадан басқа, графикалық пакетке пакеттің интеграциясын қамтамасыз ететін және басқа бағдарламалармен өзара әрекеттесуді қамтамасыз ететін бірқатар көмекші қосымшалар кіреді. Мысалы, Corel Graphics Suite коммерциялық пакетіне Corel Draw векторлық графикалық редакторы, Corel Phоto Paint растрлық графикалық редакторы, нүктелік кескіндерді Corel Trace векторына аударуға арналған бағдарлама және Corel Capture сияқты бірқатар қосымша утилиталар кіреді. Сол сияқты Adobe Photoshop пакетіне негізгі бағдарламадан басқа Adobe ImageReady кіреді — Web үшін кескін дайындауға бағытталған бағдарлама. Үш өлшемді графика жағдайында 3ds Max пакетінде Mental ray, Scanline рендерерлері, сондай-ақ серверлердің бүкіл кластерімен көріністерді есептеуге мүмкіндік беретін Backburner таратылған кескінді есептеу сервері/клиенті бар.`,
  },
  {
    title: 'Графикалық пакеттерді жіктеңіз',
    answer: `Графикалық пакет-компьютерлік графикамен жұмыс істеуге арналған бағдарламалар жиынтығы. Олардың 2 тобы бар. 
    Транформациялық.
    Жаңа графикалық.
    Бірінші топтағы графикалық пакеттер әлемде нақты бар графикалық бейнелерді компьютер көмегімен алдын ала өңдеу программалары. Ал  екінші тобы графикалық бейнелердің жаңа түрлерін тұрғызуға аранлаған программалар.
    Екінші топтағы графикалық пакеттер әдетте визуализация жасау үшін қолданылады. Жаңа графикалық бейнелерді өз фантазияңызбен жасауға бағытталғанү
    Арнайы мақсантына қарай графикалық пакеттерді 5 топқа бөлуге болады.
    - Арнайы бағдарламалық пакеттер Ғылыми-зерттеулер үшін.
    -Универсалды. Стандартты жабдықтар үшін.
    Қолдану саласына қарай 3 топқа бөлінеді.
    - Инженерлік графика 
    - Ғылыми графика  
    - Бизнес графика 
    `,
  },
  {
    title: 'Бизнестегі компьютерлік графикаға сипаттама беріңіз',
    answer: `Бизнес-графиканың ерекшеліктері коммерциялық процестерді графикалық түрде ұсыну және визуалды жоспарлау қажеттілігіне байланысты. Көрнекі түрдегі ақпарат көрнекі екені анық. Графикалық кескіндерді қолдана отырып, жағдайды өзіңіз түсініп, басқалардың қабылдауын жеңілдету оңай. Сонымен қатар, бизнес-процестердің графикалық көрінісі жоспарланған есептерді тікелей диаграммада шешуге мүмкіндік береді. Коммерциялық графика құралдары аналитикалық және психологиялық мәселелерді шешуге қызмет етеді. Аналитикалық міндет-рационалды іздеуге көмектесу, яғни. тиімді және сенімді шешімдер жеткілікті. Психологиялық міндет-құжатқа беріктік, сенімділік беру, оны келісу мен бекітуге ықпал ету.
    Коммерциялық көрсеткіштердің көрнекі бейнесі. Негізгі бизнес-құжаттардың мақсаты-инвесторларды, салымшыларды, демеушілерді және басқа да тұлғаларды коммерциялық саясатты мақұлдауға сендіру, күрделі салымдарды ынталандыру және т.б. алайда, тәжірибе көрсеткендей, тиімді жоспарлар жасай білу және оларды іске асыру жеткіліксіз. Ең бастысы - заставить сізге сену. Осыған байланысты коммерциялық графиканың міндеті - құжаттардың анықтығын, мәнерлілігін, анықтығын арттыру.
    Кестелер. Коммерциялық құжаттардағы негізгі ақпарат - пайда, кірістілік, тәуекел және т.б. көрсеткіштері. Бұл жолдағы алғашқы қадам-индикаторларды салыстыру мен талқылауға ықпал ететін кестеге біріктіру.
    Диаграммалар. Көрсеткіштердің көрінуін арттырудың келесі кезеңі-оларды MS Graph іскери графикалық бағдарламасында диаграмма түрінде ұсыну. Диаграммалардағы көрсеткіштер нүктелермен және пропорционалды өлшемдегі басқа геометриялық фигуралармен көрсетіледі. Екі жақты Dynamic Data Exchange (DDE) ерекше атап өтеміз. Ол автоматты жаңартуды қамтамасыз етеді:
    1) көрсеткіштер өзгерген кездегі диаграммалар және керісінше;
    2) диаграммада олардың көрсетілімдері өзгерген кездегі көрсеткіштер. Басқаша айтқанда, MS Graph-тегі кесте диаграмманың сандық көрінісі болып табылады.
    `,
  },
  {
    title: 'Ғылыми графикаға сипаттама беріңіз',
    answer: `Ғылыми графика компьютерлік графиканың алғашқы даму кезінен бастап қолданылған деп айиуға болады. Себебі ең алғашқы ЭЕМ ларында тек ғылыми есептерді шешу мүмкіндігі болды. Ғалымдар есептерді түсінікті құрастыру үшін сызбаларды ЭЕМ көмегімен салған. Содан бері ғылым саласында компьютерлік графиканы қолдану дамып келеді.Бертін келе ғылыми кестелер мен диаграммалар, объектілердің сызбалары, т.б. ғылыми жобалардың кескіндері компьютер көмегімен салынады. Заманның дамуы ғылыми графиканы компьютер автоматты түрде салып беретін жағдайға дейін жетті. Ол үшін компьютерде арнайы программалар бар.
    Ғылыми графиканың мақсаты-ғылыми зерттеу объектілерінің көрнекі бейнесі, есептеу нәтижелерін графикалық өңдеу, олардың нәтижелерін көрнекі түрде көрсете отырып, есептеу эксперименттерін жүргізу.
    Ғылыми графика. Математикалық, химиялық, физикалық формулалардан тұратын ғылыми есептеулерді, сондай-ақ картография есептерін ресімдеуге арналған. Мүмкіндік: нәтижелерді ұсына отырып, есептеу эксперименттерін жүргізу. Жүйелер математикалық қолдау және модельдеу пакеттерімен құрылады: TEX, ChiWriter.
    `,
  },
  {
    title: 'Инженерлік графикаға сипаттама беріңіз',
    answer: `Ежелгі дәуірден қазіргі уақытқа дейінгі адамның айналасындағы әлем туралы идеяларды дамытудың негізгі принциптері-қоршаған кеңістік пен оның объектілерін геометриялау және үйлестіру.
    Білім мен адам қызметінің салаларын кеңейту процесінде визуалды кескіндерді заттардың контурлары түрінде бетіне беру қабілетінен бастап инженерлік графика құруға дейін эволюция орын алды.
    Инженерлік графика деп геометриялық және Проекциялық сызуларды айтамыз. Графиканың бұл түрін жеке бір пән ретінде қарастыруға да болады. Инженерлік графиканың мақсаты - мемлекеттік стандарттар кешенімен (ГОСТ) анықталған ережелерге сәйкес сызбаларды орындау.
    Сызу арқылы графикалық статиканың дамуымен олар құрылымдар мен машиналарды жобалау кезінде кездесетін және күрделі алгебралық есептеулерді қажет ететін көптеген сандық есептерді оңай және тез шеше бастады.
    Архитектуралық сызу басқа символдар мен әдістерді қолданады, бірақ сонымен бірге өлшемдерді дәл сақтауды талап етеді, өйткені олар жоспарды циркуль мен масштабтың көмегімен тікелей өлшеу кезінде анықталады. Жұмысшы-орындаушылардың қолына берілген зауыттық сызбаларда көбінесе өрескел орындауға рұқсат етіледі, өйткені негізгі өлшемдер әдетте жазылады, ал сызбалар көбінесе толық көлемде орындалады.
    Ежелгі уақытта барлық инженерлік, сәулет және инженерлік сызбаларды мұқият аяқтау әдетке айналған: жұқа сызықтармен сызыңыз, Мұқият бояңыз және тушьті эрозиямен дөңгелек беттерді көлеңкелеңіз.
    `,
  },
  {
    title: 'Конструкторлық графикаға сипаттама беріңіз',
    answer: `Контрукторлық графика  дегеніміз техника саласындағы мамандардың, құрылысшылар мен сәулетшілердің, инженер мен технолог, конструктор мамандардың жұмысында қолданылады.Сондай ақ заманауи технологияларды шығарушы мамандардың да қолданатын графикасы осы топқа жатады. Компьютерлік графиканың бұл түрі автоматтандырылған жобалау жүйесінің міндетті элементі болып табылады. Конструкторлық графика тек екі өлшемді графикалық кескіндерді құрумен шектелмейді. Содай ақ бұл салада үш өлшемді графиканы қолдану да кеңінен таралып келеді.
    Конструктор графикасының мақсаты-сызбаларды жасау үшін дизайнерлік инженерлер мен өнертапқыштарды пайдалану. Осы салада жұмыс істейтін компьютерлік қосымшалар АЖЖ деп аталады-Автоматтандырылған жобалау жүйесі.
    Есептеулермен үйлескен Графика визуалды түрде оңтайлы дизайнды іздеуге, бөлшектердің ең сәтті орналасуына, дизайндағы өзгерістердің салдарын болжауға мүмкіндік береді. Конструктор графикасының көмегімен сіз жалпақ кескіндерді (проекциялар, бөлімдер және кеңістіктік, үш өлшемді кескіндер) ала аласыз. Конструкторлык графика кейде дизайн графикасы деп те аталады.
    `,
  },
  {
    title: 'Жарнамалық және суреттеу графикасының ерекшеліктерін сипаттаңыз',
    answer: `Жарнамалық графика графикалық дизайнның бір түріне жатады. Сату саны жарнаманың сапасы мен берілуіне байланысты. Сондықтан маркетологтар нарықты зерттейді, клиенттердің назарын аудару үшін тұтынушылармен байланысады. Айта кету керек, баспа басылымдарындағы жарнама екінші орынға шығады.
    Ал суреттеу графикасы (көркем графика) деп компьютер экранында ерікті түрде сурет салу мен сызуды айтады. Суреттеу графикасының пакеттері жалпы мақсатта пайдаланылатын қолданбалы программалық жасақтамалардың қатарына енеді. Суреттеу графикасында қолданылатын қарапайым программалық жабдықтарды графикалық редакторлар деп атайды.
    Қазіргі уақытта графикалық жарнаманы барлық жерде кездестіруге болады, өйткені ол әр түрлі формада ұсынылған. Ең танымал жарнама орналастырылған: баннерлерде; флаерлерде; плакаттар; баспа басылымдарының беттерінде; сайттарда; ғимараттардың қабырғаларында. Бизнесмендер мен маркетологтар үшін көркем жарнама графикасы сапалы және адамдарға жағымды әсер қалдыруы маңызды. Сапалы графикалық өнімді жасау үшін аналитикалық ойлау, шығармашылық көзқарас, редакторлар мен қосымшаларда тәжірибе қажет.Өте күшті графикалық пакеттерді пайдалану бізге мынадай мүмкіндіктер береді
    Реклама үшін бейнеклиптер түсіру;
    Компьютерге немесе мобильді телефонға ойындар жаса;, 
    Аннимациялық мультфильмдер түсіру; 
    Яғни, жарнама графикасы графикалық бейнелерді құру және өңдеу үшін қолданылады.Архитектурада сызба дайындау процесін автоматтандыруға және ғимараттарды қабаты бойынша жобалауға мүмкіндік береді.
    `,
  },
  {
    title: 'Жарнамалық графиканың қолданылуына талдау жасаңыз',
    answer: `Ищи: Компьютерлік графиканың жарнама қызметіндегі рольін талдаңыз`,
  },
  {
    title: 'Компьютерлік анимацияның ерекшеліктерін сипаттаңыз',
    answer: `Компьютерлік анимация-компьютердің көмегімен жасалған анимация түрі. Бүгінгі таңда ол ойын-сауық саласында да, өндірістік, ғылыми және іскерлік салаларда да кеңінен қолданылады.
    Компьютерлік анимация-үш өлшемді компьютерлік графика ("CGI-графика") көмегімен жасалған үш өлшемді анимация түрі. Компьютерлер анимацияда 1980 жылдардан бастап кеңінен қолданыла бастағанына қарамастан, компьютерлік анимация термині қазіргі уақытта үш өлшемді CGI анимациясын білдіреді, ал компьютерді қолдана отырып, екі өлшемді қолмен көбейту үшін басқа терминдер қолданылады, мысалы, Flash анимациясы және GIF анимациясы.
    Негізгі кадрларды орналастыруды аниматор жүзеге асырады. Аралық кадрларды арнайы бағдарлама жасайды. Бұл әдіс дәстүрлі қолмен жасалған анимацияға жақын, тек қаптаушының рөлін адам емес, компьютер алады.
    Компьютерлік анимацияны әмбебап графикалық файлдарда (мысалы, GIF форматында) тәуелсіз суреттер жиынтығы түрінде немесе тиісті анимация пакеттерінің мамандандырылған файлдарында (3ds Max, Blender, Maya және т.б.) текстуралар мен жеке элементтер түрінде немесе көруге арналған форматтарда сақтауға болады (FLIC (ағылш.) және ойындарда қолдану (Bink). Сондай-ақ, анимация бейнелерді сақтауға арналған форматтарда сақталуы мүмкін (мысалы, MPEG-4).
    `,
  },
  {
    title: 'Компьютерлік анимацияның маңызын талдаңыз',
    answer: `Қазіргі уақытта компьютерлік анимация (ағылш. computer animation) екі өлшемді және үш өлшемді форматта жарнамалық және маркетингтік мақсаттар мен функцияларды жүзеге асыруда жоғары бағаланады. Біздің студияда жарнамалық, корпоративтік, оқыту, таныстыру сипатындағы түрлі роликтер жасалады. Бұл векторлық, пиксельдік, интерактивті, flash, растрлық анимация 2D және 3D форматындағы бейне болуы мүмкін.
    Бүгінгі таңда анимация барлық салаларда қолданылады. Мультфильмдер ойын-сауық мақсатында теледидар мен кинотеатрларда, жарнамаларда, презентацияларда және көптеген қосымшаларда көрсетіледі. Барлығы дизайнердің қиялымен шектелген. Интернеттегі адамдарға осы өнерді үйрету үшін тренажерлер көмекке келеді. Олар анимацияны нақты уақытта болып жатқан оқиғаларға реакция жасау үшін қолданады және детерминистік емес.
    Қазіргі уақытта компьютерлік анимация кино индустриясында, сондай-ақ анимациялық студияларда кеңінен қолданылады. Оның көмегімен компьютерлік суретшілер фантастикалық кейіпкерлерді жандандырады, керемет әлемдер жасайды.
    Қазіргі уақытта компьютерлік анимацияны қолдана отырып жасалған фильмдердің көпшілігінде Жануарлар кейіпкерлері, фантастикалық кейіпкерлер, антропоморфты машиналар (арбалар, вальс және роботтар) немесе мультфильм адамдарын жасауда. Фильм соңғы қиял: біздің ішіміздегі рухтар көбінесе шынайы көрінетін адамдарды көрсетуге тырысқан алғашқы компьютерлік фильм ретінде беріледі. 
    Қазіргі уақытта үш өлшемді компьютерлік анимация қолданылады, оны екі негізгі бағытқа бөлуге болады: фотореалистік және фотореалистік емес рэндеринг.
    Фотореалистік компьютерлік анимацияны екі ішкі санатқа бөлуге болады:
    нақты фотореализм (виртуалды адам кейіпкерін құруда қозғалыс түсірілімі қолданылады);
    стильдендірілген фотореализм.
    `,
  },
  {
    title: 'Анимациямен жұмыс істеу бағдарламаларын сипаттаңыз',
    answer: `Анимациялық суреттерді жасау үшін ақылы да, ақысыз да көптеген бағдарламалар бар. Adobe Photoshop Cinema 4D Vectorian Giotto Pencil2D GIMP Adobe Animate CoffeeCup Blender Synfig Pivot Stickfigure Animator Stykz Dimp Animator Anime Studio Source Filmmaker MikuMikuDance.
    Векторлық графика мен анимация жасауға мүмкіндік беретін Adobe пакетінен қуатты веб-дизайн бағдарламасы. Animate көмегімен дайын суретті өңдеуге де, нөлден сурет салуға да оңай. Бағдарлама дыбыстық қабаттасуды, 3D модельдерін, Actionscript сценарийлерін және, әрине, басқа Adobe өнімдерімен интеграцияны қолдайды. Экспортталғаннан кейін мазмұнды веб-сайттарда, интернеттегі бейнелерде немесе ойындарда пайдалануға болады.
    Ашық бастапқы коды бар 2D анимация редакторын пайдалану өте оңай. Synfig анимацияны жасауға, сүзгілерді, көлеңкелеу және морфинг әсерлерін қолдануға мүмкіндік береді. Қаңқа анимациясына қолдау бар. Дайын материалды кейінірек немесе басқа компьютерде көрсетуге болатындығы өте ыңғайлы.
    3D нысандарын, анимациялық графиканы және нақты көрсетілімдерді құрудың кәсіби шешімі. Cinema 4D қарапайым интерфейсімен ерекшеленеді, оны тіпті жаңадан бастаушыға да түсінуге болады. Бағдарлама процедуралық және көпбұрышты модельдеуді қолдайды, сонымен қатар барлық жағдайлар үшін әртүрлі пакеттік модульдер бар, соның ішінде көріністерді визуализациялау, Нысандар динамикасын модельдеу, кейіпкерлер анимациясы және басқалары.
    Өте қол жетімді редактор, оның мамандануы ер таяқшалары бар қарапайым 2D клиптер. Бағдарлама кейіпкерлерді өз бетінше құруға, спрайттарды қолдануға, фонды өзгертуге және әртүрлі эффектілерді қосуға мүмкіндік береді. Бір сөзбен айтқанда, бірнеше минут ішінде Stickman ойындар сериясының рухында күлкілі мультфильм жасау үшін қажет нәрсенің бәрі бар.
    `,
  },
  {
    title: 'Мультимедия ұғымына түсінік беріңіз',
    answer: `Мультимедиа - бір уақытта әр түрлі формада ұсынылатын деректер немесе мазмұн: дыбыс, анимациялық компьютерлік графика, бейне тізбегі. Мысалы, бір контейнер объектісінде мәтіннен басқа-дыбыстық, графикалық және бейне ақпарат, сонымен қатар интерактивті өзара әрекеттесу әдісі болуы мүмкін. Бұған аппараттық және бағдарламалық құралдардың белгілі бір жиынтығын қолдану арқылы қол жеткізіледі.
    Мультимедиа термині көбінесе деректердің едәуір көлемін сақтауға және оларға тез қол жеткізуге мүмкіндік беретін ақпарат құралдарына қатысты қолданылады (осы типтегі алғашқы медиа ықшам дискілер болды). Бұл жағдайда мультимедиа термині компьютер осындай медианы қолдана алады және пайдаланушыға аудио, видео, анимация, сурет және басқалар сияқты барлық мүмкін мәліметтер арқылы мәтін сияқты ақпарат берудің дәстүрлі тәсілдеріне қосымша ақпарат бере алады дегенді білдіреді.
    `,
  },
  {
    title: 'Мультимедияның қолданылуына талдау жасаңыз',
    answer: `Мультимедиа жарнама, білім беру, ойын-сауық индустриясы, техника, медицина, математика, бизнес, ғылыми зерттеулер, өнер және кеңістік-уақыттық қосымшаларды қоса алғанда, әртүрлі салаларда қолданылады
    Білім беруде мультимедиялық компьютерлік оқыту курстарын (CBTS-тің танымал атауы) және энциклопедиялар мен жинақтар сияқты анықтамалық кітаптарды құру үшін қолданылады. CBT қолданушыға бірнеше презентациялар, тақырыптық мәтін және онымен байланысты иллюстрациялар арқылы ақпаратты ұсынудың әртүрлі форматтарында өтуге мүмкіндік береді. Edutainment-бұл білім мен ойын-сауықты, әсіресе мультимедиялық ойын-сауықты біріктіру үшін қолданылатын бейресми термин.
    Бағдарламалық жасақтама жасаушылар мультимедияны компьютерлік тренажерларда ойын-сауықтан бастап оқуға дейін, мысалы: әскери немесе өндірістік жаттығуларға дейін қолдана алады. Бағдарламалық интерфейстерге арналған Мультимедиа көбінесе шығармашылық мамандар мен бағдарламалық жасақтама жасаушылар арасында ынтымақтастық ретінде жасалады.
    Өнеркәсіптік секторда мультимедиа акционерлерге, басшыларға және әріптестерге ақпаратты ұсыну әдісі ретінде қолданылады. Мультимедиа сонымен қатар іс жүзінде шектеусіз веб-технологиялар арқылы бүкіл әлем бойынша қызметкерлерді оқытуды, жарнаманы және өнімді сатуды ұйымдастыруда пайдалы.
    `,
  },  {
    title: 'Анимация мен мультимедияның ерекшеліктері мен айырмашылығын ажыратаңыз',
    answer: `Компьютерлік анимация-үш өлшемді компьютерлік графика ("CGI-графика") көмегімен жасалған үш өлшемді анимация түрі. Компьютерлер анимацияда 1980 жылдардан бастап кеңінен қолданыла бастағанына қарамастан, компьютерлік анимация термині қазіргі уақытта үш өлшемді CGI анимациясын білдіреді, ал компьютерді қолдана отырып, екі өлшемді қолмен көбейту үшін басқа терминдер қолданылады, мысалы, Flash анимациясы және GIF анимациясы.
    Мультимедиа - бір уақытта әр түрлі формада ұсынылатын деректер немесе мазмұн: дыбыс, анимациялық компьютерлік графика, бейне тізбегі. Мысалы, бір контейнер объектісінде мәтіннен басқа-дыбыстық, графикалық және бейне ақпарат, сонымен қатар интерактивті өзара әрекеттесу әдісі болуы мүмкін. Бұған аппараттық және бағдарламалық құралдардың белгілі бір жиынтығын қолдану арқылы қол жеткізіледі.
    `,
  },
  {
    title: 'Мультимедиялық ақпараттарды өңдеу бойынша түсінік беріңіз',
    answer: `Ищи: Мультимедия ұғымына түсінік беріңіз или Мультимедияның қолданылуына талдау жасаңыз`,
  },
  {
    title: 'Бейнелерді өңдеуге, жасауға арналған және әмбебап, арнайы программалық құралдарға сипаттама беріңіз',
    answer: `Графикалық программалардың барлығының негізгі мақсаты графиканың қандай да бір түрін болмасын шынайы бейнелеу. Осы мақсатта қазіргі компьютерлерде көптеген графикалық пакеттер, программалар бар. Кез келген графиканы жасаушы өзінің қалауына қарай, сондай ақ жасалатын жұмысының мақсатын ескере отырып графикалық пакетті таңдай алады. Көп жағдайда әмбебап программаларға Fauve Matisse пакетін жатқызамыз. Бұл бағдарламаның өзіндік ерекшеліктері бар:
    1. Стандартты пішінді сақтайды.
    2. Бейнелеу бөлінген облыспен жұмыс жасайды.
    3. Мәтінмен жұмыс жасай алады.
    4. Әр нысан өз қабатында орналасады.
    5. Түрлерді бұрмаламайды.
    6. Бірнеше нысанды бір уақытта өңдей алады.
    7. Нысандарды топтап жұмыс жасау алады.
    Бейнелерді әмбебап өңдеуге арналған аспатар. 
    1.	нүктелердің  және дақтардың өшірілуі Despeckle, 
    2.	бейнелеу тасымалдауы Transfer, . 
    3.	қараңғылау Darken, 
    4.	диффузия Diffuse, 
    5.	өрнек Mosaic, 
    6.	осветление Lighten, 
    7.	размытие Blur, 
    8.	баттастырып жағу Smudge, 
    9.	кездейсоқ нүктелердің қосуы (Add Noise). 
    10.	көшіріп алу 
    11.	фломастермен көшіру Fel Tip, 
    12.	білезік жағыстарымен май бояумен көшіру Stroke, 
    13.	стильде көшіріп алу Dots, 
    14.	көшіріп алу аэрографпен Airbrush 
    `,
  },
  {
    title: 'Fauve matisse пакетінің мүмкіншіліктерін сипаттаңыз',
    answer: `Көп жағдайда әмбебап программаларға Fauve Matisse пакетін жатқызамыз. Бұл бағдарламаның өзіндік ерекшеліктері бар:
    1. Стандартты пішінді сақтайды.
    2. Бейнелеу бөлінген облыспен жұмыс жасайды.
    3. Мәтінмен жұмыс жасай алады.
    4. Әр нысан өз қабатында орналасады.
    5. Түрлерді бұрмаламайды.
    6. Бірнеше нысанды бір уақытта өңдей алады.
    7. Нысандарды топтап жұмыс жасау алады.
    Бейнелерді әмбебап өңдеуге арналған аспатар. 
    1.	нүктелердің  және дақтардың өшірілуі Despeckle, 
    2.	бейнелеу тасымалдауы Transfer, . 
    3.	қараңғылау Darken, 
    4.	диффузия Diffuse, 
    5.	өрнек Mosaic, 
    6.	осветление Lighten, 
    7.	размытие Blur, 
    8.	баттастырып жағу Smudge, 
    9.	кездейсоқ нүктелердің қосуы (Add Noise). 
    10.	көшіріп алу 
    11.	фломастермен көшіру Fel Tip, 
    12.	білезік жағыстарымен май бояумен көшіру Stroke, 
    13.	стильде көшіріп алу Dots, 
    14.	көшіріп алу аэрографпен Airbrush
    `,
  },
  {
    title: 'Таңбалы мәліметтерді енгізу құрылғыларын сипаттаңыз',
    answer: `Таңбалы мәліметтерді енгізу құрылғыларының бір түрі пернетақталар, оның ішінде арнайы пернетақталар. Бұл барлығына белгілі компьютердің негізгі құрылғыларының бірі. Оның мәлімет енгізудегі маңызы зор. Пернетақталардың да түр түрі бар. Олар бір бірімен функционалдығы мен басқа да ерекшеліктері арқылы ажыратылады. Көп жағдайда арнайы пернетақталар стандартты болып келеді. Пернелердің орналасуы көп жағдайда ұқсас. Пернетақталар негізінен пішіне мен жүфелік блокка касылуна карай ерекшеленеді. Пернетақталарға қойылатын эргономикалық талаптар болады. Соған сәйкес келетін пернетақталарды эгрономикалық деп айтамыз. 
    Арнайы пернетақтадан бөлек стандартты пернетақталар да бар. Бірақ олардың орналасуы падаланушы үшін қолайсыз болып келеді. Ең алғаш рет шыққан стандартты пернетақтаға бұрынғы жазу машиналары жатады. Ал стандартты пернетақтаның қазіргі дамыған түріне Дворак пернетақтасы жатады. Қарапайым адамдар стандартты пернетақтаны қолдана алмайды. Оны пайдалану үшін арнайы білім мен үйрену қажет. Сол үшін көпшілік таңбалы мәлімет енгізуде бұл құрылғыларды тиімсіз деп санайды. Бұл пернетақталар тек арнайы мамандардың қызметінде пайдалануға енгізілген. Стандартты пернетақталардың өзі жүйелік блокқа әртүрлі әдіспен қосылады. Сымды кейде сымсыз. Сымсыз пернетақтада ақпарат алмасу инфрақызыл сәулелер арқылы жүзеге асады. Алайда оның да әсерету аумағы шектеулі.
    `,
  },
  {
    title: 'Арнайы пернетақталардың таңбалы мәліметтерді енгізудегі маңызына талдау жасаңыз',
    answer: `Таңбалы мәліметтерді енгізу құрылғыларының бір түрі пернетақталар, оның ішінде арнайы пернетақталар. Бұл барлығына белгілі компьютердің негізгі құрылғыларының бірі. Оның мәлімет енгізудегі маңызы зор. Пернетақталардың да түр түрі бар. Олар бір бірімен функционалдығы мен басқа да ерекшеліктері арқылы ажыратылады. Көп жағдайда арнайы пернетақталар стандартты болып келеді. Пернелердің орналасуы көп жағдайда ұқсас. Пернетақталар негізінен пішіне мен жүфелік блокка касылуна карай ерекшеленеді. Пернетақталарға қойылатын эргономикалық талаптар болады. Соған сәйкес келетін пернетақталарды эгрономикалық деп айтамыз.`,
  },
  {
    title: 'Графикалық мәліметтерді енгізу құрылғылары туралы жалпы түсінік беріңіз',
    answer: `Ищи: Сканерлер мен сканерлердің түрлеріне анықтама беріңіз
    Планшетті сканерлерге сипаттама беріңіз
    Қол сканерлеріне сипаттма беріңіз
    Барабандық сканерлерге сипаттама беріңіз
    Форма сканерлерін сипаттаңыз`,
  },
  {
    title: 'Сканерлер мен сканерлердің түрлеріне анықтама беріңіз',
    answer: `Сканерлеу - бұл техникалық процесс, оның нәтжесінде қағаз құжаттарының графикалық суреті  құрылады. Сканерлердің көптеген  түрлері бар,барлығының принципі бірдей. Құжаттарды арнайы ток көзінің нәтижесінде жарықпен жарықтандырады,ал  суреттер  шағылыстыратын элементпен қабылданады. Суреттің минималды элементі  түсті нүкте тәрізді сканермен беріледі. Осылайша, құжатты  сканерлеу нәтижесінде  бастапқы  құжаттың  растровты  түрі сақталынатын графикалық файл құрылады. Растровты түр нүктелерден жинақталады.Нүктелердің саны суреттің өлшемімен  және сканердің өлшемімен анықталады. Сканерлердің түрлері:
    Планшетті сканерлер 
    Қол сканерлері
    Барабандық сканерлер 
    Форма сканерлері
    Штрих-сканері
    `,
  },
  {
    title: 'Планшетті сканерлерге сипаттама беріңіз',
    answer: `Планшетті сканерлер. Планшетті сканерлер мөлдір немесе мөлдір емес қағаз материалдарынан графиктік ақпараттарды енгізуге арналған. Планшетті сканерлер мынадай принциппен жұмыс істейді:
    Алдымен нысанның бетінен шағылған жарық сәулесін белгілейді. 
    Содан соң арнайы зарядтық байланысқан құралдармен тіркеледі. 
    Үшінші әрекетте бір бірімен зарядтық байланысқан құралдар берілген нысанның еніне сәйкес конструктивті линейканың көмегімен белгіленедіі. Линейканың жылжуы парақ тыныштық күйде тұрғанда іске асады, я болмаса линейканың жылжымай тұрғанда парақтың жылжуы орындалады.
    Материалды электронды түрге айналдыру үшін парақты арнайы шыны бетке, суретті төмен қаратып қою керек.
    Сканердің бұл түрі келесі артықшылықтарға ие:
    үлкен мүмкіндіктер жиынтығы;
    қарапайым жұмыс, тіпті жаңадан келген пайдаланушыларға да түсінікті;
    мүмкіндіктер мен баға санатында ерекшеленетін модельдердің кең спектрі;
    алынған кескіннің Жоғары сапасы;
    әр түрлі форматтарды қолдау.
    Кемшіліктері:
    техниканың кейбір үлгілерінің үлкен өлшемдері;
    мөлдір материалдарды сканерлеуге шектеулер бар.
    `,
  },
  {
    title: 'Қол сканерлеріне сипаттма беріңіз',
    answer: `Қол сканерлері. Қол сканерлерінің негізгі жұмыс істеу ерекшелігі планшетті сканерлердің жұмыс істеуіне ұқсас болып келеді. Қол сканерінің планшетті қолмен жылжыту қажет. Қол сканерімен сканерлеген кезде сканерлеу жұмысы түзу әрі дәл шықпайды. Қол сканерлерінің мүмкіндігі 150-300 dpi  арасында.
    Бұл құрылғылар 90-жылдардың басында танымал болды. Қол сканерлері сканерді құжаттың бетіне сүйреп апару арқылы құжаттарды сканерлеу үшін қолданылады. Олар құжат сканерлері, сондай-ақ 3-D сканерлері ретінде қол жетімді. Бұл сканерлеу тиімді болады, тек тұрақты қолмен, әйтпесе кескін бұрмалануы мүмкін. Олар бұрмалану коэффициентін анықтайтын сенсорларға ие және сканердің қозғалысы тым жылдам болса, индикатор ескертуде көрсетіледі.
    Сондай-ақ, оларда сканерлеу процесін бастайтын бастау түймесі бар. Олар компьютермен синхрондалады, сонымен қатар автоматты оптикалық ажыратымдылыққа ие. Сканерлерде сканерлеу үшін суреттерді жарықтандыратын жарық диодтары бар. Жоғары сапалы кескін үшін бұрмаланулардың орнын толтыруға көмектесетін құрылғыда қол жетімді арнайы анықтамалық маркерлер қолданылуы мүмкін.
    Суреттің сапасы нашар болғанымен, Бұл құрылғы мәтіндерді жылдам сканерлейді.
    `,
  },
  {
    title: 'Барабандық сканерлерге сипаттама беріңіз',
    answer: `Барабан сканері әлемдегі алғашқы сканер болды. Бұл 1957 жылы АҚШ-та жасалды ұлттық стандарттар бюросы. Бірінші сурет қара және ақ түсті, ажыратымдылығы 176 пиксель.
    Бұл сканер негізінен баспа индустриясында қолданылады. Бұл технологияда сканерлеу үшін фотоэлектрондық көбейткіштер (PMT) қолданылады.
    Атауынан көрініп тұрғандай, барабан сканері сканерленген құжат орнатылған барабаннан (цилиндрден) тұрады. Бұл цилиндр өте жоғары жылдамдықпен айналады, сондықтан онда орналасқан объект кескіннің көшірмесін жоғары дәлдіктегі оптика арқылы жеткізеді. Дәл оптика кескіннің бетінен шағылысқан жарықты жеткізсе де, олар қабылданады сенсор PMT-де. Ол PMT және репликалардағы сүзгі арқылы алынады. Қазіргі заманғы барабан сканерлері түрлі-түсті суреттерді үш бөлек түсті сүзгілермен тани алады. Әр түсті сүзгі өзінің құрама түсіне жауап береді [RGB]. Шағылысқан жарық үш түске бөлінеді және сүзіледі.
    Суреттің өлшемі өндірушінің барабанының дизайнына байланысты.
    Бұл сканер фильмнің ең кішкентай бөлшектерін түсіру қабілетіне байланысты баспа саласында қолданылады. Сондай-ақ, ол сынақ алаңы мен диафрагманы өз бетінше басқара алатындығының артықшылығы бар. Бұл мүмкіндік теріс пленкалардан астықты тазартуға көмектеседі, сонымен қатар сканерлеу кезінде пленканың түсі. Осылайша, олар да жасай алады жоғары ажыратымдылықты сканерлеу, түс градациясы және кескін құрылымы. Сондықтан ажыратымдылықты 12000 дюймге дейін арттыруға болады, және олар сканерленген кескінді үлкейту қажет болған кезде пайдалы.
    `,
  },
  {
    title: 'Форма сканерлерін сипаттаңыз',
    answer: `Механикалық немесе "қолмен" толтырылған стандартты пішіндерден енгізуге арналған. Бұған қажеттілік халық санағын жүргізу, сайлау нәтижелерін өңдеу және сауалнамалық деректерді талдау кезінде туындайды. Пішін сканерлері жоғары дәлдікті сканерлеуді қажет етпейді, бірақ өнімділік маңызды рөл атқарады және тұтынушылардың негізгі параметрі болып табылады.
    Кейбір деректерді әлі де қағазға жинау керек. Пішіндерді өңдеу жүйелері қол іздерін тануға, толтырылған пішіндерді сканерлеуге және қажетті деректерді дерекқорға оқуға мүмкіндік береді.
    * Қосымшалар
    * Сауалнамалар
    * Медициналық нысандар (CMS / HCFA 1500, UB-04, EOB )
    Сондай-ақ, бізде веб-пішіндер мен планшеттер сияқты бірнеше көздерден деректерді жинай алатын және деректерді жинаудың толық шешімі үшін оларды қағаз формаларымен үйлестіре алатын шешімдер бар.
    `,
  },
  {
    title: 'Графикалық планшеттерге (дигитайзерлер) сипаттама беріңіз',
    answer: `Digitizer (графикалық планшет) — бұл компьютерде суреттер мен эскиздер жасау үшін қолданылатын кескіндерді цифрландыруға арналған құрылғы. Суретші экранда кескін жасайды, бірақ оның қолы планшетте қаламмен жүреді. Әдетте, планшетті кәсіби суретшілер суреттерді дәлірек өңдеу (жасау) үшін пайдаланады.
    Digitizer немесе планшет, жиі аталады, екі негізгі элементтен тұрады: негізі және оның бетінде қозғалатын курсор. Дигитайзердің жұмыс принципі планшетке салынған тордың көмегімен курсордың орналасқан жерін бекітуге негізделген. Курсор түймесін басқан кезде оның планшеттің бетіндегі орны бекітіліп, оның координаттары компьютерге беріледі. Тор көрші өткізгіштер арасында өте үлкен қашықтықта (үш-алты мм) сымнан немесе баспа өткізгіштерінен тұрады.
    Тіркеу механизмі ақпаратты оқу қадамын тор қадамынан әлдеқайда аз алуға мүмкіндік береді (мм-ге 100 жолға дейін). Ақпаратты оқу қадамы сандық ажыратымдылық деп аталады.
    Тіркеу торын оқу қадамы-сандық ажыратымдылықтың физикалық шегі. Біз ажыратымдылық шегі туралы айтамыз, өйткені ажыратымдылықты құрылғы сипаттамасы және бағдарламалық жасақтама арқылы анықталған ажыратымдылық ретінде ажырату керек, бұл сандық параметрлерде айнымалы мән бар.
    `,
  },
  {
    title: 'Сандық фото және бейнекамераларының ерекшеліктерін сипаттаңыз',
    answer: `Сандық камера-бұл суретті жазу үшін фотоэлектрлік принцип қолданылатын камера. Бұл жағдайда жартылай өткізгіш фотоматрица жарықты электрлік сигналдарға айналдырады, олар өзгермейтін сақтау құрылғысымен сақталатын сандық мәліметтерге айналады.
    Технологияның дамуы сандық камералардың бейне жазуға жарамды және оларды бейнекамера және тіпті сандық кинокамера ретінде пайдалануға болатындығына әкелді. Сондықтан "Бейнекамера" немесе "камера" терминінің белгілі бір құрылғысына қатысты қолдану көбінесе тек конвенция болып табылады. Мұндай әмбебап сандық камералар заманауи смартфондар мен мобильді компьютерлердің көпшілігіне тұрақты түрде енеді.
    Сандық фотокамералардың негізгі құндылығы болып рұқсат етілген қабілеті болып табылады. Қазіргі кезде ең жоғарғы тұтынылатын модельдердің рұқсат етілген мөлшері 800х1200 нүктелерді құрайды. Ал кәсіби модельдерде бұл одан да жоғары. 
    Бейнекамералардың негізгі параметрлеріне токталу ушын Mustek фирмасының камераларынан қарастырайық. Рұқсат етілген мүмкіндігі: 356х292 (HxV). Деректерді өткізу жылдамдығы: 176x144, 16 бит түс 30 кадр/с. Көру бұрышы: +- 39 градус.
    `,
  },
  {
    title: 'Графиктердің негізгі элементтері және оны құру ережелеріне талдау жасаңыз',
    answer: `Графиканы құрудың 4 негізгі ережесі бар. Олар:
    1. Нүкте ережесі
    2. Тік сызық ережесі
    3. Түзу кесінді ережесі
    4. Екінші ретті қисық сызық ережесі.
    Нүкте ережесі нүктенің координаталарын белгілейді. Екі қлшемді графикада нүкте х және у екі ккординатамен анықталады.
    Тік сызық ережесі түзу сызықты анықтайтын арнайы теңдеуді белгілейді. Жазықтықтағы тұзудің теңдеуі де х және у атты екі координатамен белгіленеді. Теңдеудің түрлері әртүрлі болған сайын түзудің орналасуы да әртүрлі болады. y=kx + b
    Түзу кесінді ережесі 4 параметрмен анықталады. Оның екеуі кесіндінің бір ұшын,  ал қалған екеуі екінші ұшын анықтайды. Х1, х2, у1, у2.
    Екінші ретті қисық сызық ережесі тік сызық ережесінің күрделі түрі. Бұл түзуден өзге күрделі геометриялық фигуралардың теңдеулеріне негізделген. Олардың қарапайым түрі гипербола, парабола болса, одан өзге шеңбер, доға,эллипс сызуға дейін күрделене береді.
    х^2 + а1 * у^2 + а2 * х * у + а3 * х + а4 *у+ а5 = 0
    `,
  },  {
    title: 'Графикалық бейнелеу ерекшеліктерін сипаттаңыз',
    answer: `ЭЕМ – да «сурет салу»  маселесімен айналысатын информатика бөлімі «компьютерлік графика» деген атау алды. 
    Ақпараттық графикалық көрсетілуі адам үшін барынша көрнекі болып табылады. Бағана немесе дөңгелек сектор түріндегі индикатор көп жағдайларда ең нақты цифрлық құрал көрсетілімдері барынша қолайлы. График цифр бағаналарынан елеулі түсінікті , карта  кез – келген  жерді көлемді және нақты сипаттауға мүмкіндік береді, ал теледидардың электрлік сызбасын немесе ЭЕМ – ді ешкім басқаша бейнелеуге әрекеттенбейді. Сурет немесе фотография кез – келген нысанның сыртқы түрі жөніндегі ең ықшамды түсінікті береді, сондықтан олар кітаптарда анықтамалармен мен энциклопедияларда кеңінен пайдаланады. Мұндай мысалдар санын шексіз жалғастыруға болады. Заманауи компьютер, графикалық ақпаратты енгізуге, сақтауға, өңдеуге және шығаруға қабілетті. Бұл үшін ол техникалық құрылғылардың тұтас қатарын пайдаланады. Мәтінді басып шығарушы құрылғы бұрыннан – ақ  графикалық болып, түрлі түстермен жұмыс істей бастады. Сканер сияқты бейнені енгізуге арналған құрылғы қазір де кең таралған. Процессорлардың шапшаң әрекет етуі, ОЗУ үлкен көлемі, үлкен сыйымдылықтағы ақпарат тасымалдағыштардың жаңа түрлерінің болуы компьютерлік графикадағы елеулі ілгерілеуге мүмкіндік береді. 
    Компьютерлік графиканы заманауи қолдану әралуан. Әрбір бағыт үшін арнайы графикалық қамсыздандыру қолданылады, оларды графикалық бағдарлама немесе графикалық пакеттер деп аталады.
    `,
  },
  {
    title: 'Компьютерлік графиканың негізгі ұғымдарына анықтама беріңіз',
    answer: `Ищи: Экран көлемі ұғымына түсінік беріңіз
    Басып шығару құрылғы көлемі ұғымына анықтама беріңіз
    Бейнелеу көлемі ұғымына анықтама беріңіз
    Түр–түс ерекшелігі және түр–түс модельдерін сипаттаңыз`,
  },
  {
    title: 'Экран көлемі ұғымына түсінік беріңіз',
    answer: `Экран көлемі компьютерлк графиканың негізгі ұғымы. Ол компьютерлік жүйенің және компьютердің операциялық жүйесінің қасиетін анықтайды. Экран көлемінің өзіндің өлшемі бар. Оны пиксель деп айтамыз. Кех келген растрлық бейне пиксельмен өлшенеді. Ол суреттің размерін білдіреді. Ал экран көлемі бағдарламаның экранының қанща пиксель сурет жасай алатынын анықтайды.
    Экран көлемі-бұл компьютерлік жүйенің (монитор мен бейне картаға байланысты) және амалдық жүйенің (Windows параметрлеріне байланысты) қасиеті. Экранның ажыратымдылығы пиксельдермен (нүктелермен) өлшенеді және бүкіл экранға сәйкес келетін кескіннің өлшемін анықтайды.
    `,
  },
  {
    title: 'Басып шығару құрылғы көлемі ұғымына анықтама беріңіз',
    answer: `Компьютерлік графиканың негізгі ұғымының бірі басып шығару құрылғы көлемі. Бұл кейде принтер көлемі немесе принтер ерекшелігі деп аталады. Ол жасалған графикалық бейнені шығаратын құрылғының мүмкіндігін сипаттайды. Яғни құрылғы максимальды қанша пиксель бейне шығара алады. Сондай ақ бейненің сапасы, басып шығару жылдамдығы да ескеріледі.
    Принтердің ажыратымдылығы-бұл ұзындық бөлігінде басып шығаруға болатын жеке нүктелердің санын білдіретін принтердің қасиеті. Ол dpi бірліктерімен өлшенеді (дюймдегі нүктелер) және берілген сапада кескіннің өлшемін немесе, керісінше, берілген өлшемде кескін сапасын анықтайды.
    `,
  },
  {
    title: 'Бейнелеу көлемі ұғымына анықтама беріңіз',
    answer: `Компьютерлік графиканың негізгі ұғымының біріне бейнелеу көлемі жатады. Кейде бейнелеу ерекшелігі деп аталады. Басқа ұғымдар құрылғының ерекшелігін сипаттаса, бұл ұғым графикалық кескіннің өзіндік ерекшелігін сипаттайды. Ол графикалық кескін де арнайы өлшемдермен өлшенеді. Кейде пиксель, дюйм деп те айтады. Бейнелеу көлемі бейненің файлдық сақталуын, оның өлшемін, жадта алатын орынын, программадағы орынын анықтайды. Сондай ақ бейненің пиксельдік размерімен қатар ұзындық пен енінің қатынас өлшемін де ерекшелік ретінде қарастырады. 
    Бейнелеу көлемі-бұл кескіннің өзі. Ол сондай – ақ дюйм-dpi нүктелерінде өлшенеді және графикалық редакторда немесе сканердің көмегімен кескін жасау кезінде орнатылады.
    Кескіннің физикалық өлшемі суреттің өлшемін тігінен (биіктігі) және көлденеңінен (ені) пиксельмен де, ұзындық бірлігімен де (миллиметр, сантиметр, дюйм) өлшеуге болады. Ол суретті жасау кезінде орнатылады және файлмен бірге сақталады.
    `,
  },
  {
    title: 'Түр–түс ерекшелігі және түр–түс модельдерін сипаттаңыз',
    answer: `Графикамен жұмыс жасағнда ең бірінші кезекте түстің маңызы зор. Компьютерлік графикада кескіндердің түсі әртүрлі кодтар арқылы анықталады. Кескіндердің түс кодтары экрандағы түс санына байланысты ауысып отырады. Компьютерлік графикалық файлдың әрбір пикселі жеке түске ие. Бол бір бит кодымен есептеледі. Бір байтта 256 әр алуан түс қолданыла алады. Ал екі байтта түстер саны 65536 болуы мүмкін. Графикалық пакеттердегі true color деген түстермен жұмыс режимі осыны анықтайды.
    Түстер табиғатта өте алуан түрлі. Графикалық пакеттердің де түстер беретін мүмкіндігі де әртүрлі болып келеді. Бірнеше түстердің қосындысы жаңа бір түстің дүниеге келуіне алып келеді. Осылайша біз түстің шексіз көп түрін ала аламыз. Түстердің бұлай қосылуы түс моделі деп аталады. Түстердің түрі көп болған сайын түс моделінің де түсі көбейе түседі. Бірақ бір графикалық кескінде тек қана 3 модель қолдана аламыз. Түс модельдерінің де өзіндік кеңестілулері, атаулары бар. Мысалы: HSB, RGB, SMYK. 
    `,
  },
  {
    title: 'Бейнені басып шығару ерекшеліктерін сипаттаңыз',
    answer: `Компьютерлік графикамен жұмыс істегенде оның қағаз бетіне басып шығару жұмысы да маңызды болып табылады. Растрлық суреттерді қағаз бетіне басып шығару оңай жүргізіледі. Ал векторлық суреттерді қағаз бетіне шығарғанда дәл компьютер экранындағы бейнені алу қиын. Ал фракталды графика мүлде күрделі. Ол үшін арнайы пакеттер қолданылады. Себебі векторлық және растрлық графика тек кескіндерді құрудан тұрса, фракталды графика арнайы бағдарлама кодтарынан тұрады. Фракталды графиканың өзіндік формуласы теңдеуі болады. Сол үшін оны қағаз бетіне принтер арқылы шығара алмайсыз. 
    Графиканың қай түрін болса да басып шығару аса ұқыптылықты қажет ететін техникалық жұмыс. Сіз графикалық пакетте суретте қаншалықты көркем етіп құрсаңыз да оны дұрыс басып шығара алмасаңыз жасалған жұмыстың пайдасы көп болмайды. Бейнені басып шығару үшін басып шығару құрылғылары қолданылады. 
    `,
  },
  {
    title: 'Мөлдір пленка ұғымына анықтама беріңіз',
    answer: `Мөлдір пленка  ақ пленкамен ұқсас параметрлерге ие, бірақ кішкене нюанстар бар. Шыныға орнатқан кезде мөлдір өздігінен жабысатын пленкаға басып шығару витражға әсер етеді, яғни басып шығарылған сурет ішінара мөлдір болады. Егер сізге өте жарқын және қанық түсті кескін қажет болса, мұны ескеру қажет. Көптеген заманауи принтерлерге қатысты тағы бір нюанс: мөлдір пленкадағы ақ түсті принтердің өзінде немесе ультракүлгін принтерде осындай сия болған жағдайда ғана басып шығаруға болады. Мұны мөлдір пленкаға басып шығаруға тапсырыс беру кезінде есте ұстаған жөн. АҚ сияқты мөлдір пленка күңгірт және мөлдір болуы мүмкін, бірақ әйнектен 3D-ге дейін әр түрлі әсерлері бар мөлдір пленкалардың ерекше түрлері бар.
    Кескінді зақымданудан қорғау үшін, сондай-ақ басып шығару бетіне күтім жасау мүмкіндігін қамтамасыз ету үшін ламинация қолданылады. Бұл арнайы мөлдір пленка, әдетте қалыңдығы шамамен 60-80 мкм немесе жай мөлдір пленка. Ламинация жылтыр және күңгірт болуы мүмкін. Шамадан тыс пайдалану үшін ламинация бар, яғни зақымдану немесе абразия ықтималдығы жоғары жерлерде. Мысалы, еден жапсырмалары. Мұндай жағдайларда қалың ламинатталған пленка қарастырылған. Сондай-ақ, әртүрлі эффектілері бар ламинация бар, тек 3D ламинациясының онға жуық түрі бар.
    `,
  },
  {
    title: 'Экспликация ұғымына анықтама беріңіз',
    answer: `Компьютерлік графикадағы экспликация ұғымы басқа салаларды қолданылғандай түсіндіру, мазмұндау мағынасында қолданылады. Яғни экспликация деп программаның немесе ғылыми тілдердің түсіндірмесін айтады. Яғни графикада кескіннің мазмұнын, түр түсін, өлшемін, масштабын арнайы терминмен емес, қарапайым тілге аудара отырып түсіндіру. 
    Идеографиялық экспликация-бұл графиктің шартты белгілерін декодтау.
    Өрескел экспликация-бұл әртүрлі теориялардың терминдерін қарастыратын теория, олардың арасында ортақ нәрсе бар.
    Трансцендентальды экспликация-бұл әлемдегі Рухтың алғашқы құбылысы, бір кездері болған және бүкіл әлемде тынымсыз болып жатқан әлемнің жаратылысы.
    Графиктердің түсіндірмесі бұл графиктің мазмұнын және оның әр геометриялық белгісінің мағынасын ауызша түсіндіру.
    Экспликация немесе сипаттамалық аударма - бұл лексикалық және грамматикалық қайта құру, онда түпнұсқа тілінің лексикалық бірлігі оның мағынасын түсіндіретін фразамен ауыстырылады, яғни бұл мағынаны аударма тіліне аз немесе аз толық түсіндірме немесе анықтама береді.
    `,
  },
  {
    title: 'Суретті өңдеуге арналған пакеттерді сипаттаңыз',
    answer: `Суреттерді өңдеуге арналған пакеттер бірнеше топқа бөлінеді:
    1.	Арнауландырғыш
    2.	Әмбебап
    Арнауландырғыш пакеттер негізінен ғылыми бағытта қолдануға арналған. Көбінесе медицанада қолданылады. Геология саласында да арнаулы пакеттер қолданады. Арнаулы пакеттердің криминалистика саласында да маңызы зор. Одан бөлек биологиялық зертеулер мен географиялық тәжірибелер үшін арнаулы пакеттер қолданған ыңғайлы.
    Әмбебап пакеттер кез келген графиканы кескіндеуге арналған. Оларға барлық бағдарламашылар мен дизайнерлер қолданатын танымал графикалық пакетттер жатады. Фотошоп та әмбебап пакет ретінде есептеледі.
    Adobe Photoshop барлығына таныс. Қазір бұл кәсіпқойлар жұмысында қолданатын ең танымал бағдарлама: полиграфистер, дизайнерлер, аниматорлар, фотографтар, сәулетшілер және басқа да шығармашылық адамдар. Онсыз компьютерлік ойындарды құру мүмкін емес. Ол жарнама индустриясында белсенді қолданылады. Оның көмегімен сайттар құрылады. Сандық графикаға байланысты тапсырмалар орындалады: фотосуреттерді өңдеу, модельдеу, дизайн жұмыстары. Соңғы нұсқалар 3D файлдарымен жұмыс істеуге мүмкіндік береді.
    `,
  },
  {
    title: 'Біріктірілген графиканың ерекшеліктерін сипаттаңыз',
    answer: `Растрлық әрі векторлық болып табылатын графиканы біріутірілген графика деп айтамыз. Біріктірілген графикамен жұмыс жасауда барлық пакеттер қолжетімді емес. Біріктірілген графикамен жұмыс істеу үшін Fauve Matisse пакетін қолданса болады. Оның мүмкіндіктері:
    Суретті ашқанда файл атына емес, суретке қарап таңдаймыз.
    Бір файлға бірнеше графикалық кескін құруға болады.
    Жаңа суреттердің өлшемін пиксельдермен беруге болады.
    Суреттің белгілі бір облысын таңдап, сол жермен жұмыс істеуге болады.
    Мәтінмен жұмыс істеуге болады.
    Суреттің әр қабатымен жеке жұмыс жасауға болады.
    `,
  },
  {
    title: 'Графиканы өңдеу үшін adobe photo shop қолдану ерекшеліктерін сипатаңыз',
    answer: `Графикалық редактор жеке және коммерциялық мақсаттарда қолданылады.
    Adobe Photoshop барлығына таныс. Қазір бұл кәсіпқойлар жұмысында қолданатын ең танымал бағдарлама: полиграфистер, дизайнерлер, аниматорлар, фотографтар, сәулетшілер және басқа да шығармашылық адамдар. Онсыз компьютерлік ойындарды құру мүмкін емес. Ол жарнама индустриясында белсенді қолданылады. Оның көмегімен сайттар құрылады. Сандық графикаға байланысты тапсырмалар орындалады: фотосуреттерді өңдеу, модельдеу, дизайн жұмыстары. Соңғы нұсқалар 3D файлдарымен жұмыс істеуге мүмкіндік береді.
    Редактор копирайтерлерді, менеджерлерді, маркетологтарды белсенді қолданады. Жаңа нұсқалардың қарапайымдылығы мен ыңғайлы интерфейсі редакторды жеке мақсаттар үшін игеруге мүмкіндік береді: презентацияларда өз идеяларын жүзеге асыруға, әлеуметтік желілердегі мақалалар мен посттарға иллюстрациялар жасауға, фотосуреттерді өңдеуге.
    Сіз дизайн элементтерін өзіңіз жасай аласыз: логотиптер, түймелер, белгішелер, жарнамаға арналған баннерлер, визиткалар, құттықтау карталары.
    `,
  },
  {
    title: 'Adobe photo shop растрлік өңдеу бағдарламасына сипаттама беріңіз',
    answer: `Adobe photo shop растрлық графикамен жұмыс істеуге арналған графикалық пакет. Адоб компаниясының өнімі. Қазіргі таңда ол графикалық ақпаратты өңдеу үшін ең қолайлы бағдарламалардың тобына жатады. 
    Бағдарлама негізінен Графикалық редактор жеке және коммерциялық мақсаттарда қолданылады.
    Adobe Photoshop барлығына таныс. Қазір бұл кәсіпқойлар жұмысында қолданатын ең танымал бағдарлама: полиграфистер, дизайнерлер, аниматорлар, фотографтар, сәулетшілер және басқа да шығармашылық адамдар. Онсыз компьютерлік ойындарды құру мүмкін емес. Ол жарнама индустриясында белсенді қолданылады. Оның көмегімен сайттар құрылады. Сандық графикаға байланысты тапсырмалар орындалады: фотосуреттерді өңдеу, модельдеу, дизайн жұмыстары. Соңғы нұсқалар 3D файлдарымен жұмыс істеуге мүмкіндік береді.
    Редактор копирайтерлерді, менеджерлерді, маркетологтарды белсенді қолданады. Жаңа нұсқалардың қарапайымдылығы мен ыңғайлы интерфейсі редакторды жеке мақсаттар үшін игеруге мүмкіндік береді: презентацияларда өз идеяларын жүзеге асыруға, әлеуметтік желілердегі мақалалар мен посттарға иллюстрациялар жасауға, фотосуреттерді өңдеуге.
    Сіз дизайн элементтерін өзіңіз жасай аласыз: логотиптер, түймелер, белгішелер, жарнамаға арналған баннерлер, визиткалар, құттықтау карталары.
    `,
  },
  {
    title: 'Adobe photo shop бағдарламасының жарнама қызметіндегі рольіне талдау жасаңыз',
    answer: `Графикалық редактор жеке және коммерциялық мақсаттарда қолданылады.
    Adobe Photoshop барлығына таныс. Қазір бұл кәсіпқойлар жұмысында қолданатын ең танымал бағдарлама: полиграфистер, дизайнерлер, аниматорлар, фотографтар, сәулетшілер және басқа да шығармашылық адамдар. Онсыз компьютерлік ойындарды құру мүмкін емес. Ол жарнама индустриясында белсенді қолданылады. Оның көмегімен сайттар құрылады. Сандық графикаға байланысты тапсырмалар орындалады: фотосуреттерді өңдеу, модельдеу, дизайн жұмыстары. Соңғы нұсқалар 3D файлдарымен жұмыс істеуге мүмкіндік береді.
    Редактор копирайтерлерді, менеджерлерді, маркетологтарды белсенді қолданады. Жаңа нұсқалардың қарапайымдылығы мен ыңғайлы интерфейсі редакторды жеке мақсаттар үшін игеруге мүмкіндік береді: презентацияларда өз идеяларын жүзеге асыруға, әлеуметтік желілердегі мақалалар мен посттарға иллюстрациялар жасауға, фотосуреттерді өңдеуге.
    Сіз дизайн элементтерін өзіңіз жасай аласыз: логотиптер, түймелер, белгішелер, жарнамаға арналған баннерлер, визиткалар, құттықтау карталары.
    `,
  },
  {
    title: 'Adobe photo shop артықшылықтары мен кемшіліктерін сипаттаңыз',
    answer: `Пайдаланушылар редактордың келесі артықшылықтарын атап өтеді:
    суретті өңдеуге арналған жетілдірілген функция;
    пайдаланушы интерфейсін орнату;
    бағдарламаны орыс тіліне аудару мүмкіндігі;
    оқу бейнелері, курстар, жұмыс сипаттамалары, соның арқасында сіз редактормен жұмыс істеу дағдыларын үйреніп, дамыта аласыз;
    30 күндік тегін нұсқа редакторды сатып алу туралы шешім қабылдауға мүмкіндік береді;
    қол жетімді құралдарды одан әрі арттыру үшін кеңейтімдер мен плагиндер.
    Кемшіліктері:
    бағдарламаға жазылу өте қымбат;
    редакторды оның үлкен көлеміне байланысты барлық компьютерлерге дұрыс орнатуға болмайды;
    бағдарламаны жаңа бастаған пайдаланушы үшін игеру қиын.
    `,
  },  {
    title: 'Adobe photo shop соңғы нұсқаларындағы жаңа мүмкіндіктерге талдау жасаңыз',
    answer: `Adobe Photoshop-тың лицензияланған нұсқасы сапалы кескіндерді жасауға арналған көптеген мүмкіндіктермен жабдықталған. Функционалдылық өте ыңғайлы.
    Экранда оң жақта құралдар тақтасы, сол жақта палитралар аймағы, Басқару тақтасы, опциялар тақтасы және ортасында жұмыс кеңістігі орналасқан.
    Кез-келген қолданушы сканерленген, басылған суреттердің сапасын жақсарта алады, түс ақауларын түзете алады.
    Түс тереңдігін беру, күрделі графикамен жұмыс істеу үшін көп қабатты кескін жасау мүмкіндігі бар, қабаттардың әрқайсысын жеке-жеке өңдеуге болады.
    Редакторға фотосуреттер мен суреттерді, сондай-ақ олардың жеке элементтерін орнатуға, коллаждар жасауға болады.
    Ескі суреттерді қалпына келтіру, фотосуреттерді қалпына келтіру жұмыстары танымал.
    Photoshop - та жұмысты аппликация жасаумен салыстыруға болады, бірақ қағаз қабаттарының орнына виртуалды қабаттар қолданылады. Олар қабаттарды көшіру, біріктіру және жою үшін, сондай-ақ қабат маскалары үшін қажет. Қабаттармен жұмыс суреттің жеке нысандарын өңдеуге, жылжытуға немесе олардағы бір нәрсені суреттің қалған бөлігіне тигізуден қорықпай өзгертуге мүмкіндік береді.
    Қабаттардың болуы және олармен жұмыс істеу үшін функционалдылық бағдарламаның негізгі "чипі" болып саналады. Топтарын құруға болады неше угодно. Әр қабаттың өз атауы бар және онымен жұмыс істеу түс тереңдігін мүмкіндігінше табиғи түрде жеткізуге және бөлшектерді өңдеуге мүмкіндік береді.
    `,
  },
  {
    title: '16 бит түр-түс тереңдігіндегі графикалық мәліметтерді өңдеуге түсінік беріңіз',
    answer: `Графикалық мәліметтерді өңдеу операцияларының бірі – сканерлеу. Ежелгі сканерлердің қабілеті аса жоғары болмаған. Сондықтан олар кескін моделін дәлме дәл құрастыра алмады. Ал заманауи сканерлер 16 бит түр түс тереңдігіндегі қағаз бетіндегі графикалық кескіннің көшірмесін жасай алады. Бұрын бұндай мүмкіндікті ешқандай сканер де ешқандай графикалық пакет те жасай алмайтын еді. Сканерлерде түстердің нақты түсуі сурет сапасының жоғары болуын қамтамасыз етеді. 
    Он алты биттік түрлі түсті тереңдіктегі графикалық кескіндердің өңдеуді тек заманауи сканерлер ғана емес қазіргі заманғы графикалық пакеттер де орындай алуда. Оны жүзеге асыру үшін қазіргі графикалық пакеттерде арнайы команда қосылды. Ол фотошоп бағдарламасында бар. Фотошопта түстерді реттеу үшін соңғы внұсқаларына Matsh Color командасы қосылды. Бұл команда бір уақытта бірнеше графикалық кекінде қолданылуы мүмкін. Сондай ақ бірнеше қабатта қолданыла алады. Бұл команда белгілі бір аумаққа ғана әсер ете алады.  
    `,
  },
  {
    title: 'Histogram палитрасына сипаттама беріңіз',
    answer: `Histogram палитрасы (Гистограмма) гистограммаларды шығаруға арналған, яғни жарықтылық деңгейлері мен осы мәндерге ие пиксельдер санының графигі. Гистограмма-бұл тік жолақтар түрінде деректердің графикалық көрінісі. Леп белгісі түріндегі белгіше бар проблемалар туралы айтады: оны нұқыңыз, әсіресе тінтуір белгішесін апарған кезде пайда болатын жазба дәл осылай жасауды ұсынады.
    Histogram палитрасында (Гистограмма) командалық мәзір бар. Палитраның көрінісін осы палитраның мәзірінде орналасқан команда анықтайды. Барлығы Histogram палитрасының көрінісін көрсететін үш команда бар (Гистограмма):
    Compact View (ықшам қарау);
    Кеңейтілген көрініс(кеңейтілген көрініс);
    Барлық арналарды қарау (барлық арналарды қарау).
    Histogram палитрасы 16 биттік гистограмманы көрсетуді қолдамайды. Файлдағы жарықтылықтың әр деңгейі гистограммадағы белгілі бір деңгейге сәйкес келеді, онда барлығы 256 деңгейге дейін көрсетіледі. Егер Histogram палитрасы 16 биттік режимді қолдаса, гистограмма 65000 деңгейді көрсетуі керек еді!
    Histogram палитрасы (Гистограмма) әр редакциялау әрекетін орындау кезінде кескіннің күйін бақылаудың керемет әдісін ұсынады. Сонымен қатар, кэш мазмұнын бояғыштың жоғарғы оң жақ бұрышындағы Uncashed Refresh түймесін немесе гистограмма аймағындағы леп белгісі бар үшбұрышты басу арқылы жаңартуды ұмытпаңыз, осылайша гистограмма әрқашан суреттегі мәліметтерге сәйкес келеді. Гистограмманы кесу кезінде одан да дәл нәтиже алу үшін, "Alt" (Option) пернесін басып тұрып, Levels тілқатысу терезесіндегі кіріс деңгейінің қара және ақ жүгірткілерін жылжытыңыз.
    `,
  },
  {
    title: 'Adobe photo shop жаңа фильтрлеріне талдау жасаңыз',
    answer: `Суреттерді өңдеу, оларды түзету үшін әртүрлі құралдар қолданылады. Фотошопта фотосуреттерді өзгертуге, түрлі эффекттер қосуға, суретті жақсартуға көмектесетін сүзгіні қолдануға болады
    Сүзгілер-бұл Adobe Photoshop-та жұмыс істеу кезінде фотосуреттерге қолданылатын алдын-ала дайындалған өзгерістер. Стандартты жиынтықта фотосуретті өңдеудің әртүрлі мүмкіндіктері бар: аздап айқындықтан бастап арнайы бұрмалануларға дейін. Олар графикалық редактордың мүмкіндіктерін кеңейте отырып, кескін өңдегіші қойған тапсырмаға байланысты қолданылады.
    Бұл құралдар әртүрлі тапсырмаларды орындайды:
    суреттерді тазалау, ретуширлеу;
    әр түрлі арнайы эффектілер;
    бұрмалау әсерімен қайта құру.
    Олар бүкіл қабатқа немесе таңдалған бөлікке қолданылады. Кейбір функциялар опцияны қолданған кезде бірден орындалады, ал басқалары үшін пайда болған тілқатысу терезесіндегі параметрлерді таңдау керек, әдетте жүгірткіні жылжытады.
    Нейрондық сүзгілер — бұл "суретшілерге өздерінің шығармашылық идеяларын зерттеу және бірнеше секунд ішінде суреттерге керемет, күрделі өзгерістер енгізу үшін жасанды интеллект құралдарын қолдануға мүмкіндік беретін"жаңа мүмкіндіктер жиынтығы. Бұрын мұндай өзгерістерді қолмен жасау үшін бірнеше сағат қажет болады, бірақ жасанды интеллект оларды бірден жасауға мүмкіндік береді.
    `,
  },
  {
    title: 'Color replacement түзетуші аспабының ерекшеліктерін сипаттаңыз',
    answer: `" Color replacement " құралы фотосуреттегі объектінің немесе аймақтың түсін жаңа түске өзгертуге қабілетті, өйткені ол жаңа түсті түпнұсқамен араластыру кезінде қабаттасу режимдерін қолданады. Құрал төрт қабаттасу режимін қолданады:
    Түс реңі (реңк)
    Қанықтық (Saturation)
    Түсі (Color)
    Жарықтық (Luminosity)
    Нысанның түсі үш нәрсені анықтайды-бұл көлеңке, қанықтылық және жарықтылық. Түстерді ауыстыру үшін төрт қабаттасудың кез-келгенін таңдағанда, осы аспектілердің біреуі немесе екеуі әсер етпейді
    Түс реңі: осы араластыру режимін таңдағанда, тек түс реңктері өзгереді. Бастапқы түстің қанықтылығы мен жарықтығына әсер етпейді. Бұл режим түстер өте қарқынды емес және әдетте кішкентай өзгерістер үшін қолданылатын суреттер үшін пайдалы.
    Қанықтылық: "қанықтылық" араластыру режимі тек бастапқы түстің қанықтылығын өзгертеді, ал көлеңке мен жарықтыққа әсер етпейді. Бұл түс қарқындылығын азайту немесе тіпті түстерді толығымен алып тастау үшін пайдалы.
    Хром: бұл араластыру режимі әдепкі бойынша орнатылады және реңк пен қанықтылықты өзгертеді. Жарықтық өзгеріссіз қалады. Бұл қабаттасу режимі жиі қолданылады.
    Жарықтық: атау айтып тұрғандай, бұл режим бастапқы түстің жарықтығын жаңа түстің жарықтығына өзгертеді. Реңк пен қанықтылық өзгермейді.
    `,
  },
  {
    title: 'Adobe photo shop бағдарламасындағы траекториялық мәтін және үлкен құжаттарды қолдау ұғымына түсінік беріңіз',
    answer: `Adobe photo shop графикалық пакетінің мәтінмен жұмыс жасауға арналған функциялары әр жаңа версия шыққан сайын жаңа мүмкіндіктерге ие болып келеді. Соңғы нұсқаларында мәтінмен жұмыс жасау айтарлықтай жоғары деігейге жетті. Қазіргі бағдарламада текстпен жұмыс жасау үшін Photoshop CS құралы қолданылады. Бағдарламада құрылған траекториялық мәтіндер өзгертуге мүмкіндігі бар сондай ақ көптеген типографиялық операциялар үшін қолжетімді.

    Үлкен құжаттарды қолдау. Графикалық файл пішімдері кескін деректерін (пиксель немесе вектор түрінде) ұсыну әдісімен ерекшеленеді және әртүрлі қысу әдістері мен Photoshop функцияларын қолдайды. Photoshop-тың барлық мүмкіндіктерін (қабаттар, эффектілер, маскалар және т.б.) сақтау үшін суреттің данасын Photoshop (PSD) форматында сақтаңыз.
    Көптеген файл пішімдері сияқты, РSD пішімі 2 ГБ дейінгі файлдарды қолдайды. Көлемі 2 ГБ-тан асатын файлдарды үлкен құжат пішімі (РSB), Рhоtоshор Rаw (тек қысқартылған суреттер үшін), ТІҒҒ (4 ГБ дейін) немесе DІСОМ форматында сақтау керек.
    Кескіннің стандартты бит тереңдігі бір арнаға 8 бит. Келесі форматтарды пайдалану 16 немесе 32 биттік кескіндер үшін үлкен динамикалық диапазонды қамтамасыз етеді:
    16 биттік суреттерге арналған форматтар "көшірмені сақтау" пәрменін қажет етеді.
    Photoshop, үлкен құжат пішімі (РSВ), Саnоn, DІСОМ, TІҒҒ, JРЕG, JРЕG2000, Рhоtоshор РDҒ, Рhоtоshор Raw, РNG, портативті растрлық формат және ТІҒҒ.
    `,
  },
  {
    title: 'Adobe photo shop-қа жалпы сипаттама, бағдарламаның құрал-саймандар панелінің ерекшеліктерін сипаттаңыз',
    answer: `Adobe photo shop растрлық графикамен жұмыс істеуге арналған графикалық пакет. Адоб компаниясының өнімі. Қазіргі таңда ол графикалық ақпаратты өңдеу үшін ең қолайлы бағдарламалардың тобына жатады. 
    Бағдарлама негізінен Графикалық редактор жеке және коммерциялық мақсаттарда қолданылады.
    Adobe Photoshop барлығына таныс. Қазір бұл кәсіпқойлар жұмысында қолданатын ең танымал бағдарлама: полиграфистер, дизайнерлер, аниматорлар, фотографтар, сәулетшілер және басқа да шығармашылық адамдар. Онсыз компьютерлік ойындарды құру мүмкін емес. Ол жарнама индустриясында белсенді қолданылады. 
    Photoshop іске қосылған кезде бастапқы экран ашылады, онда сіз мыналарды таба аласыз.
    Жаңа функциялар туралы мәліметтер.
    Жалпы ақпарат, Жұмыс процесі туралы ақпарат, сонымен қатар кеңестер мен ұсыныстар бар әртүрлі нұсқаулықтар.
    Соңғы құжаттарды қарау және шақыру. Қажет болса, көрсетілетін соңғы құжаттардың санын өзгертуге болады. Параметрлер > файлдарды өңдеу тармағын таңдап, соңғы файлдар тізімінің ұзындығы өрісінде қажетті мәнді (0-100) көрсетіңіз.
    Ғіlе
    Edіt
    Іmаgе
    Lауеr
    Туре
    Sеlесt
    Ғіltеr
    ЗD
    Vіеw
    Рlugіns
    Wіndоw
    Неlр
    `,
  },
  {
    title: 'Adobe photo shop-тағы палитра түсінігіне анықтама беріңіз',
    answer: `Әр палитраның тақырыбында тінтуірдің оң жақ батырмасын басу арқылы шақыруға болатын контекстік мәзір бар. Photoshop графикалық пакетінде жасалатын көптеген операцияларр палитраларды  қолдану арқылы орындалады,  палитраларды жылжытуға да мүмкіндік бар. Панелде түсігікті болу үшін палитралар бірнеше топтарға бөлініп орналасқан: 
    1.	Navigator/Info палитралары. Мағынасы: Навигация/Ақпарат 
    2.	Color/Swatches/ Styles палитралары. Мағынасы: Түс/Үлгі/Стиль
    3.	History/Actions/Tool Presets палитралары. Мағынасы: Тарих/іс-әрекет /Құралдар,
    4.	Layers/Channels/Paths палитралары. Мағынасы: қабаттар/Каналдар/Контурлар
    5.	Character/Paragraph палитралары. Мағынасы: Шрифт/Абзац
    
    Палитраны пайдалану үшін бағдарламаның Window (Терезе) панелі қолданылады.  Палитралармен орындалатын әрекеттер үшін бірнеше пернетақтадан басылатынпернелерді білу керек. Мысалы палитраны ашу үшін ТУРЕ панелі қолданылады. Ал Ашып жабу үшін ТАВ+SHIFT  батырмаларын басу арқылы жылдам орындалады. Палитраның размерін өзгерту үшін манипуляьор қолданылады. Палитраны уақытша жабу және одан соң қайта ашу, яғни свернуть ету үшін оның атауын екі рет шерту керек.
    Kөpiнгeн кeздe пaлитpaны қaлпынa кeлтipyгe бoлaды , ocы үшiн пaйдaлaнyғa қажетке команданы қолданыныз Wіndоw > Wоrкsрасе > Rеsеt Раlеttе Lосаtіоns(Тepeзe > Жұмыcтың дaлacы > Қaлпынa келтipy).
    `,
  },
  {
    title: 'Adobe photo shop бағдарламасындағы палитралардың түрлерін ажыратыңыз',
    answer: `Ищи: Adobe photo shop-тың color (түс) политрасына сипаттама беріңіз
    Adobe photo shop-тың swatches (үлгілер) палитрасының ерекшеліктерін сипаттаңыз
    Adobe photo shop-тың styles (стильдер) палитрасының ерекшеліктерін сипаттаңыз
    Adobe photo shop-тың navigator (навигация) палитрасына сипаттама беріңіз
    Adobe photo shop-тың info (ақпарат) палитрасына сипаттама беріңіз
    Adobe photo shop-тың layers  палитрасына сипаттама беріңіз
    Adobe photo shop-тың channels (каналдар) палитрасының ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Adobe photo shop палитралардың қолданылуын түсіндіріңіз',
    answer: `Ищи: Adobe photo shop-тың color (түс) политрасына сипаттама беріңіз
    Adobe photo shop-тың swatches (үлгілер) палитрасының ерекшеліктерін сипаттаңыз
    Adobe photo shop-тың styles (стильдер) палитрасының ерекшеліктерін сипаттаңыз
    Adobe photo shop-тың navigator (навигация) палитрасына сипаттама беріңіз
    Adobe photo shop-тың info (ақпарат) палитрасына сипаттама беріңіз
    Adobe photo shop-тың layers  палитрасына сипаттама беріңіз
    Adobe photo shop-тың channels (каналдар) палитрасының ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Фильтрлерді қолдану және оның графикадағы маңызын түсіндіріңіз',
    answer: `Суретке қолмен жасалған композицияның көрінісін берудің немесе оған түзетулер енгізудің жақсы тәсілі-ауыстырылатын сүзгілерді қолдану. Бағдарламаға толықтырулар жеке қалталарда сақталады, бірақ құралдар тақтасының мәзірі арқылы қол жетімді болады. Олар Бағдарламалық жасақтамаға байланысты өзгереді: кейбір бағдарламалар әртүрлі эффектілердің керемет байлығын ұсынады.
    Photoshop және Photoshop Elements-те Adobe Illustrator және Paint Alchemy сияқты көркем сүзгілердің кең ауқымы бар, олар суретті немесе кескіндемені бір тәсілмен және техникамен мүлдем басқа нәрсеге айналдыруға мүмкіндік береді. Мысалы, пастель эскизі кросс-Люк сүзгісін қолданғаннан кейін түрлі-түсті қарындашта ұсынылуы мүмкін, ал қарындаш үлгісі көмір сүзгісімен түбегейлі өзгереді. Сондай-ақ, фотосуреттермен керемет әсерге қол жеткізе аласыз, оларға қолмен жасалған көркем шығарманың көрінісін бере аласыз.
    Сүзгілер қызықты мүмкіндіктерді ұсынады, бірақ егер олар фотосуретке емес, бар суретке қолданылса, әсерді болжау мүмкін емес. Сүзгіні таңдағанда, алдын-ала қарау терезесімен диалог өрісі пайда болады, ол соққылардың ұзындығы, щетканың егжей-тегжейі, айқындық, контраст сияқты айнымалыларды анықтауға мүмкіндік береді; бірақ сіз көрсете алатын басқару шектеулі, ал кейбір жағдайларда әсер қалаған сурет үшін тым күшті болатынына дайын болуыңыз керек. Сонымен қатар, сүзгілер әрқашан олардың атауларына сәйкес келмейді – кросс-Люк механикалық болып көрінеді, өйткені соққылар біркелкі орналасқан және тығыздығы мен қалыңдығы бірдей, ал акварель сүзгілерінің аз ғана бөлігі нақты қолмен жұмыс істеуге ұқсайды. Дегенмен, көптеген сүзгілер әдеттегі құралдармен қол жеткізуге болмайтын қызықты және ерекше әсерлер жасайды – бұл олармен тәжірибе жасаудың мағынасы. Жалпы, компьютерлік графика өнерінің бірегейлігі-бұл бояу мен қағаздың кез-келген жетіспеушілігін жояды.
    `,
  },
  {
    title: 'Жылжымалы сырғақ ұғымына түсінік беріңіз',
    answer: `Жылжымалы сырғақ -  палитра менюін,түстердің модельдерін таңдап алуға сонымен қатар түстерді араластыруға және жаңа түстерді алуға пайдаланылатын аспап. Фотошопта жылжымалы сырғақты пайдаланудың екі түрлі жолы бар.  Бірінші әдіс – клавитурадағы кнопканы бағыты бойынша басып, мышканың кнопкасын да қатар басып, орыннан қозғап, керекті жерге апаруға болады.
    Екінші әдіс шкала бойынша жүзеге асады. Ол үшін бағыт кнопкасымен сырғақты керек жерге апарамыз.
    Жылжымалы сырғақты ашу немесе жабу үшін де клавиатура қолданған дұрыс. Ол үшін ентер батырмасы қолданылады. 
    Жылжымалы сырғақ фотошопта бірқатар қызмет атқарады.:
    Біріншіден ол палитралардың мәзірін таңдауға қолданылады.
    Екіншіден түстердің реңін таңду үшін пайдаланылады.
    Үшіншіден түстерді араластырып жаңа түстер алуға болады.
    `,
  },
  {
    title: 'Жылжымалы сырғақтың қолданылуын түсіндіріңіз',
    answer: `Фотошопта жылжымалы сырғақты пайдаланудың екі түрлі жолы бар.  Бірінші әдіс – клавитурадағы кнопканы бағыты бойынша басып, мышканың кнопкасын да қатар басып, орыннан қозғап, керекті жерге апаруға болады.
    Екінші әдіс шкала бойынша жүзеге асады. Ол үшін бағыт кнопкасымен сырғақты керек жерге апарамыз.
    Жылжымалы сырғақты ашу немесе жабу үшін де клавиатура қолданған дұрыс. Ол үшін ентер батырмасы қолданылады. 
    Жылжымалы сырғақ фотошопта бірқатар қызмет атқарады.:
    Біріншіден ол палитралардың мәзірін таңдауға қолданылады.
    Екіншіден түстердің реңін таңду үшін пайдаланылады.
    Үшіншіден түстерді араластырып жаңа түстер алуға болады.
    `,
  },
  {
    title: 'Adobe photo shop-тың color (түс) политрасына сипаттама беріңіз',
    answer: `Color (Түс) политрасы бұл түстер аралас бояуға және  түстерді  таңдауға арналған  политран. Түс (Түс) палитрасының командалық мәзірін ашу үшін жүйелік жолақтың астындағы палитраның терезесінің жоғарғы оң жағында орналасқан батырманы () басу керек.
    Түс моделін таңдау үшін палитра мәзірінің бір пәрменін орындау керек:
    Grayscale Slider (сұр градация шкаласы);
    RGB Слайдерлері (RGB моделі);
    HSB Слайдерлері (HSB моделі);
    CMYK Слайдерлері (CMYK моделі);
    Lab Sliders (Lab Моделі);
    Web Color Sliders (Web Түстері).
    Түс жолағының оң жағында әдепкі бойынша екі түс бар-таза қара және ақ. Негізгі немесе фондық түстерді өңдеу үшін алдымен осы түсті бөлектеу керек. Түсті таңдау негізгі және фондық түстердің үлгілері бар квадраттардың бірінде сол жақ пернені басу арқылы жасалады.
    Түсті таңдау үшін келесі әдістерді қолдануға болады:
    жүгірушілерді түс моделінің тиісті компоненттерінің түс жолақтарының астына жылжыту;
    сандық өрістерге тиісті мәндерді енгізу арқылы;
    тамшуырдың көмегімен суреттегі түс үлгісін таңдау;
    түс таңдау тілқатысу терезесінің көмегімен түс таңдау (түстер палитрасы);
    түс шкаласында түс таңдау.
    `,
  },
  {
    title: 'Adobe photo shop-тың swatches (үлгілер) палитрасының ерекшеліктерін сипаттаңыз',
    answer: `Swatches палитрасы (үлгілері) дайын түстер мен реңктер жиынтығы ретінде қолданылады. Бұл тереземен жұмыс істеу ұқсас Терезелермен жұмыс жасаудан ерекшеленбейді, мысалы, щеткалар палитрасы (щеткалар). Swatches (үлгілер) палитрасында әдепкі бойынша тек бір түстер палитрасы бар. Осы палитраға тағы біреуін қосу үшін палитраның жоғарғы оң жағында орналасқан батырманы басыңыз. Пайда болған командалар тізімінде пәрменді таңдаңыз Load Swatches (үлгілерді жүктеу). Пайда болған load (жүктеу) тілқатысу терезесінде қажетті түстер палитрасын таңдаңыз және ол бұрын ашылған палитраның соңына қосылады.
    Кәдімгі бояғыштардан басқа, жалпақ түстермен бояғыштардың үлкен таңдауы ұсынылады.
    Бір палитраны басқасына ауыстыру үшін REPLACE Swatches пәрменін іске қосыңыз (үлгілерді ауыстырыңыз) немесе жаңа палитраның атын таңдаңыз. Осыдан кейін, бұрын ашылған барлық түстер палитралары қалпына келтіріліп, таңдалған бояғыш ашылады. Барлық орнатылған түстер палитраларын қалпына келтіру үшін reset Swatches пәрменін іске қосыңыз (үлгілерді қалпына келтіріңіз). Бұл пәрмен барлық таңдалған палитраларды қалпына келтіреді және әдепкі бойынша таңдалған палитраны жүктейді.
    `,
  },  {
    title: 'Adobe photo shop-тың styles (стильдер) палитрасының ерекшеліктерін сипаттаңыз',
    answer: `Сіз стильдер палитрасын (стильдерді) Windows > стильдердің негізгі мәзірі арқылы аша аласыз. Бұл палитрада қазіргі уақытта жүктелген барлық стильдер бар. Кезінде орыс тілінде тәрбиеленеді Styles жасауға болады жаңа стильдер шіріген. Әдепкі бойынша, палитрада әдепкі стильдер мен ақ сызылған белгіше бар-Clear Style стилінен тазарту. Әдепкі стильдерді қауіпсіз жоюға болады. Оларды Styles палитрасының жоғарғы оң жақ бұрышында орналасқан ашылмалы мәзірден бір рет басу арқылы қайтаруға болады.
    Мәзір мағынасы бойынша кіші топтарға бөлінеді. Жаңа стильді жасаудың бірінші тобы (жаңа стиль жасау) тағайындау атауынан түсінікті. Екінші топ панельдегі стильдерді көрсету әдісіне жауап береді. Опциялар: кішкентай немесе үлкен тізім немесе белгішелер. Үшінші топ preset Manager (жиынтықтарды Басқару), ол параметрлер менеджерін шақырады. Басқаша айтқанда, бұл Photoshop-қа шашыраңқы бланкілер менеджері. Preset Manager оларды бір жерде жинайды және олармен қажетті әрекеттерді жасауға мүмкіндік береді. Preset Manager арқылы топтық операцияларды жасауға болады. Мысалы, стильдер тобын таңдап, оларды бір коллекция ретінде сақтаңыз.
    `,
  },
  {
    title: 'Adobe photo shop-тың navigator (навигация) палитрасына сипаттама беріңіз',
    answer: `Navigator (Навигация) палитрасының көмегімен терезе фрагментінде көрініп тұратын  бейнелерді  таңдап алу  немесе  сол фрагменттің масштабатрын өзгерту керек.
    Пайдаланушы жұмыс істейтін сурет осы терезеде көрсетіледі. Егер кескін өңдеу терезесінде толығымен сәйкес келсе, онда Navigator палитрасында (Навигатор) ол қызыл жиекпен қоршалған болады. Жақтаудың түсі әдепкі бойынша анықталады. Егер бұл түс сәйкес келмесе, оны басқасына өзгертуге болады. Жақтаудың түсін Palette Options тілқатысу терезесінде өзгертуге болады (палитра параметрлері). Жақтаудың түсін өзгерту үшін жүйелік жолақтың астындағы палитраның оң жағында орналасқан батырманы басу керек. Navigator палитрасы мәзірінде (Навигатор) пәрмен ұсынылады: панель опциялары (палитраның параметрлері). Осы пәрменді орындағаннан кейін сол атаудағы терезе ашылады. Бұл тілқатысу терезесінде тек бір параметр орнатылады — жақтаудың түсі.
    Егер кескін өңдеу терезесіне толығымен сәйкес келсе, онда кадр бүкіл суретті толығымен алады. Егер бұл жағдайда тінтуір меңзерін Navigator (Навигатор) палитрасындағы кескінге қойса, онда ешқандай өзгеріс болмайды және Көрсеткіш ақ көрсеткі түрінде болады.
    `,
  },
  {
    title: 'Adobe photo shop-тың info (ақпарат) палитрасына сипаттама беріңіз',
    answer: `Info (Ақпарат) Палитрасы-   пикселдегі түстердің жиынтығы бейнеленген, қазіргі кезде оны  курсор арқылы көрсетеді. Сол  сияқты  орналасқан   түстердің үлгісіндегі   (максимум төрт)  бейнені таңдап алынған.
    Егерде  түстерді  өзгернту  үшін,  диалогтық терезе  ашық болса,  онда палитра   түрлі-түстегі  үлгімен  модификациядан кейінде бейнеленеді.  Одан басқа, координаталыр және  бейнені курсор арқылы көрсетеді.
    Opacity (Ашық түсті емес)  ағымдағы қабаты ашық түсте емес. Демек, түстерге ұсынылған  режимдер, палитралар,  ағымдағы  бейнеден ерекшелігі  болады.
    Түстерден  немесе  өлшем бірліктерден шығу режимін, мынадай терезелерден  таңдап алуға болады Info Options (Info опциялық палитрасынан).
    Осы  терезені  қамтамасыз  ететін команда  Palette Options менюдегі  - (Палитралар опциясы).
    `,
  },
  {
    title: 'Adobe photo shop-тың layers  палитрасына сипаттама беріңіз',
    answer: `Layers  Палитрасы Әдетте бір жаңа бейнені  құру  үшін,  оның фонын ашық түссіз етіп, таңдап алады.
    Демек, Layers (Қаьбықша) палитрасы – қабықшаларды   қосуға, жоюға,  көрсетуге/жасыруға, көшіруге, топтастыруға, байланыстыруға және  қабықшалардың  зерттеу тәртібін  өзгертуге  рұқсат береді, олардың  жоғары фонымен орналасуына да  мүмкіндік береді.
    Әрбір қабықша  өзінің жеке, аралас  режиміне  сәйкес келуі мүмкін, сол сияқты  олардың түссіз  деңгейлері және  басқа да  заттардың  әрбір қабықшаларын түзетуге  рұқсат береді. Сол сияқты  қабықшамен  масканы (mask) байланыстырады. Ондағы стандартты  қабықшаларды  Photoshop бағдарламасында   құруға болады және  екі басқа да қабықшаларды құруға рұқсат береді: түзеті  қабықшасы (adjustment layer), уақытша пайдалануға арналған немесе  соның негізінде  орнатылған  қабықша түстерін  түзетуге арналған  бағдарлама.
    `,
  },
  {
    title: 'Adobe photo shop-тың channels (каналдар) палитрасының ерекшеліктерін сипаттаңыз',
    answer: `Channels (Каналдар) палитрасында -  бейнеленеген  бір немесе  одан да көп каналдар, яғни оның құрылған бейнелері  көрсетілген.  Сол сияқты  осындай политралар көмегімен  альфа- каналдарын құруға болады,  анығырақ айтқанда, түстердің  жеке-дара  бөлініп шығуы үшін,  белгілеп алған ауданды сақтау  және тапсырылған каналдарды сақтау, немесе  плаш түстерді(spot color channel)сақтау керек.
    Контур (path) - өзімен бірге  мынадай  фигураларға рұқсат береді, яғни иілгіш  сегментті  және  тік кескінді сызықтардан тұратын пішіндерді, фигураларды  өзара нүктелермен  біріктіру.
    Контур салудың  екі тәсілі  бар: қандай болсы, нақты   фигураларды  салатын құрал-саймандардың   немесе  Реn (жазғыш Үкі)  көмегімен  суреттің шекарасын  белгілеп алу,  сосын оған контур салу.
    Контурды сызу және бояу. Ол үшін жоғары  нақтылықты талап ететін  фигуралардың  формасын сызып, белгілеп алу, ең алдымен  контурын салып алу, сосын барып  оның  қоршаған облысын  әрлеп, өңдеп, жүзеге асыру.
    `,
  },
  {
    title: 'Adobe photo shop-тың history (история) палитрасына сипаттама беріңіз',
    answer: `History (История) палитрасы көмегімен – таңдаулы түрде кері қайтаруға  немесе бірнеше әрекеттегі бейнелерді  түзету әрекеті орындалады. Бояғыштың  әрбір  жақпа майын, фильтр арқылы жүзеге асыру және  басқа да операцияларды  тізімдегі  жеке   оқиғалардың элементтері бойынша ұсыну, берілген палитраның ең  төменгі  жағында  оқиғалар бар және ол ең  соңғы оқиға. Егерде алдыңғы оқиғаны көру  үшін,  шертетін болсаңыз,  ондағы   құжаттар  қайта қалпына келіп,  осы сатыға дейінгі редакцияланады. Қандай  да бір оқиғаны  белгілеп алатын болса, ондағы палитраның  сызықтық режимде ма, жоқ ба, қалай   болатынын  анықтап алу керек.
    Егерде  белгілеп алған болсаңыз,  онда сызықтық режимдегі, сосын алдыңғы  оқиғалардың бірін  жойып немесе қалпына келтіріп, суреттерді   алдыңғы  оқиғалар бойынша түзету, ал келесі оқиғалардың  барлығын, яғни  ( палитрадағы  олардың негізгі  элементтері үйлесімсіз болады), сонымен бірге  жойылып кетеді.  Алдыңғы  өткен оқиғалардың  ішіндегі  сызықтық емес режимдерді белгілеп алу немесе жою, сол сияқты  келесі оқиғалардың  үйлесімін жоғалтпау.
    `,
  },
  {
    title: 'Adobe photo shop-тың character палитрасының ерекшеліктерін сипаттаңыз',
    answer: `Character Палитрасы Photoshop 7 версиясында мәтін жазу барысында, арнайы диалогтық терезенің қажеті  жоқ. Мұндағы барлық операциялар мен  мәтінді түзетулер Character (Шрифт) палитрасы көмегімен  іске асады. Шифт  сипаттамасына тән-  Туре (Текст-мәтін)  құрал-сайман  Панельінен  таңдап алынған опцияларды  анықтау үшін қолданылады.
    Character палитрасы(Символ) мәтінмен жұмыс жасау кезінде қолданылады. Қаріптің атауы font family тізімінде таңдалады (гарнитураны орнатыңыз), онда қаріптің дұрыс атауы таңдалады.
    Қаріп өлшемін белгілі бір мән бөлінетін font size тізімінде өзгертуге болады (кегль орнатыңыз). Егер осы тізімде ұсынылған шрифт өлшемі сізге сәйкес келмесе, онда ол қолмен, пернетақтадан орнатылады. Мұны істеу үшін font size орнату өрісін нұқыңыз (кегль орнатыңыз), қаріп өлшемінің ескі мәнін алып тастаңыз және оның жаңа мәнін енгізіңіз. Қаріпті ауыстырудың тағы бір тәсілі — тінтуірдің сол жақ батырмасын екі рет нұқу, содан кейін қаріптің ескі мәні таңдалып, оны ауыстыруға болады. Қаріп өлшемі нүктелермен өлшенеді. Өлшем бірлігін set the font size (кегльді орнатыңыз) өрісінен алып тастағанда, ол осы терезеден шыққаннан кейін автоматты түрде қалпына келтіріледі, сондықтан pt таңбаларын енгізудің қажеті жоқ. Қаріп өлшемі 0, 01-ден 1 296, 00 пт аралығында өзгеруі мүмкін.
    `,
  },
  {
    title: 'Adobe photo shop-тың paragraph (абзац)  палитрасының ерекшеліктерін сипаттаңыз',
    answer: `Paragraph (Абзац)  палитрасы  - өзімен бірге  анықталған сипаттамаларға байланысты,  мәтіннің жаңа жолдан бастауына рұқсат береді, атап айтқанда,   бірінші  қатардағы  аралық пен  абзацтардың ара қашықтығын анықтайды.
    Бұл палитрада мәтінді туралаудың келесі нұсқалары бар:
    Left align text (Мәтінді солға туралау) ;
    Center text (Мәтінді ортаға туралау) ;
    Оң жақтағы мәтін (мәтінді оңға туралау) .
    Туралау абзацтың барлық жолдарына қолданылады, ал Өшіру — Соңғы жолдан басқа барлық жолдар үшін екі жағынан туралау. Өшіру абзацтағы соңғы жолдың туралануын анықтайды.
    Бұл палитрада мәтінді өшірудің келесі нұсқалары бар:
    Justify last left (сол жақтағы соңғы жолды өшіру) ;
    Justify соңғы орталығы (ортасында соңғы жолды өшіру) ;
    Justify last right (соңғы жолды оңға қарай өшіру) ;
    Justify all (толық өшіру) .
    Палитрада сол және оң жиектерден көрсетілген пиксель санына шегіністер қарастырылған. Бұл палитрада шегіністердің мәнін берілген пиксель санына анықтауға болады. Палитрада абзацтың алдындағы және кейінгі аралықты анықтауға болады. Ол үшін dead space before paragraph (абзацтың алдына шегіністер қосу)  және paragraph-тен кейінгі кеңістікті қосу (абзацтан кейін шегініс қосу)  өрістері берілген.
    `,
  },
  {
    title: 'Corel draw-тың жұмыс ортасын сипатаңыз',
    answer: `CorelDRAW-канадалық Corel корпорациясы жасаған векторлық графикалық редактор. CorelDRAW пакетіне Corel Photo-Paint растрлық графикалық редакторы және басқа бағдарламалар кіреді — мысалы, экраннан суреттерді түсіру үшін — Corel Capture. Corel Trace растрлық графикалық векторлау бағдарламасы 12 нұсқаға дейін пакетке тәуелсіз бағдарлама ретінде кірді.
    Қолданушының жұмыс ортасы және интерфейсі.
    Corel Draw 11-ді іске қосқанда бұл Windows-қа стандартты әдіс болып келеді:бас мәзірдің көмегімен(оның ішінде пакетті орнатқанда жаңа командалар тобы шығады,оған Corel Draw қосу командасы да қосылған), жұмыс столында орналасқан көшірменің көмегімен,немесе сол кеңейтілуі(CDR,CMX,WMF сияқты файылдар кеңейтілуі) бар файылға тышқан тетігін  апарып екі рет басу қажет.
    Толығырақ программаны қосып амалдарды қалай орындау керек екенін Windows операциялық жүйесіне толығырақ танысуға болады.
    Программаны   қосқан соң экранда Corel Draw-дың бос терезесі шығады.
    Corel Draw-да жұмыс ортасын өзгерту механизмі жақсы дамыған.1,2.суретте жұмыс ортасы жүйеге программаны орнатып болған соң қалай көрінетіндігі көрсетілген.Тек бірнеше бірігетін терезелер қосылған. 
       Windows стандартына сай терезедегі тақырып қатарының астында мәзір қатары орналасады. Corel Draw-да мәзір өте күрделі, командамен мәзірлердің көптігі. Кез-келген программадағыдай,мәзір Corel Draw-дің көптеген функцияларына жол ашады,бірақ көптеген амалдар онсыз да орындала алады.Мәзірдегі шектеусіз баптаулар қолданушыны одан әрі адастырады. Corel Draw-дің кез-келген бұйрығымен құрал саймандар қажет болса кез-келгенмәзірге шыға аламыз.
      Жұмыс істеу кеңістігінің сол жағында Corel фирмасының интерфейс бөлшектері орналасқан былай айтқанда құрал жабдықтар жиынтығы(toolbox).Ісжүзінде программадағы құрал саймандар панелінің бірі болып, негізінде олжұмыс режимін таңдауға арналған, сондықтан басқаларға қарағанда көп қолданылады.Режимді таңдау үшін құрал саймандар түймесін тышқан тетігін апарып басамыз-бұл құрал саймандарды таңдау деп аталады. Құрал саймандарды таңдап болған соң қолданушының суреттегі нысаналармен жұмыс істеудегі барлық амалдары басталады.
    `,
  },
  {
    title: 'Corel draw векторлық редакторының ерекшеліктерін түсіндіріңіз',
    answer: `Векторлық форматта кез-келген бейне көптеген құрастыратын бөліктен тұрады, бірін-біріне тәуелсіз редактрленеді.
    Кішігірім төртбұрыштардан суреттер құрастырылады.Бұл нысана деп аталады.Нысана жайлы түсінік CorelDraw 10 редактіріндей басты мағлұмат болып келеді.Суреттің бөлшегі нысана болып аталады:түзу,шеңбер,тікбұрыш,қисық,тұйық қисық, көпбұрыш т.б.Бірнеше нысаналар комбинациясының көмегімен жаңа нысана құруға болады.Мұны жай мысалда қарастырып көрейік(2,1 сурет).Кез-келген нысана бірнеше түйіндермен нүктелерден тұрады,бір-бірімен түзу немесе қисық сызықпен жалғасқан сигменттер.Нысананың ішкі ауданын бір түспен құюға немесе бояуға, түстер қоспасымен және өрнектермен бояуға болады.Нысананың сигменті жоба құрайды,және өзінің түсі болады.Жобаның қалындығын өзгертуге болады.Бір нысанада әртүрлі құймалар немесе жалғастыратын әртүрлі қалындықтағы түзулер және әртүрлі түсті болуы мүмкін емес.Күрделі бейнені құру үшін көптеген нысаналар қолданылады.
    `,
  },
  {
    title: 'Corel draw-та параметрлерді баптау ерекшеліктерін түсіндіріңіз',
    answer: `Жаңа документті құрып болған соң кейде басып шығаратын беттін параметрлерін өзгерту қажет болады.Бұл операциялар атрибут панеліндегі бөлшекттердің көмегімен жүзеге асады.
    Басып шығарылатын бетінінің көлемі Poper Type тізімінде табылуы,ол атрибуттар панелінің ең төменгі сол жағында орналасқан.
    Басып шығаратын беттін көлемі қағаз бетімен сай келу міндетті емес.Ол басып шығаратын қағаздың көлемінен асып кетпесе болды.Егербасып шығару бетінің көлемі қағаз бетінен кіші болса онда илюстрацияның айналасы бос болады.
    Басып шығару бетінің көлемін орынды болу керек.Ашық хатты визитканы шығару кезінде мұнда бір немесе бірнеше көшірмесін шығаруға мүмкіндік болады.
    Басып шығару бетіне стандартқа сай емес габариттерді беру үшін,олардың мәнін Poper Width and Height-ке енгіземіз(беттің ені және биіктігі),қағаздағы фарматтар тізімінің оң жағында орналасқан.
    Басып шығару бетіндегі бағдарын өзгерту үшін оң жақта орналасқан Portrait и  Landscape сол екеуінің біреуін басамыз.Бұл түймелерде беттің тік бұрыш суреті көрсетіледі,көлденең және тік орналасқан.Мүмкін өлшеу бірліктерін өзгертуге қажет болар,себебі CorelDraw координаттары мен өлшемдерін анықтауға қолданады.Өлшеу бірлігін өзгерту үшін,Drawning Units(өлшеу бірлігі) ашылатын тізімдгі қажетті вариантты таңдаймыз.
    `,
  },
  {
    title: 'Corel draw программасында жұмыс істеудің негізгі функцияларын түсіндіріңіз',
    answer: `CorelDRAW программасын iске қосу үшiн  мына команданы орындаймыз:
    Пуск  -  Программы  - CorelDRAW -CorelDRAW 
    Сiздiң алдыңызда программаның негiзгi терезесi және диалогтың терезесi Welcome to ColarDRAW (CoralDRAWредакторына қош келдiңiз) ашылады. Сiз ол терезеден қандай жұмыс iстейтiнiңiздi таңдай аласыз.
    New Graphic (құру). Бетпараметрлерiменжаңақұжатқұрады. 
    Open Last Edited (соңғысынашу). Бұлкоманданытаңдағандасоңғыретжұмыс iстегенқұжатыңызашылады. ЕгердеCorel DRAW орнатылғансоңалғашретқоссаңыз, ондабұлкомандауақытшаорындалмайды.
    Open Graphic (Ашу).Экрандафайлдыашатындиалогтыңтерезесішығады.
    Template (Шаблон). Бұлкездеэкрандашаблонтаңдауғаарналғантерезеашылады.
    Corel TUTOR. БЅлкоманданытаңдағандаэкрандаCorel DRAWпрограммасының» мүмкiншiлiктерi, оларменқалайжұмыс iстеукерекекендiгi туралыинформацияпайдаболады.
    What's New (қандай жаңалықтар бар ? ). Егерде сiз Corel DRAW программасымен жақсы таныс болсаңыз, онда экранда оның жаңа версиялары туралы мәлiмет шығады. 
    ЕгердеShow this Welcome Screen at Startup пунктiндегi  жалаушаны алып тастасаңыз, онда Corel DRAWпрограммасынкелесi ретқосқандадиалогтықтерезешықпайды.
    `,
  },
  {
    title: 'Corel draw-тың жарнама қызметіндегі рольіне талдау жасаңыз',
    answer: `CorelDRAW - бұл Corel корпорациясы әзірлеген және сататын векторлық графикалық редактор . Бұл сондай-ақ Corel Photo-Paint растрлық кескін өңдеушісін және графикаға қатысты басқа бағдарламаларды қамтитын Corel графикалық жиынтығының атауы. Соңғы нұсқасы CorelDraw Graphics Suite 2021 (23 нұсқасына баламалы) ретінде сатылады және 2021 жылдың наурыз айында шығарылды. 
    Бағдарламаның графикалық файлдармен жұмыс істеудегі мүмкіндігі өте жоғары. Бағдарлама компьютерлік графиканың барлыө дерлік саласында қолданыс табады. Десе де негізінен бұл векторлық редактор ғылыми есептеулерде кеңінен қолданылады. Бағдарламаның жарнама қызметіндегі графикалық құралдарды өңдеуде де атқаратын қызметі зор. Нақты айтқанда CorelDraw бағдарламасы компаниялар мен фирмаларға логотиптер жасауда қолданылады. Ондай ақ бизнес иелері үшін жарнама қағаздары мен рекламалық плакаттар сияқты екі өлшемді кескіндерді өңдеуге мүмкіндік береді. Бұл бағдарлама негізінен Windows және macOS операциялық жүйелері үшін қолжетімді.
    `,
  },
  {
    title: 'Corel draw-тың стандартты құрал-саймандар панелiне сипаттама беріңіз',
    answer: `Бағдарламаның панелі мынадай компоненттерден тұрады.
    Тақырып қатары - программа аты мен ашылатын құжат атын көрсетедi. 
    Терезенi жинап қою, үлкейтiп кiшiрейту, терезенi жабу түймелерi.
    Мәзiр қатары
    Программада таєырып қатарының астында мәзiр қатары орналасады. CorelDraw программада функцияның көптеген бөлiктерiне негiзгi мәзiр арқылы емес, басқару панельдерi, докерлер, политра және диалогтық терезе арқылы қол жеткiзуiмiзге болады.
    Мәзiр қатарында мына командалар орналасқан.
    File(файл). Ашу, жабу,импорттау,экспорттау, файлды сақтау т.б. командалар тiзбегi орналасады.
    Edit(Тѕзету). Ауыстыру буферi мен кiрiстiрiлген объектiлермен жұмыс.
    View(Тѕр). құжатты көрiп шығу режимдерi т.б.
    Layout(Макет). құжат беттерiмен жұмыс.
    Effects(Эффектiлер).Кейбiр арнайы эффектiлер.
    Bitmaps (Расторлық бейнелер). Импортталған қалыпты бейнелермен жұмыс.
    Text (Мәтiн).Мәтiндi кiрiстiру және форматтау  командасы. 
    Tools(Сервис). Интерактивтi және CorelDRAW режимдерiн күйге келтiру.
    Windows (Терезе). құжаттың бiрнеше ашық, сонымен қатар көптеген докерлер мен түрлi-түстi палитралар тiзiмi.
    Help(?) (Көмек) Сұрау жүйесiнiң экран бетiне шығуы.
    `,
  },
  {
    title: 'Corel draw-тағы құрал саймандардың атқаратын қызметтерін түсіндіріңіз',
    answer: `Стандартты саймандар панелi
    Программа негiзiнде терезесiнiң сол жақ бөлiгiнде инструменттер панелi орналасқан . Бұл панельдегi қандайда бiр түйменi басу сiздiң арнайы бiр жұмысты iстейiн деп жатқаныңызды бiлдiредi. Мысалы: Rectangle (тiктөртбұрыш) түймесiн екпiндi ету, сiздi» төртбұрыш салайын деп жатєаныңызды бiлдiредi.
    Экранда саймандардың тек бiр бөлiгi ғана көрсетiлген. Бұл тiзiм кейбiреуiнiң оңжақ  бөлiгiнде тiзiм белгiсi қарастырылған. Оны тышқанның сол жақ батырмасын шерту арқылы байқауымызға болады. 
    Саймандарды» қызметi:  
    Pick (Бағыттаушы). Сiздiң жұмыс iстейтiн деп жатқан объектiлерiнiздi оқшаулауға арналған.
    ShapeEdit (Формамен жұмыс объектiлерi). Мұнда формамен жұмыс iстейтiн бiрнеше  объект қарастырылған.
    Көлемiн өзгертедi.
    Curve (Қисық). Контур сызуға арналған құрал. 
    Rectangle (Тiктөртбұрыш). Тiктөртұрыштар сызуға арналған құрал. 
    Ellipse (Эллипс). Эллипстер салуға арналған. 
    Polygon (Көпбұрыш). Көпбұрыштар салуға арналған.
    BasicShapes (Қарапайым пiшiндер). Қарапайым пiшiмдер салуқа арналған құрал.
    Text (Мәтiн). Мәтiн түрлерiн енгiзу құралы.
    InteractiveTools (Интерактивтi құралдар). Эффект құру және интерактивтiк баспаға шығару құралдары.
    Eyedropper (Пипетка). Объектiнiң көшiрмесiн енгiзу  немесе басқа объектiмен алмастырып, құрастыру.
    Outline (Объектiнiң сыртқы рамалары).  Бұл топ құрал болып саналмайды. өйткенi ол құжаттың ары қарай жұмыс iстеуiне әсер етпейдi. Олар берiлген объектiге атрибуттар дайындайды немесе жаңа күйге келтiру үшiн диалогтық терезе дайындайды.
    Fill (Құйма). Бұл топқа диалогтық терезе дайындаудың түр-түрi болады. 
    InteraktiveFill (Интерактивтi құйма). Объектiге құйманы меншiктеу және олардың интерактивтi баспаға шығарылуы.
    `,
  },  {
    title: 'Corel draw-тың атрибуттар панелінің қызметін түсіндіріңіз',
    answer: `Стандартты басқару панелiнiң астында атрибуттар панелi(Propertybar) орналасқан. Атрибуттар панелi таңдалған сайманға және оны» неге арналғанына байланысты өзгерiп отырады. Бұл панельдi қолдану жұмысты жеделдетедi.
    Бұл панель контекстке тәуелді командалық панель болып табылады. Әдетте ол стандартты құралдар тақтасының астында орналасқан. Оның басты артықшылығы айқын, ол көптеген мәзір командалары мен диалог терезелеріне жүгіну қажеттілігін іс жүзінде жояды, құралдар тақтасындағы ағымдағы құралды өзгерткен сайын өзгереді, яғни осы панельдің ондаған мүмкін конфигурациялары бар. Келесі сабақтарда жеке құралдарды қарастырған кезде сіз онымен толығырақ таныса аласыз.
    Нысанды толтыру оның атрибуттарының бірі болып табылады, сондықтан оның басқару параметрлері атрибуттар тақтасында көрсетілуі керек. Атрибуттар тақтасында толтырудың басқару параметрлері пайда болуы үшін бірдей толтырылатын нысанды немесе бірнеше нысанды таңдап, құралдар жиынтығынан интерактивті толтыру құралын таңдаңыз (интерактивті толтыру). Осыдан кейін атрибуттар тақтасы көрінеді.
    Төлсипаттар тақтасын пайдаланып біртекті толтыру параметрлерін өзгертуден басқа, бұрын жасалған толтыруды таңдалған нысанға көшіру ыңғайлы. Ол үшін толтыру атрибуттарын Көшіру түймесін басыңыз, содан кейін көшірілетін толтырғышпен объектінің кез-келген ішкі нүктесінде экранда пайда болған қалың көлденең көрсеткінің ұшын нұқыңыз. Алайда, толтыруды көшірудің бұл әдісі біртекті ғана емес, сонымен қатар арнайы құю үшін де жарамды (келесі бөлімді қараңыз). Енді ландшафтты бояу үшін біртекті толтырғыштарды қолдануға тырысайық.
    `,
  },
  {
    title: 'Corel draw-та жаңа құжат құру, ашу, жабу және сақтау жолдарын түсіндіріңіз',
    answer: `CorelDRAWiске қосқаннан соңқұжаттың терезесi ашылады. Егерде программа файл белгiсi арқылы қосылмаған болса, онда жаңа құжат болғаны. Жұмыс iстеу барысында тағы да жаңа құжат алу керек болса, онда меню қатарындағы – File(файл) мәзiрiнен New (жаңа құжат) команда немесе стандартты саймандар панелiнiң жол жағында орналасқан New (жаңа құжат) түймесiн шерту арқылы ашамыз.
    Құжатты File-Open (Файл - Ашу) немесе стандартты саймандар панелiнде орналасєан Open (Ашу) түймесi арєылы ашуға болады.  OpenDraning (Құжат ашу) диалогтық терезесi пайда болады. Сонымен қатар файл тiзiмнiң оң жағында Preview(Алдын-ала көрiп шығу) пунктiне жалауша орнату арқылы файл мазмұнын көруге болады.
    Құжатты жабу үшiн  File-Close (файл - жабу) командасын және осы терезенiң оң жақ жоғарғы бөлiгiнде  орналасқан терезенi жабу түймесiн шертсек жеткiлiктi.
    CorelDRAWпрограммасында  құжатты сақтау File-Save (файл сақтау) командасын немесе стандартты саймандар панелiнiңSave (Сақтау) түймесiн шерту арқылы iске асады. Егер де бұлқұжат алдын-ала, сақталмаған болса, онда экранда  SaveDrawing (Құжатты сақтау) диалогтық терезесi ашылады. 
    Құжатты сақтау ѕшiн сақталған папканы таңдап, Filename(Файл аты) жолына файл атын  енгiзiп, Save (сақтау) батырмасын басу керек. 
    Егер файл алдын-ала сақталған болса, онда сақтау командасын таңдағанда дискiге қайталана жазу диалогты терезе ашылмайды.
    Егер файл көшiрмесiн алып, оны File-SaveAs (Файл -қалай сақтау) командасы арқылы басєа папкаға сақтасақ, онда оған жаңа ат беруге немесе сол атпен қалдыруға болады.
    `,
  },
  {
    title: 'Corel draw-та эффектілерді қолдану ерекшеліктерін сипаттаңыз',
    answer: `Арнайы эффектілер термині (арнайы эффектілер) - өте кең ұғымға қызмет етеді. CorelDraw арнайы эффектілері жұмысты автоматтандыруға және күрделі кескіндерді жасау процесін жеңілдетуге мүмкіндік береді.
    Перспектива (Perspective) - объектіге бір және екі нүктелі перспективаны қолдануға мүмкіндік береді. Бұл жағдайда Нысандар белгілі бір қашықтықта орналасқан сияқты әсер қалдыруға болады. Ол үшін жай ғана сүйреп апарыңыз түйіндер арналған пунктирной шекарасында.
    Бұл әсердің көмегімен сіз объектіге перспективаны қосуға болады, ол белгілі бір қашықтықта немесе керісінше көрерменге жақындағандай әсер қалдырады. Осы әсерді қолдану нәтижесінде кескін көлемді болады.
    Нысанға перспектива қосылған кезде оның айналасында төрт түйінмен нүктелі жақтау пайда болады. Нысанның жоғалу нүктесін жылжыту үшін осы түйіндерді сүйреуге болады. Жойылу нүктесі-бұл объектінің алдыңғы немесе артқы жағындағы нүкте, оның бағыты бойынша объектінің мөлшері біртіндеп азаяды (шекте - оның көкжиектегі нүктеге айналуы).
    CorelDraw - да бір немесе екі нүктелі перспективаның әсерін қолдануға болады. Бірінші жағдайда бір жоғалу нүктесі, ал екінші жағдайда екі жоғалу нүктесі болады.
    `,
  },
  {
    title: 'Құжаттарды  өңдеуді автоматтандыру ұғымына түсінік беріңіз',
    answer: `ЭЕМ-нің  ең басты  еңбегі –компьютердің  негізгі  бөлігі үшін бірыңғай стандарттарды дайындау мен орнатуда. Дербес компьютерлер нарығын орнату кезеңінде, әрбір ДК–дің  аспабы өндіруші-фирманың құпиясы  болды, және бір өндіруші-фирманы  үлкен көлемде көшіру туралы сөздің де болуы мүмкін  емес. 
    Сканерден мәтінді компьютерге ендіру - бұл әдеттен тыс жұмыс.Бірақ осындай мәтінмен айналысу мүмкін емес, себебі мәтіні бар беттердегі суреттерді сканирлеу - графикалық файл болып саналады.Осыдан проблемалар туындайды:біріншіден,  графикалық форматтағы бет  үлкен орын  алады.  Және екіншісі, ең басты міндет  - сканерленген мәтінді  оқуға, редакциялауға және оның фрагменттерін жасалған құжатқа ендіру. Бірақ сканер әріптерді анықтай алмайды, себебі олар үшін тек қара түсті нүктелерді  ғана  емес  түсті нүктелерді  де болуы тиіс.
    Әлемде, графикалық форматтан сканерленген мәтінді мәтіндік түрге айналдыратын бағдарламалар бар - мәтінді  анықтау  бағдарламалары  немесе  OCR. Заманауи OCR бағдарламасы көп амалдарды білуі тиіс,сонымен  қатар белгілі бір шрифтермен терілген және  қолмен жазылған мәтінді анықтау қызметі болуы тиіс.Анық  жазылған  мәтінді анықтап қана қоймай, айқын емес  түсініксіз жазылған мәтінді анықтай  алуы  қажет. Мәселен, газет кескінінен немесе машиналық көшірмелердегі мәтіндер.Мәтінді анықтау істің тек жартысы ғана. Файлды мәтіндік және кесте форматында сақталуын қамтамасыз ету маңызды.
    `,
  },
  {
    title: 'Электронды құжат айналымды  құру құралдарын сипаттаңыз',
    answer: `Электронды құжатайналымды  құру құралдары Қазіргі заман  құжат айналымынсыз  өмір сүре алмайды. Құжаттар біздің әрбір  қадамымызда  керек. Тіпті  дүкеннен тауар сатып алу  кезінде құжат- кассалық чек беріледі.Күн сайын әлемде  үлкен  және кіші құжаттардың миллондаған көшірмелері жасалып жатады.Білім арналған құжаттарға  қағаздың үлкен көлемі жұмсалады, тіркеуге, тексеруге  және  құжаттарды сақтауға көп  уақыт кетеді.
    Құжат айналымы-құжаттарды құру, қабылдау, өңдеу, беру және мұрағаттау жүйесі, оның ішінде олардың қозғалысы мен орындалуын бақылау құралдары. 
    Электрондық құжат (ЭҚ) - Ақпаратты компьютерлік өңдеу құралдарымен жасалған цифрлық файл, Қағаз құжаттың аналогы. ЭҚ әртүрлі тасымалдаушыларда сақталуы мүмкін, ЭҚ алмасу үшін ақпаратты берудің цифрлық арналары пайдаланылады.
    Электрондық құжат айналымы (ЭДҚ) — электрондық құжаттармен жұмыс істеу процестерінің жиынтығы. Электрондық құжат айналымын жүзеге асыру үшін компьютерлер мен мамандандырылған бағдарламалық қамтамасыз ету қажет.
    Электрондық құжат айналымы жүйесі (ЭҚЖ) — электрондық құжат айналымын іске асыратын бағдарламалық қамтамасыз ету. Қазіргі заманғы ЭҚЖ пайдаланушыдан арнайы білімді талап етпейді, олардың интерфейсі интуитивті түсінікті. Сіз оны орнатқаннан кейін бірден бағдарламамен жұмыс істей бастай аласыз, ал арнайы кіріктірілген құралдар электрондық поштаны кез-келген ұйымның ерекшеліктеріне икемді түрде бейімдеуге мүмкіндік береді.
    Уақытты үнемдеу және құжат алмасу жылдамдығы
    Электрондық құжаттарды жасау үшін дайын шаблондарды пайдалануға болады. Кіріс құжаттарын тіркеу, атрибуттау, орындалуын бақылау және кеңсе жұмысының басқа стандартты рәсімдерін автоматтандыруға болады. Электрондық құжаттарды пайдаланушылардың кез келген санына жіберу дереу жүзеге асырылады.
    `,
  },
  {
    title: 'Құжаттарды электронды  формаға айналдыру ерекшеліктерін түсіндіріңіз',
    answer: `Информатиканың маңызды  міндеттерінің  бірі - құжат  айналымды  қағаз формасынан электронды форматқа ауыстыру үшін есептегіш техниканы пайдалана отырып, әдістерді ойлап табу және пайдалануға негізделеді.
    Заманауи  желілік  технологиялар  осы  тапсырманы  шешуге мүмкіндік  береді. Әлемнің барлық банктері электронды желілермен байланысқан,  және қаржылық құжаттар негізінде  электронды  түрде  жүреді.  Кәсіпорындардың  қағаз акциялары пайдаланысты шығып жатыр.Оларды электронды  депозитарияға ауыстырады – мұнда акционерлерге қатысты  құжаттар жазба түрінде сақталады.
    Windows 90x типіндегі операциялық жүйесі – мәтінді жылдам  дайындауға  және  редакциялауға, иллюстрация жасауға  мүмкіндік береді, ал компьютерлік  желілер  автономды  жұмыс  топтарында бір жобамен  жұмыс істеп  жатқан барлық қатысушыларды біріктіреді.Егер бастапқы құжаттар  электронды форматта болса, онда  қазағ күйден құжат айналымын  ауыстыру жеңіл болады. 
    Мәселен, құрастырушы кітапты  Word мәтіндік редакторында жазды, ал мүсінші иллюстрацияларды Adobe Iiiustrator веторлық  редакторында салады. Фотограф сандық фотокамерадан қанша суреттерді дайындады және оларды Adobe Photoshop редакторында  өңдейді ойлап қараңыз. Мұндай жағдайда, бастапқы  электронды  бьаспаға шығару жүйесінің арқасында  құжаттарды қорытында құжатқа жинау қажет. Редакциялаудың барлық кезеңдерді және  корректорларды электронды түрде арнайы бағдарлама құралдарының көмегімен орындайды. Жұмыс бір орыннан екінші орынға компьютерлік желі  бойынша ауысады,  және  жұмыстың барлық  қатысушылары  қағаз құжаттарынсыз бір-бірлеріне көмек береді. 
    `,
  },
  {
    title: 'Компьютерге ақпарат енгізуді автоматтандыру ерекшеліктерін сипаттаңыз',
    answer: `Қағаз құжаттарды электрондық нысанға ауыстырудың негізгі әдісі сканерлеу болып табылады. Сканерлеу нүктелерден тұратын Графикалық кескін, яғни нүктелік кескін. Нүктелер саны кескіннің өлшемімен де, сканердің ажыратымдылығымен де анықталады.
    Сканерлер мен операциялық жүйе арасындағы байланысты қамтамасыз ететін бағдарламалық интерфейстің арнайы стандарттары бар. Бұл интерфейс арнайы TWAIN хаттамасына негізделген.
    Құжатты сканерлегеннен кейін алынған графикалық кескін кейде мәтінге аударылуы керек. Ол үшін үлгіні тану құралдары деп аталатын арнайы бағдарламалық құралдар қолданылады. Орыс тіліндегі мәтінді тани алатын бағдарламалардың ішіндегі ең танымалы-ABBYY FineReader.
    Құжатты электронды түрге түрлендіру үш негізгі кезеңде жүреді. Осы кезеңдердің әрқайсысын бағдарламалар автоматты түрде де, пайдаланушының бақылауымен де орындай алады.
    1.     Сканерлеу. Сканерлеу модулі іске қосылады, сканерлеу параметрлері (ажыратымдылық, Өлшем, сканерлеу түрі) реттеледі және нақты сканерлеу орын алады.
    2.     Мәтінді сегменттеу және тану. Дайын мәтінді алудан бұрын, оларды дұрыс тану үшін (мәтіндік құжатқа айналдыру) құжаттың фрагменттерін блоктарға (мәтін, сурет, кесте және т.б.) бөлу керек.
    3.     Емлені тексеру және мәтіндік құжатты әрі қарай жұмыс істеу үшін қажетті қосымшаға жіберу немесе файлға сақтау.
    `,
  },
  {
    title: 'Сканерлеу және оны жүзеге асыратын құрылғыларға сипаттама беріңіз',
    answer: `Қағаз құжаттарды  электронды  формаға  ауыстырудың  негізгі әдісі  - сканерлеу болып  табылады.
    Сканерлеу - бұл техникалық процесс, оның нәтжесінде қағаз құжаттарының графикалық суреті  құрылады. Сканерлердің көптеген  түрлері бар,барлығының принципі бірдей. Құжаттарды арнайы ток көзінің нәтижесінде жарықпен жарықтандырады,ал  суреттер  шағылыстыратын элементпен қабылданады. Суреттің минималды элементі  түсті нүкте тәрізді сканермен беріледі. Осылайша, құжатты  сканерлеу нәтижесінде  бастапқы  құжаттың  растровты  түрі сақталынатын графикалық файл құрылады. Растровты түр нүктелерден жинақталады.Нүктелердің саны суреттің өлшемімен  және сканердің өлшемімен анықталады.
    Құжатты сканермен  өңдегеннен соң   құжаттың графикалық көрінісі  шығады. Бірақ графикалық  көрініс  құжаттың  мәтіні  болып  табылмайды.  Адамға  қағаз бетінде қанша және  не  жазылғанын түсіну  үшін қағазға  бір  қарау  жеткілікті. 
    Компьютер  тілімен айтқанда,сканерлеудің нәтижелері мәтіндік құжатқа емес  түрлі түсті нүктелерге айналады. Мәтінді  нүктелік графикалық  сурет құрамында анықтау проблемасы өте күрделі жұмыс болып табылады. Осындай жұмыстар арнайы бағдарламалық құралдардың көмегімен  шешіледі. Осы  саладағы  нағыз техникалық  жаңалықтар соңғы жылдарда  орын алды.«Ұқсастық»  өлшемі  бағдарламасының авторлары  символдардың сәйкестендірілуін қолданады. Осындай жүйелер Ocr (Optikalcharacted Recognition - оптическое распознавание символов) деп аталады және   жаңадан тағдалған шрифтерге  сүйенеді. Заманауи  бағдарламалар түзетусіз әртүрлі шрифтермен  жұмыс істей алады.
    `,
  },
  {
    title: 'Мәтіндерді анықтау  бағдарламаларына талдау жасаңыз',
    answer: `Мәтіндерді анықтау  бағдарламасы  
    Анықталған мәтіндердің, сканерленген құжаттардың қажеттілігі үлкен, сондықтан осы  мақсатқа арналған  бағдарламалардың  үлкен  көлемі бар.  Сонымен, мәтінді анықтаудың  әртүрлі  ғылыми идеялар достың нәтижесінде дамыған,осы бағдарламалардың көпшілігі әртүрлі алгоритмдерді пайдаланады. Осы алгоритмдер әртүрлі  құжаттар үшін әртүрлі нәтижелер беруі мүмкін.  Мәселен, OCR жүйесі  стандартты  дайындалған шрифті анықтауға  қабілетті  және осы  шрифте ешқандай басқа  да  бағдарламаларда  мүмкін болмайтын жақсы нәтижелер береді.  
    Мәтінді анықтайтын заманауи  алгоритмдер бұрынғы шрифтке, және бұрынғы әліпбиге бағытталмайды. Бағдарламалардың  көпшілігі мәтінді бірнеше тілде анықтайды. Бір алгоритм   орыс,  латын, араб және басқа да  әліпбилерді және тіпті аралас мәтінді анықтау қабілетіне ие болуы мүмкін.  Бізді  орыс  тілінде  жазылған мәтінді  анықтауға  бағдарламалар қызықтырады. Осындай бағдарламаларды  отандық  өндірушілер  шығарады.  
    Fine Reader және  Cunei Form анықтауыш бағдарламаларын  кеңінен танымал.
    Fine Reader бағдарламасы анықтаудың  жоғары сапасын және  пайдаланудағы  ыңғайлылықты қамтамасыз етеді.
    `,
  },
  {
    title: 'Coreldraw 10-ның мүмкіндіктеріне талдау жасаңыз',
    answer: `CorelDraw 10-мен жұмыс істеуден бұрын CorelDraw 10-ның барлық мүмкіндіктерін біліп алу керек. Жоғарыда көрсетілгендей CorelDraw 10 кез-келген векторлық графиктерде нысананың мағынасы болып келеді.Кез-келген сәндеу жұмысы нысананы құру кезінде бекітіледі.Оларды өзгерту және орналастыруды кез-келген қажет жерге қоюға болады.Біріншіден нысананың пішіні болжанып алынады.Содан-соң қосымша формаларды қосу арқылы бекітіледі.Қажетті пішінді істеп болған соң нысанаға түс беріледі және нысананы бояу түсі де таңдалады.Редакторда стандартты пішіндерді құруға болады:тікбұрыш,элипс,көпбұрыш,автофигуралар,спираль,торлар,түзу және қисық сызықтардан тұратын әртүрлі пішіндер.Стандартты пішіндердің ішінде көптеген күрделі суреттер көрсетіледі. CorelDraw жұмыс істеу мүмкіндіктері тақырыптық редактормен сәейкес келеді.Форматтаудың көптеген мүмкіндіктерінің арқасындаредактрде кішігірім текстік докуметтерді және суреттерді безендіре аламыз.Редакторда жасалған әрбір сурет бір немесе бірнеше нысаналардан тұрады.Олар толықтай жинла алады немесе бөлшектеп бірін-бірі жабады. CorelDraw 10  ішінде clipart атты дайын суреттер қосылған.
    Қорытындылай келе мына мүмкіндіктерді айтуға болады:
    Қарапайым геометриялық фигураларды құру немесе қисық және сынған,тұйықталған т.б. Қою және тақырыпты фарматтау.
    Кез-келген нысананы пішіндеу жобамен құйманың түсін өзгерту,нысананың пішінін өзгерту.
    Дайын суретті қою немесе ертеде өзінің құжатта жасаған суреттер
    Көптеген суреттік эфектілерді қолдану.
    Барлық обьектілерді өзімізге қажетті жерге орналастыру,нысаналардың қатармен орналасуын анықтау.
     Редактрдегі жұмыс үстелінің бөлшектері.
    `,
  },
  {
    title: 'Corel draw мәзірінің командалары мен функцияларына түсінік беріңіз',
    answer: `Ищи: Corel draw-тағы құрал саймандардың атқаратын қызметтерін түсіндіріңіз
    Corel draw-тың стандартты құрал-саймандар панелiне сипаттама беріңіз`,
  },
  {
    title: 'Coreldraw 10-ды қолданудың негізігі мақсаттарына талдау жасаңыз',
    answer: `Ищи: Coreldraw 10-ның мүмкіндіктеріне талдау жасаңыз`,
  },
  {
    title: 'Fine reader бағдарламасының ерекшеліктерін сипаттаңыз',
    answer: `Fine Reader бағдарламасы отындық АВВУУ Softwar компаниясымен шығарылады. Fine Reader алғаш сериясы 1993жылы шығарылған. Бұл бағдарлама орыс, ағылшын, неміс, украйна, француз және де басқа тілдердегі мәтіндерді танып білуге арналған. Бағдарламаның бірқатар ыңғайлы мүмкіндіктері бар. Ол бір операцияға сканерлеу және танып білуді біріктіруге , құжаттар тізімін және бланктермен жұмыс істеуге мүмкіндік береді. Бағдарламаларды сәтсіз терілген мәтіндер немесе қиын шрифттердің сапасын жоғарлату мақсаттары да танып білу үшін қолдануға болады. Ол мәтіндерді редактрлеуге және оның орфаграфиясын тексеруге мүмкіндік береді. 
    Fine Reader сканерлеудің әр түрлі үлгілерімен жұмыс істейді. Жекелей алғанда TWAIN стандартын ұстайды. 
    Fine Reader бағдарламасын орнатқан соң бағдарламалар менюінде онымен жұмыс  жасауды қамтамасыз ететін пункттер пайда  болады. Бағдарламаның терезесі Windows бағдарламалары үшін тән болып келеді және меню қатары мен жұмыс аймағы болады.
    Көптеген екінші қосымшалар сияқты Windows Fine Reader бағдарламасын нақты қолданушы қажеттілігіне сәйкес орнатуға болады. Барлық орнату жұмыстары Опции және сервис диалогты терезелері көмегімен жасалады. Егер құрал- саймандар панелі пайдаланылса , онда диалогты терезе құрал- саймандар панелі пайдаланылса, сәйкес орамада ашылады. 
    `,
  },
  {
    title: 'Fine reader бағдарламасын құжаттарды тану бағдарламасы ретінде сипаттаңыз',
    answer: `Ищи: Fine reader бағдарламасының ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Мәтінді автоматты тану ұғымына түсінік беріңіз',
    answer: `Құжатты сканермен өңдеген соң құжаттың графикалық түрі шығады. Алайда графикалық түрі құжаттың мәтіні бола алмайды. Онда қанша және не жазылғанын түсіну үшін  мәтіні бар қағазға бір қарағанның өзі жеткілікті. Сайып келгенде , сканерлеудің соңы мәтіндік құжат емес, түрлі-түсті нүктелер коллекциясына айналады.Нүктелік графикалық бейнесі бар мәтіндерді мәтіндерді тану мәселесі өте қиын болып келеді. Мұндай қиындықтар арнайы бағдарламалық құралдар көмегімен шешілді . Бұл саладағы техникалық алға басу соңғы жылдары кең етек жайды. Мера “ cходства” бағдарламасының авторлары символдардың идентиорикациясын қолданған. Мұндай жүйелер OCR (Optikalcharacted Regognition- символдарды оптикалық тану) деп аталады және олар қайтадан жасалған шрифттерге сүйенеді. Қазіргі заманғы бағдарламалар әр түрлі шрифттерді тануға және басқа бірде бір универсалды бағдарламалар көрсете алмайтын үздік нәтижелер көрсетуге мүмкіндік бар.  Мәтінді танудың қазіргі заманғы алгоритмдері законерленді шрифтке де алфабитке де бейімделмеген. Көптеген бағдарламалар біренше тілдегі мәтіндерді тани алады. Бір және сол алгоритм ресейлік латын, араб және басқа алфабиттер мен  тіпті аралас мәтіндерді тануға ие. Бізді орыс тілінде жазылған мәтіндерді тани білетін бағдарламалар қызықтырады.Мұндай бағдарламалар отандық өндірушілермен шығарылады. Бізге кеңінен белгілі болғаны Fine Reader және Cunei Form бағдарламалары.
    Fine Reader бағдарламасы танудың жоғарғы сапасы мен қолданумен ыңғайлылығын ұсынады.
    `,
  }, 
  {
    title: 'Мәтіндік құжаттарды тану реттілігіне талдау жасаңыз',
    answer: `Қағаз құжаттарды электронға ауыстыру үш кезеңнен тұрады. Бұл кезеңдердің әрқайсысын Fine Reader бағдарламасында автоматты түрде және қоданушының бақылаушымен де іске асырылады.
    Жұмыстың бірінші кезеңі сканерлеу . Екінші кезеңі- мәтінді сегметтеу. Кітаптар немесе журналдардың беттері белгіленген реттілікке болмауы мүмкін.  Ол бірнеше болғанда орналасуы мүмкін . Суреттер мен кестелер де мәтіннің дұрыс танылуын  шатастыруы мүмкін. Сондықтан, жұмыс барысында құжаттың мәтінін бірнеше блоктарға фрагметтерге бөледі. Блоктар өз реттілігімен танылады. Алынған мәтін құжатқа блок еолерінің ретімен кірістіріледі. 
    Бағдарлама жұмысының соңғы кезеңі – тану. Бұл кезең қолданушының араласуын қажет етпейді , тек тану «оқыту» мақсатында пайдаланылса ғана қолданушы қатысуымен жасалады.
    Мәтінді тану бөлек терезеде мәтіннің форматталған түрінде көрсетіледі. Ол бастапқы суретпен байланысын үзеді және өз бетінше редактирлене және форматтала алады. Ол тани алмайтын сөздерді арнайы түспен  белгілейді. 
    Алынған мәтінді форматталған құжат түрінде сақтауға  болады. Одан басқа алынған бағдарламаны Word немесе  Exsel бағдарламасында , сонымен қатар Windows-тың алмастыру буферінде сақтау қарастырылған.
    `,
  },
  {
    title: 'Құжаттарды сканерлеу ұғымына түсінік беріңіз',
    answer: `Сканерлеу-бұл техникалық операция  Fine Reader  бағдарламасының жұмысы алынғана ақпаратты қабылдау және Пакет панелі үшін беттерді сканерлеу нәтижесінде белгілерді қабылдау болып табылады. Осылайша беттер танылуға дайындалады.
    Fine Reader  бағдарламасымен сканерлеу үшін бағдарламаны іске қосып сканерді де  қосу керек.
    Қағаз құжаттарды  электронды  формаға  ауыстырудың  негізгі әдісі  - сканерлеу болып  табылады.
    Сканерлеу - бұл техникалық процесс, оның нәтжесінде қағаз құжаттарының графикалық суреті  құрылады. Сканерлердің көптеген  түрлері бар,барлығының принципі бірдей. Құжаттарды арнайы ток көзінің нәтижесінде жарықпен жарықтандырады,ал  суреттер  шағылыстыратын элементпен қабылданады. Суреттің минималды элементі  түсті нүкте тәрізді сканермен беріледі. Осылайша, құжатты  сканерлеу нәтижесінде  бастапқы  құжаттың  растровты  түрі сақталынатын графикалық файл құрылады. Растровты түр нүктелерден жинақталады.Нүктелердің саны суреттің өлшемімен  және сканердің өлшемімен анықталады.
    Құжатты сканермен  өңдегеннен соң   құжаттың графикалық көрінісі  шығады. Бірақ графикалық  көрініс  құжаттың  мәтіні  болып  табылмайды.  Адамға  қағаз бетінде қанша және  не  жазылғанын түсіну  үшін қағазға  бір  қарау  жеткілікті. 
    Компьютер  тілімен айтқанда,сканерлеудің нәтижелері мәтіндік құжатқа емес  түрлі түсті нүктелерге айналады. Мәтінді  нүктелік графикалық  сурет құрамында анықтау проблемасы өте күрделі жұмыс болып табылады. Осындай жұмыстар арнайы бағдарламалық құралдардың көмегімен  шешіледі. Осы  саладағы  нағыз техникалық  жаңалықтар соңғы жылдарда  орын алды.«Ұқсастық»  өлшемі  бағдарламасының авторлары  символдардың сәйкестендірілуін қолданады. Осындай жүйелер Ocr (Optikalcharacted Recognition - оптическое распознавание символов) деп аталады және   жаңадан тағдалған шрифтерге  сүйенеді. Заманауи  бағдарламалар түзетусіз әртүрлі шрифтермен  жұмыс істей алады
    `,
  },
  {
    title: 'Құжаттарды сканерлеуге арналған бағдарламаларға сипаттама беріңіз',
    answer: `Сканерлеу - бұл техникалық процесс, оның нәтжесінде қағаз құжаттарының графикалық суреті  құрылады. Сканерлердің көптеген  түрлері бар,барлығының принципі бірдей. Құжаттарды арнайы ток көзінің нәтижесінде жарықпен жарықтандырады,ал  суреттер  шағылыстыратын элементпен қабылданады. Суреттің минималды элементі  түсті нүкте тәрізді сканермен беріледі. Осылайша, құжатты  сканерлеу нәтижесінде  бастапқы  құжаттың  растровты  түрі сақталынатын графикалық файл құрылады. Растровты түр нүктелерден жинақталады.Нүктелердің саны суреттің өлшемімен  және сканердің өлшемімен анықталады.
    Сканерлеу-бұл техникалық операция  Fine Reader  бағдарламасының жұмысы алынғана ақпаратты қабылдау және Пакет панелі үшін беттерді сканерлеу нәтижесінде белгілерді қабылдау болып табылады. Осылайша беттер танылуға дайындалады.
    Fine Reader  бағдарламасымен сканерлеу үшін бағдарламаны іске қосып сканерді де  қосу керек.
    Fine Reader бағдарламасы отындық АВВУУ Softwar компаниясымен шығарылады. Fine Reader алғаш сериясы 1993жылы шығарылған. Бұл бағдарлама орыс, ағылшын, неміс, украйна, француз және де басқа тілдердегі мәтіндерді танып білуге арналған. Бағдарламаның бірқатар ыңғайлы мүмкіндіктері бар. Ол бір операцияға сканерлеу және танып білуді біріктіруге , құжаттар тізімін және бланктермен жұмыс істеуге мүмкіндік береді. Бағдарламаларды сәтсіз терілген мәтіндер немесе қиын шрифттердің сапасын жоғарлату мақсаттары да танып білу үшін қолдануға болады. Ол мәтіндерді редактрлеуге және оның орфаграфиясын тексеруге мүмкіндік береді. 
    Fine Reader сканерлеудің әр түрлі үлгілерімен жұмыс істейді. Жекелей алғанда TWAIN стандартын ұстайды. 
    Fine Reader бағдарламасын орнатқан соң бағдарламалар менюінде онымен жұмыс  жасауды қамтамасыз ететін пункттер пайда  болады. Бағдарламаның терезесі Windows бағдарламалары үшін тән болып келеді және меню қатары мен жұмыс аймағы болады.
    `,
  },
  {
    title: 'Құжаттың сегментациясы және автоматты сегментация ұғымдарына анықтама беріңіз',
    answer: `Құжаттың сегментациясы
    Мәтінді тану деп бетті солдан оңға тануды тусінеміз. Егер мәтін бағаналарға бөлінсе немесе бөлікшелер қосымша екінші элеметтері болса , оны реттілікпен тану мүмкін  емес. Мұндай жағдайда мәтінді блокка бөліп , реттілікпен танылуға жағдай жасайды. Құжатты бұлай бөлуді сегментация дейміз.
    Автоматты сегментация
     Автоматты сегментация- бұл бағдарлама үшін оңай тәсіл. Бағдарлама ленталар арасындағы аралықты іздейді, сонымен қатар лентаның бастапқы және соңғы зоналар іздейді. Егер ленталардың реттілігі қатар  бойынша , басы мен соңы бірегей зоналардан тұрса, онда тізім мәтіндік блок ретінде қаралады. Егер көптеген  вертикальді және горизантальді фрагменттер анықталса , онда мәтін кестеге кірістірілуі мүмкін деген сөз.
    Құжатты тану
    Сегментация және мәтіндік блоктардың реттілігі орнаған соң жұмыстың қортынды кезеңіне көшеді- тану . Егер мәтін стандартты шрифтпен терілсе және  жақсы сканерленген болса тану батырмасын шерту керек, сосын мәтін тану кезеңінен өтеді. Егер мәтін стандартты емес шрифттен тұрса , онда тану қиынға түседі. Мұндай жағдайда символдарды тану іске аспайды және біртипті қателерге алып келеді . Осындайдайда ауқымды құжаттар үшін , жұмыс кезінде бағдарламаны оқытуды жүргізсек жөн.
    `,
  },
  {
    title: 'Ocr (optical character recognition) – символдарды оптикалық анықтау бағдарламаларына сипаттама беріңіз',
    answer: `Таңбаларды оптикалық тану (ағылш. Optical Character Recognition-OCR)-Сканерленген Құжаттар, PDF файлдары немесе фотосуреттер сияқты әртүрлі құжаттарды сандық камерадан іздеу мүмкіндігі бар өңделетін форматтарға түрлендіруге мүмкіндік беретін технология.
    Сізде қағаз құжаты бар делік, мысалы, журналдағы мақала, брошюра немесе серіктес сізге электрондық пошта арқылы жіберген PDF келісімшарты. Құжатты өңдеу мүмкіндігіне ие болу үшін оны жай сканерлеу жеткіліксіз екені анық. Сканер жасай алатын жалғыз нәрсе-құжаттың кескінін жасау, ол тек қара-ақ немесе түрлі-түсті нүктелердің жиынтығы, яғни нүктелік кескін.
    Деректерді көшіру, шығару және өңдеу үшін сізге символдарды тану бағдарламасы қажет болады, ол суреттегі әріптерді таңдап, оларды сөзбен құрастырып, содан кейін сөздерді сөйлемдерге біріктіре алады, бұл сізге бастапқы құжаттың мазмұнымен жұмыс істеуге мүмкіндік береді.
    ABBYY FineReader OCR технологиясын қолдану оңай-тану процесі үш кезеңнен тұрады: құжатты ашу (немесе сканерлеу), тану және ең қолайлы форматта сақтау (DOC, RTF, XLS, PDF, HTML, TXT және т.б.) немесе Microsoft Word, Excel немесе PDF қарау бағдарламалары сияқты кеңсе бағдарламаларына деректерді тікелей беру.
    `,
  },
  {
    title: 'Abbyy finereader 11-нұсқасының мүмкіндіктеріне сипаттама беріңіз',
    answer: `ABBYY FineReader 11-де құжаттарды өңдеу жылдамдығы 45% артты. Толық түсті режимдегі суреттерді өңдеуге қарағанда жаңа түссіз режим іскер құжаттар мен кітаптарды өңдеу үшін электрондық құжатты 30%-ке дейін жылдам алуға мүмкіндік береді. Сондай-ақ, жаңа нұсқада айырып танылатын тілдердің тізімі кеңейтіліп, арап тілін сүймелдеуі қосылған, ұялы телефон мен сандық фотоаппаратпен түсірілген құжаттарды айырып танудың сапасы көтерілген,  
    Енді ABBYY FineReader 11-дің қолданушылары портативті құрылғыларда оқуға арналған электрондық кітаптарды жылдам жасап, оларды электронық кітапханалар мен архивтерге қоса алады. Бағдарлама ePub, fb2 және т.б. белгілі форматтарда сақтайды. Бағдарламаның бірлескен нұсақасына құпия ақпаратты жою мен ABBYY Business Card Reader визит карточкасын айырып тану мүмкіндігі қосылған.  
    ABBYY FineReader 11 екінұсқадашығарылған: Professional Edition и Corporate Edition. Кәсібинұсқақорапжәнежүктеунұсқасытүріндешығарылады. Корпоративтікнұсқалицензияжәнежүктеунұсқасытүріндешығады. Арабтілінқолдайтын ABBYY FineReader 11 Corporate Edition жекежеткізіледі.  Мәскеу қаласында ABBYY компаниясының штаб-пәтерімен  екі сатукеңсесі орналасқан, компанияныңбасқаөкілдіктері  Австралияда, Ұлыбританияда, Германияда, Кипрда, АҚШ-да, Тайванда, УкраинаменЖапониядаорналасқан. Компанияның 12 халықаралықкеңселерінде 1000-нанастамадамқызметжасайды. ABBYY шешімдері мен өнімдерін компанияның әріптестері мен өкілдерінің арқасында әлемнің 130 елінде қолданушылар пайдаланаалады.
    `,
  },
  {
    title: 'Fine reader-дің соңғы версияларының ерекшеліктерін сипаттаыңыз',
    answer: `Ищи: Abbyy finereader 11-нұсқасының мүмкіндіктеріне сипаттама беріңіз`,
  },
  {
    title: 'Fine reader бағдарламасына жалпы сипаттама беріңіз',
    answer: `Ищи: Fine reader бағдарламасының ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Fine reader бағдарламасымен жұмыс істеу ерекшеліктерін түсіндіріңіз',
    answer: `Ищи: Fine reader бағдарламасының ерекшеліктерін сипаттаңыз`,
  },
  {
    title: 'Сканерлеу және ол үшін fine reader-ді қолдану ерекшеліктерін түсіндіріңіз',
    answer: `Ищи: Fine reader бағдарламасының ерекшеліктерін сипаттаңыз
    Сканерлеу және оны жүзеге асыратын құрылғыларға сипаттама беріңіз`,
  },
];
