module.exports = [
  {
    "title": "Концепция вычислительной сети физических предметов оснащённых  \nвстроенными технологиями для взаимодействия друг с другом или с внешней средой",
    "answer": "Интернет вещей (internet of Things)"
  },
  {
    "title": "Эргономика это",
    "answer": "научная дисциплина, которая изучает сложные функциональные возможности человека в трудных и бытовых процессах"
  },
  {
    "title": "Сердце (и мозг) компьютера",
    "answer": "CPU(процессор)"
  },
  {
    "title": "Государственная программа Casino в рамках которой осуществляется сбор проектов по направлениям",
    "answer": "Возобновляемые источники энергии"
  },
  {
    "title": "ISO обозначает",
    "answer": "Международные организации для стандартизации"
  },
  {
    "title": "Отдельная пользовательская компьютерная система, подобная персональному компьютеру, но имеющая более мощные микропроцессоры",
    "answer": "Супер компьютер"
  },
  {
    "title": "Перевести десятичное число 38 в двоичную систему счисления",
    "answer": "100110"
  },
  {
    "title": "Надежность функционирования комплекса программ и возможный риск от его применения для людей, бизнеса и внешней среды",
    "answer": "Безопасность"
  },
  {
    "title": "Потребительский показатель качества информации, обеспечивающийся выполнением соответствующих процедур ее получения и преобразования",
    "answer": "Доступность"
  },
  {
    "title": "Компьютеры, выполняющие преобразование доменного имени в числовой IP-адрес",
    "answer": "DNS-сервера"
  },
  {
    "title": "Базы данных. Поле",
    "answer": "Указатель на связанную таблицу"
  },
  {
    "title": "Число 1DE шестнадцатеричной системы счисления в десятичной системе счисления имеет вид",
    "answer": "478"
  },
  {
    "title": "Компьютер, управляющий сетью и дающий доступ сетевым пользование к своим ресурсам.",
    "answer": "Сервер"
  },
  {
    "title": "Видео состоят из последовательности.",
    "answer": "Фреймов"
  },
  {
    "title": "Однопользовательская однозначная компьютерная операционная система, которая использует интерфейс командной строки.",
    "answer": "MS-DOS"
  },
  {
    "title": "Стандартный язык запросов для работы с реляционными базами данных.",
    "answer": "SQL"
  },
  {
    "title": "Информация, обработанная и завершенная на информационном носителе это.",
    "answer": "данные"
  },
  {
    "title": "Устройство которое позволяет компьютерам обмениваться данными по телефонной линии.",
    "answer": "Модем"
  },
  {
    "title": "Что отражает и реализует концепцию, определяющую модель, структуру, выполняемые функции и взаимосвязь всех компонентов информационных систем (И-.",
    "answer": "Архитектура информационной системы"
  },
  {
    "title": "Мобильная операционная система, разработанная Google, основанная на ядре Linux и предназначенная для сенсорных мобильных устройств таких как смартфоны и планшеты",
    "answer": "Android"
  },
  {
    "title": "Число 101 двоичной системы счислении в десятичной системе счисления имеет вид.",
    "answer": "5"
  },
  {
    "title": "Число D в шестнадцатеричной системе счисления соответствует в десятичной системе счисления числу.",
    "answer": "13"
  },
  {
    "title": "Набор программ, предназначенных для решения конкретного класса задач ( функциональная подсистема. Бизнес приложени-",
    "answer": "Пакет прикладных программ"
  },
  {
    "title": "Интернет это?",
    "answer": "Крупнейшая в мире коммуникационная сеть компьютеров"
  },
  {
    "title": "Роботизация-это",
    "answer": "автоматизация производства с использованием промышленных роботов"
  },
  {
    "title": "Программное обеспечение или сценарий, доступный через интернет для поиска документов и файлов, по ключевым словам, и результатом любых файл содержащих эти ключевые слова",
    "answer": "Поисковая система"
  },
  {
    "title": "Наука о методах и процессах сбора, хранения, передачи, анализа и оценки информации с применением компьютерных технологий",
    "answer": "информатика"
  },
  {
    "title": "Число А шестнадцатеричной системе счисления соответствует в десятичной системе счисления числу",
    "answer": "10"
  },
  {
    "title": "Форма деловых сделок, при которой взаимодействие сторон осуществляется с помощью компьютерных сетей, обмена электронными документами",
    "answer": "Электронный бизнес"
  },
  {
    "title": "Создание движения изображения с помощью компьютера",
    "answer": "компьютерная анимация"
  },
  {
    "title": "Перевести двоичное число 110111 в 16–ную систему счисления",
    "answer": "37"
  },
  {
    "title": "MSExcel знак операции возведении  в степень",
    "answer": "^"
  },
  {
    "title": "Модель продаж товаров и услуг  одного потребителя другим",
    "answer": "C2C"
  },
  {
    "title": "Схема именованные однородного  локатора ресурсов, предоставляющая пользователям  способ получить доступ к Веб-ресурсам используемый однородное обозначения  при обращении к  Веб-ресурсам",
    "answer": "URL"
  },
  {
    "title": "Масштабный государственный проект, включенный в Государственную программу развития образования Республики Казахстан на 2011-2021 годы.",
    "answer": "Развитие информатизаций образования"
  },
  {
    "title": "Особенности HDD.",
    "answer": "120Gb"
  },
  {
    "title": "Научное направление, в рамках которого ставятся и решаются задачи аппаратного или программного моделирования тех видов человеческой деятельности, которые традиционно считаются интеллектуальными.",
    "answer": "Искусственный интеллект"
  },
  {
    "title": "Домены, принадлежащие муниципальным или коммерческим организациям.",
    "answer": "Домены первого уровня"
  },
  {
    "title": "Схема, предоставляющая пользователям способ получить доступ к Веб-ресурсам, используемый Однородные обозначения при обращений к веб-ресурсам.",
    "answer": "URL"
  },
  {
    "title": "Сообщество представителей. Предоставляющее управление пользователям сети Интернет",
    "answer": "ISOC (internetSociety)"
  },
  {
    "title": "Мультимедиа это",
    "answer": "область, связанная с производством анимационных фильмов и обработки видео файлов"
  },
  {
    "title": "Число 10101010 двоичной системы в шестнадцатеричной  системе счисления имеет вид",
    "answer": "АА"
  },
  {
    "title": "MSExcel  смысл ошибки #значение!",
    "answer": "формула использует неправильный тип операнда или аргумента"
  },
  {
    "title": "Понятие «частное облако»",
    "answer": "безопасная ИТ-инфраструктура, контролируемая и эксплуатируемая в интересах  одной-единственной организации"
  },
  {
    "title": "Наука о приспособлении рабочих мест, предметов и объектов труда, а также компьютерных программ для наиболее безопасного и эффективного труда",
    "answer": "Эргономика"
  },
  {
    "title": "Анализ накопления информации, которая выполняется быстро или через определенные промежутки и позволяет гарантировать пользователю, изменять последовательность событий",
    "answer": "аудит"
  },
  {
    "title": "Обработка данных, предшествующая классификации, позволяющая создавать новые группы и классы",
    "answer": "Кластеризация"
  },
  {
    "title": "Коллекция программ той или иной системы программирования",
    "answer": "Библиотека программ"
  },
  {
    "title": "Формат звукового файла инструментального звучания: пианино, гитара, дудочка, орган, контрабас и т.д., занимающий мало места на диске",
    "answer": "MP3"
  },
  {
    "title": "Вид соединения между таблицами непредусмотреное в  MicrosoftAccess?",
    "answer": "альфа-соединение"
  },
  {
    "title": "Укажите какую функцию может исполнять рабочая станция в составе компьютерной сети",
    "answer": "Клиент или сервер"
  },
  {
    "title": "Как называется топология, еcли кoмпьютepы пoдключeны вдoль oднoгo кaбeля [ceгмeнтa (segment)]?",
    "answer": "Шинoй"
  },
  {
    "title": "Процессор обрабатывает информацию…",
    "answer": "в двоичном коде"
  },
  {
    "title": "Класс программ, не относящихся к антивирусным:",
    "answer": "программы сканирования"
  },
  {
    "title": "Для создания шаблона бланка со сложным форматированием необходимо вставить в документ:",
    "answer": "таблицу"
  },
  {
    "title": "Множество данных определенной структуры, с которыми могут работать одна или несколько прикладных программ– это:",
    "answer": "база данных"
  },
  {
    "title": "Поле которое однозначно идентифицирует каждый объект в таблице, т.е. позволяет четко отличить один объект от другого– это:",
    "answer": "ключевое поле"
  },
  {
    "title": "Как называется компьютер в составе сети ,который стоит на информационном обслуживании со стороны другого компьютера сети?",
    "answer": "Клиент"
  },
  {
    "title": "К устройствам накопления информации относится:",
    "answer": "ВЗУ"
  },
  {
    "title": "В каком файле может хранится рисунок?",
    "answer": "CREML.BMP"
  },
  {
    "title": "Электронная таблица —это:",
    "answer": "компьютерный эквивалент обычной таблицы"
  },
  {
    "title": "Основным элементом электронных таблиц является:",
    "answer": "ячейка"
  },
  {
    "title": "Основную структуру текстового документа определяет:",
    "answer": "шаблон"
  },
  {
    "title": "Укажите правильное определение URL",
    "answer": "указатель символьного вида для доступа на Web- сайт Интернет."
  },
  {
    "title": "Какие существуют методы реализации антивирусной защиты?",
    "answer": "Программные, аппаратные, организационные"
  },
  {
    "title": "Укажите какие программы из нижеперечисленных относятся к антивирусным",
    "answer": "AVP, DrWeb, Avast"
  },
  {
    "title": "Компьютер, подключенный к Интернет, обязательно имеет...",
    "answer": "IP-адрес"
  },
  {
    "title": "Какой протокол используется для передачи в сети web-страниц \nиспользуется протокол...",
    "answer": "http"
  },
  {
    "title": "Слово\"модулятор\"означает…",
    "answer": "модернизация сигнала"
  },
  {
    "title": "Слово \"демодулятор\" означает…",
    "answer": "де модернизация сигнала"
  },
  {
    "title": "Что такое провайдер?",
    "answer": "организация (юридическое лицо, обеспечивающая работу в сети Интернет)"
  },
  {
    "title": "Что такое FTP?",
    "answer": "протокол передачи файлов"
  },
  {
    "title": "Как называется мощный Компьютер в вычислительных сетях, который поддерживает структуру сети и на которой инсталлированы основные программные продукты:",
    "answer": "Сервер"
  },
  {
    "title": "Язык разметки гипертекста-это:",
    "answer": "HTML"
  },
  {
    "title": "Электронная почта передает адресату через компьютерные сети письма в коде?",
    "answer": "Двоичном"
  },
  {
    "title": "К электронной коммерции относят:",
    "answer": "Электронное движение капитала"
  },
  {
    "title": "При помощи какого языка создаются Web-страницы?",
    "answer": "HTML"
  },
  {
    "title": "Назовите функции ОЗУ",
    "answer": "накопление и хранение данных оперативного доступа"
  },
  {
    "title": "Что такое серверы?",
    "answer": "Это кoмпьютepы пpeдocтaвляющиe cвoи pecypcы ceтeвым пoльзoвaтeлям"
  },
  {
    "title": "Укажите основные типы компьютерных вирусов",
    "answer": "Программные, загрузочные, макровирусы"
  },
  {
    "title": "Укажите формат представления информации в Web-странице",
    "answer": "Формат HTML"
  },
  {
    "title": "Локальная вычислительная сеть –это",
    "answer": "Компьютерная сеть, размещенная в пределах одного помещения или здания"
  },
  {
    "title": "Компьютерная сеть это:",
    "answer": "два и более компьютеров, объединенных средствами информационных коммуникаций"
  },
  {
    "title": "Жизненный цикл БД содержит две фазы:",
    "answer": "Проектирования, реализация"
  },
  {
    "title": "Как называется указание адреса ячейки в Microsoft Excel?",
    "answer": "ссылка"
  },
  {
    "title": "Какой формат используется в Microsoft Excel по умолчанию, обеспечивая запись числовых данных в ячейках в том же виде, как они вводятся или вычисляются:",
    "answer": "основной"
  },
  {
    "title": "Web сайт – это:",
    "answer": "набор связанных друг с другом документов, для связи таких документов используются гиперссылки"
  },
  {
    "title": "PersonalWebServer–это:",
    "answer": "программа, с помощью которой мы можем регулировать работу Web-сервиса."
  },
  {
    "title": "Укажите базовый протокол в Интернет.",
    "answer": "TCP/IP"
  },
  {
    "title": "Гиперссылки на web – странице могут обеспечить переход...",
    "answer": "на любую web - страницу любого сервера Интернет"
  },
  {
    "title": "Что такое домен ?",
    "answer": "часть адреса, определяющая адрес компьютера пользователя в сети"
  },
  {
    "title": "URL адрес – это …..",
    "answer": "адрес, на котором расположен ресурс;"
  },
  {
    "title": "Точка экранного изображения называется",
    "answer": "пикселом"
  },
  {
    "title": "Укажите главный недостаток локальных сетей?",
    "answer": "необходимость дополнительных затрат на оборудование и обслуживание сети"
  },
  {
    "title": "Toпoлoгия ceти xapaктepизyeт",
    "answer": "физичecкoe pacпoлoжeниe кoмпьютepoв, кaбeлeй и дpyгиx кoмпoнeнтoв ceти"
  },
  {
    "title": "Укажите какие программы из ниже перечисленных относятся к антивирусным",
    "answer": "AVP, DrWeb, Avast"
  },
  {
    "title": "Информацию, не зависящую от личного мнения или суждения, называют:",
    "answer": "объективной"
  },
  {
    "title": "В кодировке Unicode на каждый символ отводится два байта. Определите информационный объем слова из двадцати шести символов в этой кодировке.",
    "answer": "416 бит"
  },
  {
    "title": "Что такое ярлык?",
    "answer": "указатель на объект"
  },
  {
    "title": "Алгоритм, в котором выполнение действия зависит от поставленного условия, называется",
    "answer": "Алгоритмом ветвления"
  },
  {
    "title": "Из скольких этапов состоит разработка моделей в среде электронных таблиц",
    "answer": "4"
  },
  {
    "title": "В электронной таблице выделен диапазон ячеек A1:C4. Сколько ячеек содержит данный диапазон?",
    "answer": "12"
  },
  {
    "title": "Укажите абсолютную ссылку",
    "answer": "A4"
  },
  {
    "title": "Информационно-поисковые системы делятся на:",
    "answer": "Поисковые, информационные"
  },
  {
    "title": "Объектно-ориентированное программирование – это…",
    "answer": "Метод программирования, при использовании которого главными элементами программ являются объекты"
  },
  {
    "title": "Что такое модификаторы?",
    "answer": "Инструменты для измерения изображения"
  },
  {
    "title": "Укажите материал, который используется для создания сеточного каркаса модели.",
    "answer": "Wire"
  },
  {
    "title": "Что не относится к методам поиска?",
    "answer": "Программный поиск"
  },
  {
    "title": "Из какого места на компьютере производится установка и удаление программ?",
    "answer": "Панель управления"
  },
  {
    "title": "Определите значение переменной x после выполнения следующего фрагмента программы: a:=7;b:=22; a:=b-a*3; ifa>bthenx:=a+belsex:=b-a",
    "answer": "21"
  },
  {
    "title": "Какой формат в Microsoft Excel обеспечивает представление чисел в ячейка с заданной точностью, определяемой пользователем десятичной точки:",
    "answer": "с фиксированным количеством десятичных знаков"
  },
  {
    "title": "Какой формат в Microsoft Excel обеспечивает представление введенных данных в формате процентов в соответствии с установленным количеством десятичных знаков:",
    "answer": "процентный"
  },
  {
    "title": "администрирование работы разработчиков приложений, пользователей, объединенных в одну функциональную систему ... назовем",
    "answer": "администраторы"
  },
  {
    "title": "дайте определение реляционной модели данных.",
    "answer": "объект модели-совокупность взаимосвязанных двумерных таблиц"
  },
  {
    "title": "структурирование данных-это",
    "answer": "внесение соглашений о предоставлении данных"
  },
  {
    "title": "БД, установленные на одном физическом месте ... называется.",
    "answer": "централизованная БД"
  },
  {
    "title": "что такое первичный ключ?",
    "answer": "один или несколько ребер, которые фиксируют запись единым"
  },
  {
    "title": "Что такое потенциальный ключ?",
    "answer": "поле таблицы, которое идентифицирует записи в файле"
  },
  {
    "title": "как вы понимаете, что такое избыточность?",
    "answer": "дублирование данных в базе данных"
  },
  {
    "title": "как вы понимаете целостность данных?",
    "answer": "согласованность данных БД"
  },
  {
    "title": "в чем важность целостности и необходимости обеспечения БД?",
    "answer": "обеспечение непротиворечивости данных"
  },
  {
    "title": "DML -",
    "answer": "язык управления данными в базе данных"
  },
  {
    "title": "какой из языков предлагает структурированное Программирование спроса?",
    "answer": "SQL"
  },
  {
    "title": "какое максимальное значение может принимать тип данных CHAR?",
    "answer": "255 символов"
  },
  {
    "title": "как вы понимаете процесс фильтрации?",
    "answer": "отображение информации, удовлетворяющей поставленным условиям"
  },
  {
    "title": "Администратор -",
    "answer": "лицо, ответственное за сохранность, целостность и безопасность базы данных"
  },
  {
    "title": "определение возможной ситуации в будущем",
    "answer": "прогнозирование"
  },
  {
    "title": "прогноз, при котором срок рассмотрения данных не превышает одного года, называется:",
    "answer": "краткосрочное прогнозирование"
  },
  {
    "title": "Файл-это логический файл, содержащий ...",
    "answer": "особый"
  },
  {
    "title": "поиск скрытых засечек данных (шаблонов информации):",
    "answer": "Data Mining"
  },
  {
    "title": "прогнозирование осуществляется в течение 5 лет, если",
    "answer": "долгосрочное"
  },
  {
    "title": "анализ прогнозируемых событий",
    "answer": "качественные"
  },
  {
    "title": "организация развития объекта:",
    "answer": "искатель"
  },
  {
    "title": "отображение данных:",
    "answer": "график"
  },
  {
    "title": "прогнозирование:",
    "answer": "фактографические, экспертные"
  },
  {
    "title": "диаграмма, изображающая столбцы:",
    "answer": "гистограмма"
  },
  {
    "title": "Технология Data Mining является одним из основателей данного направления:",
    "answer": "Григорий Пиатецкий-Шапиро"
  },
  {
    "title": "график представления данных:",
    "answer": "точность, точность"
  },
  {
    "title": "статистические данные:",
    "answer": "экстраполяция и регрессия"
  },
  {
    "title": "основные факторы, характеризующие экономические явления:",
    "answer": "динамический"
  },
  {
    "title": "отображение изображений информации, графиков, схем, таблиц, схем, диаграмм:",
    "answer": "визуализация данных"
  },
  {
    "title": "искусственные нейронные сети, решетники, символические сети, ближайшие проводники. Б.:",
    "answer": "алгоритмы Data Mining"
  },
  {
    "title": "Что такое Модель:",
    "answer": "информационное поле конкретного объекта"
  },
  {
    "title": "С какой таблицей создаем Частотность",
    "answer": "StatPlus"
  },
  {
    "title": "порядок анализа данных:",
    "answer": "средний, медиана"
  },
  {
    "title": "способ существования данных:",
    "answer": "анализ"
  },
  {
    "title": "Создание тенденций явление:",
    "answer": "тренд"
  },
  {
    "title": "как называется фоновое отображение образа?",
    "answer": "вackground"
  },
  {
    "title": "измерение информации:",
    "answer": "байт"
  },
  {
    "title": "Некоторый показатель, который получает числовое или текстовое значение, характеризующее объект",
    "answer": "сведения"
  },
  {
    "title": "Новая информация, оцененная и принятая как полезная для потребителей",
    "answer": "информация"
  },
  {
    "title": "какой тип кабеля используется в корпоративных сетях?",
    "answer": "кабель поворотной пары"
  },
  {
    "title": "какие документы и договоры могут быть заключены в Сети?",
    "answer": "протокол"
  },
  {
    "title": "что такое двух контактный, идентификационный?",
    "answer": "пакет"
  },
  {
    "title": "протокол широкополосного доступа к сети Интернет, построенный из различных ОС и системно архитектурных компьютеров:",
    "answer": "TCP/IP"
  },
  {
    "title": "расшифровка аббревиатуры TCP/IP?",
    "answer": "Эталонная модель взаимодействия систем в Internet."
  },
  {
    "title": "Назовите маршрутизированный протокол, отвечающий за адресацию, маршрутизацию, сегментацию и повторный сбор пакетов:",
    "answer": "IP"
  },
  {
    "title": "динамическая фиксация узлов:",
    "answer": "DHCP"
  },
  {
    "title": "Этот 32-битный адрес используется для идентификации номера узла в сети и задается десятичными значениями:",
    "answer": "IP-адрес"
  },
  {
    "title": "эталонная модель TCP/IP?",
    "answer": "4"
  },
  {
    "title": "Назовите устройство, которое обеспечивает связь и соответствие локальной сети, проверяет соответствие имен пакетов локальной сети и выбирает эффективный путь для пакета:",
    "answer": "маршрутизатор"
  },
  {
    "title": "устройство для подключения компьютера:",
    "answer": "сетевой адаптер"
  },
  {
    "title": "Устройство, позволяющее передавать и принимать компьютерную информацию по телефонному каналу:",
    "answer": "модем"
  },
  {
    "title": "Специальный цифровой канал связи, соединяющий телефонный коммутатор с абонентом:",
    "answer": "DSL"
  },
  {
    "title": ". Основное устройство сети передачи пакетов в фиксированные порты:",
    "answer": "коммутатор"
  },
  {
    "title": "компьютер, обслуживающий системного администратора и интернет-сервис, обрабатывающий запросы клиента:",
    "answer": "веб-сервер"
  },
  {
    "title": "Разность между максимальной и минимальной частотами для фиксированного диапазона в устройстве связи, что . . .",
    "answer": "сверхпроводимость"
  },
  {
    "title": "Как называется логическое соединение, которое создается для обмена данными между двумя узлами?",
    "answer": "сеанс"
  },
  {
    "title": "Как описываются новые угрозы информационной безопасности??",
    "answer": "приставка \" кибер -\""
  },
  {
    "title": "защита от угроз в киберпространстве?",
    "answer": "кибербезопасность"
  },
  {
    "title": "сложная (физическая) среда?",
    "answer": "киберпространство"
  },
  {
    "title": "какие виды информационных технологий используются?",
    "answer": "киберпреступность"
  },
  {
    "title": "Киберпространство с точки зрения новизны не является чьей-то собственностью: каждый участник?",
    "answer": "заинтересованный"
  },
  {
    "title": "Как определить потенциальный потенциал?",
    "answer": "опасность"
  },
  {
    "title": "Попытка реализовать любой риск?",
    "answer": "атака"
  },
  {
    "title": "обеспечение доступа к информации только для эксплуатируемых?",
    "answer": "конфиденциальность"
  },
  {
    "title": "Обеспечение достоверности и полноты информации и методы ее обработки",
    "answer": "целостность"
  },
  {
    "title": "информация, ее обработка, копирование, модификация?",
    "answer": "доступность"
  },
  {
    "title": "степень опасности?",
    "answer": "нарушение конфиденциальности, целостности, доступа"
  },
  {
    "title": "Классификация опасностей по месту происхождения?",
    "answer": "локальный, дистанционный"
  },
  {
    "title": "Классификация рисков по характеру воздействия??",
    "answer": "активный, пассивный"
  },
  {
    "title": "что такое мошенничество?",
    "answer": "кибербезопасность"
  },
  {
    "title": "вирусы, черви, трояны, и другие программы?",
    "answer": "вредоносные программы"
  },
  {
    "title": "функции, регулирующие информационные процессы, обработки и обработки информации?",
    "answer": "законодательные основы"
  },
  {
    "title": "значение информационно-технических и организационно-правовых мероприятий?",
    "answer": "организационные средства"
  },
  {
    "title": "Что такое информационные системы?",
    "answer": "физические свойства"
  },
  {
    "title": "в чем заключается проблема управления информационными ресурсами системы?",
    "answer": "управление доступностью"
  },
  {
    "title": "Как физически заблокировать доступ злоумышленника к информации?",
    "answer": "сопротивление"
  },
  {
    "title": "метод защиты информации путем криптографического изменения?",
    "answer": "маскировка"
  },
  {
    "title": "метод защиты, исключающий возможности неутвержденного доступа?",
    "answer": "установление порядка"
  },
  {
    "title": "как анализируется HTML?",
    "answer": "обозначение гипертекста"
  },
  {
    "title": "надлежащий метод защиты персонала при надлежащем соблюдении правил обработки, передачи и применения информации?",
    "answer": "вынужденное уговаривание"
  },
  {
    "title": "задача стандартов информационной безопасности?",
    "answer": "примирение с трех точек зрения"
  },
  {
    "title": "как происходит краткая запись гипертекстового языка?",
    "answer": "HTML"
  },
  {
    "title": "Подтверждает достоверность документа, его принадлежность и неизменность содержания?",
    "answer": "электронная цифровая подпись"
  },
  {
    "title": "алгоритм шифрования будет доступен посторонним лицам, но ключ неизвестен?",
    "answer": "симметричное шифрование"
  },
  {
    "title": "алгоритм и открытый ключ известны только получателю, но закрытый ключ известен только получателю?",
    "answer": "асимметричное шифрование"
  },
  {
    "title": "с помощью какого языка создаются Web – страницы?",
    "answer": "HTML"
  },
  {
    "title": "зачем нужна кибербезопасность и управление интернетом?",
    "answer": "милитаризация киберпространства"
  },
  {
    "title": "как называется специальный гипертекстовый язык, который передает документ через сеть Internet?",
    "answer": "HTML"
  },
  {
    "title": "для чего используется HTML?",
    "answer": "в создании Web-страниц"
  },
  {
    "title": "специальное оборудование для подключения к Сети Internet:",
    "answer": "модем"
  },
  {
    "title": "какой уровень протокола предусмотрен международным стандартом OSI / ISO?",
    "answer": "7"
  },
  {
    "title": "как определить язык HTML?",
    "answer": "внешней структурой документа"
  },
  {
    "title": "маршрутизаторы – это…",
    "answer": "соединяет между собой части сети или различные сети"
  },
  {
    "title": "\"электронная почта\" - это…",
    "answer": "обмен текстовыми сообщениями между людьми"
  },
  {
    "title": "из чего состоит абонентская станция?",
    "answer": "персональный компьютер и модем"
  },
  {
    "title": "как называется 4-байтовая цепь, каждый байт которой записывается в виде десятичного числа?",
    "answer": "IP-адрес"
  },
  {
    "title": "специфика гипертекста-",
    "answer": "можно ссылаться на другую Web страницу или документы"
  },
  {
    "title": "как называется серверная программа, обеспечивающая поиск доменных имен IP-адресов узлов сети, находящихся в ведении ответственного сервера?",
    "answer": "DNS (Domain Name System)"
  },
  {
    "title": "текст со ссылкой на Web страницу или документы?",
    "answer": "гипертекст"
  },
  {
    "title": "программа, используемая для проверки соединения IP-адресов и машин:",
    "answer": "программа Ping"
  },
  {
    "title": "связь между клиентом-сервером при работе по протоколу WWW:",
    "answer": "Hypertext Transport Protocol (HTTP)"
  },
  {
    "title": "в каком году появилась World Wide Web?",
    "answer": "в октябре 1994 года"
  },
  {
    "title": "адрес электронной почты состоит из:",
    "answer": "идентификатор, символ @ и доменное имя сервера"
  },
  {
    "title": "цель изобретения WWW?",
    "answer": "с целью обработки стандартов HTML и WWW"
  },
  {
    "title": "имя главного элемента кодирования, принимаемого в HTML?",
    "answer": "дескриптор"
  },
  {
    "title": "что мы подразумеваем под дескриптором?",
    "answer": "основной элемент кодирования, принимаемый в HTML"
  },
  {
    "title": "отличительные признаки дескриптора?",
    "answer": "<>"
  },
  {
    "title": "Баннер (баннер) - это…",
    "answer": "не большое прямоугольное изображение, рекламирующее что-либо"
  },
  {
    "title": "< >на каком объекте применяются знаки?",
    "answer": "дескриптор"
  },
  {
    "title": "буквы, с помощью которых можно писать дескрипторы?",
    "answer": "заглавными и строчными буквами"
  },
  {
    "title": "гиперссылка-это…",
    "answer": "выделенное определенным цветом слово, которое помещается в любом Web-документе"
  },
  {
    "title": "сервер новостей–это…",
    "answer": "через компьютер, подключенный к Internet, пользователь получает пакет новостей"
  },
  {
    "title": "для чего используется программа Ping?",
    "answer": "для выполнения IP-адресов и машин"
  },
  {
    "title": "Всемирный узел  WWW – это…",
    "answer": "распределенная мультимедийная информационная система, основанная на гипертексте"
  },
  {
    "title": "URL (Uniform Resource Locator) - это…",
    "answer": "указать протокол, адрес сервера и имена файлов с необходимым документом"
  },
  {
    "title": "как называется компьютер, подключенный к сети Интернет?",
    "answer": "рабочая станция"
  },
  {
    "title": "как называется компьютер, подключенный к интернету самостоятельно?",
    "answer": "хост-компьютер"
  },
  {
    "title": "дайте определение понятию Контейнер?",
    "answer": "дескрипторное обозначение, состоящее из начального и конечного дескриптора"
  },
  {
    "title": "как называется дескрипторное обозначение, состоящее из начального и конечного дескриптора?",
    "answer": "контейнер"
  },
  {
    "title": "местонахождение содержимого контейнера?",
    "answer": "в начальном и конечном дескрипторах"
  },
  {
    "title": "какой дескриптор может самостоятельно вынести решение по установленному тексту?",
    "answer": "пустой"
  },
  {
    "title": "как называется дескриптор исходного и конечного контейнера и содержимое между ними?",
    "answer": "HTML-документ"
  },
  {
    "title": "название элемента HEAD?",
    "answer": "»Начало\""
  },
  {
    "title": "какой элемент определяет значение «начало» в HTML – документе?",
    "answer": "элемент HEAD"
  },
  {
    "title": "что определяет элемент TITLE?",
    "answer": "заголовок документа"
  },
  {
    "title": "элемент, определяющий предмет документа?",
    "answer": "TITLE"
  },
  {
    "title": "элемент, связанный с элементом BODY?",
    "answer": "текст, видео или изображение и мультимедиа, изображенные на всей странице"
  },
  {
    "title": "к какому элементу добавлены текст, видео и мультимедиа, полностью изображенные на странице?",
    "answer": "BODY"
  },
  {
    "title": "с помощью какого элемента можно обеспечить четкую передачу данных?",
    "answer": "с помощью списков"
  },
  {
    "title": "с помощью какого контейнера формируются пронумерованные списки?",
    "answer": "< OL>и< / OL>"
  },
  {
    "title": "какие списки создаются с помощью контейнера <OL> и </OL>?",
    "answer": "пронумерованные"
  },
  {
    "title": "дескриптор, с помощью которого можно определить элемент внутри контейнера <OL> и </OL>?",
    "answer": "<LI>"
  },
  {
    "title": "определение стиля формирования списка?",
    "answer": "<OL TYPE=type>"
  },
  {
    "title": "какие списки используются при создании дескрипторов <UL> и </UL>?",
    "answer": "маркированные"
  },
  {
    "title": "дескрипторы, используемые при создании маркированных списков?",
    "answer": "<UL> и < / UL>"
  },
  {
    "title": "с помощью какого дескриптора определяются элементы маркированного списка?",
    "answer": "<LI>"
  },
  {
    "title": "синтаксис, используемый для изменения типа маркера?",
    "answer": "< LTYPE=тип>"
  },
  {
    "title": "что означает маркер DISK?",
    "answer": "заполненный круг"
  },
  {
    "title": "что означает маркер SQUARE?",
    "answer": "заполненный квадрат"
  },
  {
    "title": "что означает маркер CIRCLE?",
    "answer": "незаполненный круг"
  },
  {
    "title": "что входит в состав контейнера <DL> и </DL>?",
    "answer": "справочный список"
  },
  {
    "title": "с помощью каких дескрипторов строятся элементы списка определений?",
    "answer": "<DT>и<DD>"
  },
  {
    "title": "дескрипторы, позволяющие добавить пробел (пробел) в документ?",
    "answer": "< P>и<BR>"
  },
  {
    "title": "цель применения дескриптора < P>?",
    "answer": "для постановки абзаца"
  },
  {
    "title": "дескриптор, используемый для постановки абзаца?",
    "answer": "<P>"
  },
  {
    "title": "цель применения дескриптора <BR>?",
    "answer": "поставить символ, разделяющий строку"
  },
  {
    "title": "какой дескриптор используется для обозначения прерывания строки?",
    "answer": "<BR>"
  },
  {
    "title": "синтаксис, используемый для исправления абзаца по левому краю в окне браузера?",
    "answer": "<P ALIGN=LEFT>"
  },
  {
    "title": "какой синтаксис выполняется в окне браузера для исправления абзаца по правому краю?",
    "answer": "<P ALIGN=RIGHT>"
  },
  {
    "title": "какой синтаксис используется в окне браузера для исправления абзаца по центру?",
    "answer": "< P ALIGN=CENTER>"
  },
  {
    "title": "назначение дескриптора <p ALIGN=LEFT>?",
    "answer": "для исправления абзаца по левому краю"
  },
  {
    "title": "назначение дескриптора <p ALIGN=RIGHT>?",
    "answer": "для исправления абзаца по правому краю"
  },
  {
    "title": "назначение дескриптора <p ALIGN=CENTER>?",
    "answer": "для корректировки абзаца по центру"
  },
  {
    "title": "что используется для обозначения текста полужирным шрифтом?",
    "answer": "<B>"
  },
  {
    "title": "что используется для выделения текста курсивом?",
    "answer": "<I>"
  },
  {
    "title": "дескриптор, обозначаемый моноширинным шрифтом?",
    "answer": "<TT>"
  },
  {
    "title": "дескриптор, обозначающий подчеркнутым шрифтом?",
    "answer": "<U>"
  },
  {
    "title": "дескриптор записи текста, расположенный ниже?",
    "answer": "< SUB>"
  },
  {
    "title": "через что пишется текст, расположенный выше?",
    "answer": "< SUP>"
  },
  {
    "title": "что используется для написания зачеркнутого текста?",
    "answer": "< STRIKE>"
  },
  {
    "title": "специальный гипертекстовый язык, который передает документ?",
    "answer": "HTML"
  },
  {
    "title": "специальное оборудование, подключаемое к Сети Internet:",
    "answer": "модем"
  },
  {
    "title": "что называют совокупностью правил взаимосвязи между компьютерами?",
    "answer": "протокол"
  },
  {
    "title": "сколько уровней протокола содержится в международном стандарте OSI / ISO?",
    "answer": "7"
  },
  {
    "title": "маршрутизаторы-это...",
    "answer": "соединяет между собой части сети или различные сети"
  },
  {
    "title": "\"электронная почта\" означает - …",
    "answer": "обмен электронными сообщениями и пользователями сети"
  },
  {
    "title": "абонентская станция?",
    "answer": "персональный компьютер и модем"
  },
  {
    "title": "Internet отображает множество сетей, то есть следует одному протоколу—…",
    "answer": "TCP/IP"
  },
  {
    "title": "что называется 4-байтовой последовательностью, каждый байт которой записывается в виде десятичного числа?",
    "answer": "IP-адрес"
  },
  {
    "title": "из каких 2 частей состоит IP – адрес?",
    "answer": "с сетевых адресов и номеров хостов"
  },
  {
    "title": "как называется серверная программа, обеспечивающая поиск доменных имен IP-адресов узлов сети, находящихся в ведении ответственного сервера?",
    "answer": "DNS (Domain Name System)"
  },
  {
    "title": "программа, используемая для проверки соединения IP-адресов и машин:",
    "answer": "программа Ping"
  },
  {
    "title": "система файлового архива FTP – это…",
    "answer": "хранилище данных в сети за последние 10-15 лет"
  },
  {
    "title": "информационная мультимедийная система, основанная на гипертексте?",
    "answer": "WWW–«всемирная паутина»"
  },
  {
    "title": "что такое Web-браузеры...",
    "answer": "специальное программное обеспечение-программа просмотра документа WWW"
  },
  {
    "title": "URL (Uniform Resourse Locator) означает–",
    "answer": "отображение протокола, адрес сервера, имя директории на сервере"
  },
  {
    "title": "адрес электронной почты состоит из:",
    "answer": "идентификатор, символ @ и доменное имя сервера"
  },
  {
    "title": "Post Office Protocol означает –",
    "answer": "протокол, который работает с сервером и получает электронное сообщение"
  },
  {
    "title": "Simple Mail Transfer Protocol означает…",
    "answer": "протокол, работающий с серверной почтой"
  },
  {
    "title": "что мы называем Html-кодом?",
    "answer": "тег"
  },
  {
    "title": "расширение Html документа?",
    "answer": "html"
  },
  {
    "title": "Закрывающийся тег знак?",
    "answer": "/"
  },
  {
    "title": "АКТ означает:",
    "answer": "информационно-коммуникационные технологии"
  },
  {
    "title": "какой из перечисленных ниже дает определение в соответствии с информационной технологией?",
    "answer": "Информационные технологии-использование аппаратно-программного обеспечения для хранения, получения, обработки и распространения информации различных типов"
  },
  {
    "title": "какое из приведенных ниже утверждений неверно?",
    "answer": "Компьютер способен обрабатывать только цифровой сигнал"
  },
  {
    "title": "что из следующего правильно сформулировано?",
    "answer": "все вышеперечисленное"
  },
  {
    "title": "какое из приведенных ниже утверждений верно?",
    "answer": "Вирус-это тип программного обеспечения"
  },
  {
    "title": "правила связи компьютеров друг с другом:",
    "answer": "сетевые протоколы"
  },
  {
    "title": "значение процессора (CPU):",
    "answer": "центральный процессор"
  },
  {
    "title": "сервисное программное обеспечение включает в себя:",
    "answer": "WinRar, DrWeb, APBackUp"
  },
  {
    "title": "в базе данных Гипермедиа информационные биты хранятся в виде:",
    "answer": "узлы"
  },
  {
    "title": "высокая пропускная способность и полоса пропускания связи, используемая в микроволновых, кабельных и волоконно-оптических сетях:",
    "answer": "широкополосный"
  },
  {
    "title": "электронная платежная доска с коротким текстом или графическим рекламным сообщением:",
    "answer": "баннер"
  },
  {
    "title": "какое из нижеследующих не свойственно компьютеру?",
    "answer": "компьютер-это электрическая машина"
  },
  {
    "title": "как называется использование веб-сайтов для выражения своих жалоб?",
    "answer": "кибер вентинг"
  },
  {
    "title": "компьютер, предоставляющий доступ к Веб-контенту (база данных, документы и т.д.) через интернет",
    "answer": "веб-сервер"
  },
  {
    "title": "из чего вытекает концепция связующего интеллекта?",
    "answer": "подключенные сети"
  },
  {
    "title": "использование обычного телефона в качестве интернет-устройства:",
    "answer": "звуковая сеть"
  },
  {
    "title": "как называется трансляция видео с задержкой прямого эфира через Интернет?",
    "answer": "видео в реальном времени"
  },
  {
    "title": "LAN означает:",
    "answer": "Local Area Network"
  },
  {
    "title": "какое из приведенных ниже утверждений верно",
    "answer": "Модем преобразует аналоговый сигнал в цифровой и наоборот"
  },
  {
    "title": "какое из нижеследующих является определением компьютера?",
    "answer": "Компьютер-это электронное устройство, которое может быстро и точно хранить, получать и обрабатывать данные"
  },
  {
    "title": "информационно-коммуникационные технологии включают:",
    "answer": "все вышеперечисленное"
  },
  {
    "title": "какой из перечисленных ниже соответствует формату URL электронной почты?",
    "answer": "www@mail.com"
  },
  {
    "title": "на клавиатуре компьютера каждый символ имеет значение «ASCII», что он обозначает?",
    "answer": "American Standard Code for Information Interchange"
  },
  {
    "title": "какая часть центрального процессора (ЦП) производит вычисления и принимает решения?",
    "answer": "Arithmetic Logic Unit"
  },
  {
    "title": "значение» Dpi\":",
    "answer": "Dots per inch"
  },
  {
    "title": "значение» Dpi\":",
    "answer": "точки на дюйм"
  },
  {
    "title": "процесс оформления документов с текстом, графикой, заголовками и фотографиями:",
    "answer": "Desk Top Publishing"
  },
  {
    "title": "как называется перенос данных из одного приложения в другое?",
    "answer": "динамический обмен данными"
  },
  {
    "title": "www означает:",
    "answer": "всемирная сеть"
  },
  {
    "title": "значение CD ROM:",
    "answer": "Compact Disk Read Only Memory"
  },
  {
    "title": "как называется «мозг» компьютера, который держит периферийные устройства под своим контролем?",
    "answer": "центральный процессор"
  },
  {
    "title": "устройство для дополнительного хранения данных:",
    "answer": "Compact Disk Rewritable"
  },
  {
    "title": "Оперативная память:",
    "answer": "Random Access Memory"
  },
  {
    "title": "WYSIWYG-описывает отображение документа на экране, потому что он действительно печатает:",
    "answer": "вы получаете то, что видите"
  },
  {
    "title": "какой из нижеследующих не является компьютерным языком?",
    "answer": "UNIX"
  },
  {
    "title": "на клавишной панели не менее:",
    "answer": "101 клавиша"
  },
  {
    "title": "из скольких частей состоит адрес электронной почты?",
    "answer": "две части"
  },
  {
    "title": "Corel Draw популярный:",
    "answer": "иллюстративная программа"
  },
  {
    "title": "кто разработал бухгалтерское программное обеспечение “Tally\"?",
    "answer": "TCS"
  },
  {
    "title": "как называются ошибки в компьютерных программах?",
    "answer": "ошибки"
  },
  {
    "title": "что в основном используется HTML для проектирования?",
    "answer": "Веб-страница"
  },
  {
    "title": "» Micro Processing \" предназначен для:",
    "answer": "система счисления"
  },
  {
    "title": "как называется сочетание информации, графики, текста, звука, видео и анимации?",
    "answer": "Мультимедиа"
  },
  {
    "title": "что нужно для размещения ваших Веб-страниц на www?",
    "answer": "все перечисленное"
  },
  {
    "title": "компания, которая первой начала обслуживание мобильных телефонов в Индии?",
    "answer": "BPL"
  },
  {
    "title": "Chandrayan I был запущен в Индии 22 октября 2008 года:",
    "answer": "Шри Харикота"
  },
  {
    "title": "что такое Блог?",
    "answer": "частный или корпоративный веб-сайт в виде Интернет-журнала"
  },
  {
    "title": "какое из нижеследующих не имеет отношения к информационной безопасности в Интернете?",
    "answer": "поиск информации"
  },
  {
    "title": "какая самая большая единица хранения?",
    "answer": "Терабайт"
  },
  {
    "title": "Бит означает:",
    "answer": "двоичная цифра"
  },
  {
    "title": "какое из нижеследующих не относится к линейной структуре данных?",
    "answer": "двоичное дерево"
  },
  {
    "title": "какое из нижеследующих не является сетевым устройством?",
    "answer": "процессор"
  },
  {
    "title": "Компилятор используется для преобразования в объектный код, который может выполнять",
    "answer": "язык высокого уровня"
  },
  {
    "title": "какая система счисления используется на 32-разрядном компьютере?",
    "answer": "8"
  },
  {
    "title": "какое из нижеследующих относится к операционной системе?",
    "answer": "Microsoft Windows"
  },
  {
    "title": "какое из нижеследующих отличается от других названий?",
    "answer": "Google"
  },
  {
    "title": "где компьютер добавляет и сравнивает свои данные?",
    "answer": "жесткий диск"
  },
  {
    "title": "как определяются компьютеры в Интернете?",
    "answer": "через IP-адрес"
  },
  {
    "title": "какой из нижеследующих не является провайдером интернета (ISP)?",
    "answer": "Infotech India LtD"
  },
  {
    "title": "из каких условных обозначений состоит шестнадцатеричная система счисления?",
    "answer": "0 - 9, A - F"
  },
  {
    "title": "набор компьютерных программ, управляющих аппаратным / программным обеспечением компьютера:",
    "answer": "операционная система"
  },
  {
    "title": "что такое Windows?",
    "answer": "графическая операционная система"
  },
  {
    "title": "как называется организованный набор программного обеспечения, который управляет общей работой компьютера?",
    "answer": "операционная система"
  },
  {
    "title": "значение слова S / MIME в интернет-технологии",
    "answer": "расширение безопасности Почты в Интернете"
  },
  {
    "title": "восьмеричная Счетная система состоит из следующих знаков:",
    "answer": "0 - 7"
  },
  {
    "title": "значение DNS в интернет-технологии:",
    "answer": "Domain Name System"
  },
  {
    "title": "значение HTML:",
    "answer": "Hyper Text Markup Language"
  },
  {
    "title": "какое из нижеследующих относится к типу LAN?",
    "answer": "Ethernet"
  },
  {
    "title": "какое из приведенных ниже утверждений верно?",
    "answer": "Смарт-карты и компьютеры используют операционную систему"
  },
  {
    "title": "операционная система, используемая в мобильных телефонах:",
    "answer": "Android"
  },
  {
    "title": "с помощью какого из перечисленных ниже языков программирования высокого уровня можно перевести на машинный язык?",
    "answer": "Компилятор"
  },
  {
    "title": "служба HTML:",
    "answer": "создание веб-страницы"
  },
  {
    "title": "HTTP означает:",
    "answer": "протокол отправки гипертекста"
  },
  {
    "title": "IPv4 и IPv6-адреса, используемые для идентификации компьютеров в интернете. Найдите правильное утверждение среди следующих:",
    "answer": "количество битов, необходимых для адреса IPv4, меньше, чем количество битов, необходимых для адреса IPv6"
  },
  {
    "title": "зачем нужен протокол TCP / IP?",
    "answer": "для подключения к интернету"
  },
  {
    "title": "значение ASCII каждого символа на клавиатуре компьютера:",
    "answer": "американский стандартный код обмена информацией"
  },
  {
    "title": "какое из нижеследующих не относится к языку программирования?",
    "answer": "MS Office"
  },
  {
    "title": "минимальное количество бит, необходимое для сохранения любого 3-значного десятичного числа:",
    "answer": "10"
  },
  {
    "title": "Internet Explorer означает",
    "answer": "браузер"
  },
  {
    "title": "POP3 и IMAP-это учетные записи электронной почты",
    "answer": "протоколы, необходимые для отправки, получения электронной почты"
  },
  {
    "title": "значение ALU",
    "answer": "Arithmetic Logic Unit"
  },
  {
    "title": "на персональном компьютере несколько микросхем, установленных на схеме:",
    "answer": "материнская плата"
  },
  {
    "title": "компьютерный вирус – это:",
    "answer": "программное обеспечение"
  },
  {
    "title": "расширение файла документа MS-Word в пакете MS Office 2007:",
    "answer": ".docx"
  },
  {
    "title": "протокол, используемый для загрузки электронной почты на компьютер.",
    "answer": "POP"
  },
  {
    "title": "части жесткого диска",
    "answer": "сектора"
  },
  {
    "title": "система перевода программы на компьютерный язык:",
    "answer": "интерпретатор"
  },
  {
    "title": "значение гигабайта:",
    "answer": "1024 мегабайт"
  },
  {
    "title": "интернет-магазин:",
    "answer": "TCP / IP"
  },
  {
    "title": "Виртуальная память означает",
    "answer": "иллюзия очень большой основной памяти"
  },
  {
    "title": "этический протокол в Интернете:",
    "answer": "netiquette"
  },
  {
    "title": "коммерческие сообщения в Сети:",
    "answer": "Веб-реклама"
  },
  {
    "title": "термин, используемый Мануэлем Кастелем первым",
    "answer": "сетевое общество"
  },
  {
    "title": "gif значение:",
    "answer": "Graphics Interchange Format"
  },
  {
    "title": "определите браузер:",
    "answer": "Firefox"
  },
  {
    "title": "устанавливается как постиндустриальное общество:",
    "answer": "Информационное общество"
  },
  {
    "title": "первая цель интернет-связи:",
    "answer": "военные цели"
  },
  {
    "title": "сеть внутри учреждений:",
    "answer": "локальная сеть"
  },
  {
    "title": "сжатие локальной сети:",
    "answer": "LAN"
  },
  {
    "title": "Первый виртуальный университет Индии:",
    "answer": "Тамилнад"
  },
  {
    "title": "какое из нижеследующих относится к социальной сети?",
    "answer": "Twitter"
  },
  {
    "title": "протокол FTP",
    "answer": "протокол передачи файлов"
  },
  {
    "title": "какое из нижеследующих не относится к формату графического файла?",
    "answer": "GUI"
  },
  {
    "title": "первый веб-браузер",
    "answer": "Internet Explorer"
  },
  {
    "title": "когда компьютер загружается, BIOS загружается:",
    "answer": "ROM"
  },
  {
    "title": "какое из нижеследующих отличается от остальных?",
    "answer": "IP-адрес"
  },
  {
    "title": "gif, jpg, bmp, png используются в качестве расширений для хранения файлов",
    "answer": "сведения об изображении"
  },
  {
    "title": "в каком из нижеследующих употребляются знаки A-F?",
    "answer": "шестнадцатеричная система отсчета"
  },
  {
    "title": "какое из нижеследующих не является поисковой системой?",
    "answer": "Chrome"
  },
  {
    "title": "цифровые возможности",
    "answer": "все вышеперечисленное"
  },
  {
    "title": "метод кодирования данных для распределения по Сети:",
    "answer": "Шифрование"
  },
  {
    "title": "какое из нижеследующих не является устройством вывода?",
    "answer": "клавиатура"
  },
  {
    "title": "какой из нижеследующих означает миллиард символов",
    "answer": "гигабайт"
  },
  {
    "title": "открытая система управления базами данных",
    "answer": "MySQL"
  },
  {
    "title": "какой из нижеследующих показывает двоичный эквивалент десятичного числа 25:",
    "answer": "11001"
  },
  {
    "title": "мессенджер, используемый для разговора:",
    "answer": "Google Talk"
  },
  {
    "title": "NMEICT означает",
    "answer": "национальная миссия образования через ИКТ"
  },
  {
    "title": "какое из нижеследующих предназначено для оперативного обмена сообщениями?",
    "answer": "Всего"
  },
  {
    "title": "из чего состоит байт на компьютере?",
    "answer": "8 бит"
  },
  {
    "title": "какое из нижеследующих не относится к устройству ввода?",
    "answer": "Монитор"
  },
  {
    "title": "программа просмотра и издания публикаций",
    "answer": "AcrobatReader"
  },
  {
    "title": "какое из нижеследующих позволяет нам отправлять одно и то же письмо разным людям в MS Word?",
    "answer": "объединение Почты"
  },
  {
    "title": "тип схемы памяти, сохраняющей порядок срабатывания компьютера:",
    "answer": "ROM (ReadOnlyMemory)"
  },
  {
    "title": "программа для написания и чтения электронных писем.",
    "answer": "Оutlоок ехр"
  },
  {
    "title": "ожидаемое сообщение электронной почты, отправленное многочисленным получателям одновременно",
    "answer": "спам"
  },
  {
    "title": "концепция \"исследование, проектирование, разработка, внедрение, поддержка или управление компьютерными информационными системами, особенно программным обеспечением и компьютерным оборудованием\"",
    "answer": "Информационные технологии (IT)"
  },
  {
    "title": "краткая запись масштабной сети:",
    "answer": "WAN"
  },
  {
    "title": "известен как процесс копирования файлов на CD-ROM",
    "answer": "Burning"
  },
  {
    "title": "программа, преобразующая первую программу, написанную на языке программирования, в машинный язык",
    "answer": "компилятор"
  },
  {
    "title": "программное обеспечение для сканирования Веб-страниц:",
    "answer": "Веб-браузер"
  },
  {
    "title": "что такое Логин?",
    "answer": "первая часть электронного адреса"
  },
  {
    "title": "Random Access Memory (RAM):",
    "answer": "память случайного доступа"
  },
  {
    "title": "протокол HTTP в компьютерной сети:",
    "answer": "протокол передачи гипертекста"
  },
  {
    "title": "когда вступил в силу акт ИТ?",
    "answer": "17 октября 2000 г."
  },
  {
    "title": "на какие годы рассчитана концепция информатизации образования?",
    "answer": "2002-2004"
  },
  {
    "title": "единица обмена информацией на физическом уровне сети:",
    "answer": "Бит"
  },
  {
    "title": "память для долговременного хранения информации",
    "answer": "внешняя память"
  },
  {
    "title": "выявление коммерческих сообщений в Сети:",
    "answer": "Веб-реклама"
  },
  {
    "title": "первым употребил термин Мануэль Кастель",
    "answer": "сетевое общество"
  },
  {
    "title": "gif значение:",
    "answer": "формат графического обмена"
  },
  {
    "title": "какое из нижеследующих не относится к операционной системе",
    "answer": "Firefox"
  },
  {
    "title": "аббревиатура FTP",
    "answer": "File Transfer Protocol"
  },
  {
    "title": "Google диск включает в себя следующие сервисы:",
    "answer": "создание изображений и презентаций (формы и таблицы Googl-"
  },
  {
    "title": "Google удобный браузер для работы с документами",
    "answer": "Google Chrome"
  },
  {
    "title": "какое значение имеет слово Интерактив\"?",
    "answer": "inter (совместно), act (действи-"
  },
  {
    "title": "общее название геометрической схемы объединения компьютеров:",
    "answer": "топология сети"
  },
  {
    "title": "адрес, который записывается на первую (первую) страницу сервера?",
    "answer": "URL"
  },
  {
    "title": "Презентация – это:",
    "answer": "разнообразие слайдов в зависимости от определенной темы"
  },
  {
    "title": "Kaspersky AVP, Dr.Web-это:",
    "answer": "антивирусные программы"
  },
  {
    "title": "сетевые вирусы ...",
    "answer": "распространяется при использовании локальных и масштабных сетевых протоколов"
  },
  {
    "title": "что из нижеследующего означает один характер billion?",
    "answer": "Gigabyte"
  },
  {
    "title": "какие программы (утилиты) входят в сервисное программное обеспечение:",
    "answer": "WinRar, DrWeb, APBackUp"
  },
  {
    "title": "сколько рядов в среде MS Excel 2003?",
    "answer": "65536"
  },
  {
    "title": "мессенджер, используемый для разговора?",
    "answer": "GoogleTalk"
  },
  {
    "title": "значение NMEICT?",
    "answer": "National Mission on Education through ICT"
  },
  {
    "title": "какое из нижеследующих не относится к приложению для обмена мгновенными сообщениями?",
    "answer": "Mail.ru"
  },
  {
    "title": "из чего состоит байт на компьютере:",
    "answer": "8 бит"
  },
  {
    "title": "какое из нижеследующих не относится к устройству ввода?",
    "answer": "Monitor"
  },
  {
    "title": "программное обеспечение с открытым исходным кодом?",
    "answer": "Mozilla Firefox"
  },
  {
    "title": "приложение, которое позволяет отправлять одно и то же письмо разным людям в MS Word?",
    "answer": "Mailmerge"
  },
  {
    "title": "характер ASCII?",
    "answer": "American Standard Code for Information Interchange"
  },
  {
    "title": "сообщение электронной почты, которое не может быть отправлено многим получателям одновременно?",
    "answer": "Spam"
  },
  {
    "title": "исследование, проектирование, разработка, внедрение, поддержка или управление компьютерными информационными системами, особенно программными приложениями и компьютерным оборудованием?",
    "answer": "Information Technology"
  },
  {
    "title": "какими клавишами можно восстановить удаленные данные в среде Microsoft Excel?",
    "answer": "Ctrl + Z"
  },
  {
    "title": "клавиша начала ввода формулы в ячейку MS Excel?",
    "answer": "="
  },
  {
    "title": "с какого символа должна начинаться вся формула:",
    "answer": "="
  },
  {
    "title": "пересечение столбца и строки с уникальным адресом электронной таблицы и наименование определенной области:",
    "answer": "клетка"
  },
  {
    "title": "на листе Excel активная ячейка отображается следующим образом:",
    "answer": "с размытой широкой границей"
  },
  {
    "title": "для соединения двух ячеек (А1 и А2) используется следующая формула?",
    "answer": "=A1 + A2"
  },
  {
    "title": "какие три типа данных содержатся в электронной таблице?",
    "answer": "числа, формулы, знаки"
  },
  {
    "title": "какую клавишу клавиатуры использовать в Microsoft PowerPoint для просмотра слайд-шоу?",
    "answer": "F5"
  },
  {
    "title": "в программе Microsoft PowerPoint не предусмотрена следующая возможность?",
    "answer": "связывание сдвига слайда с лазерной указкой"
  },
  {
    "title": "как называются объекты, в которых хранится текст на слайде?",
    "answer": "Placeholders"
  },
  {
    "title": "определите выход из приложения PowerPoint!",
    "answer": "скопировать в значок Меню Управления приложения"
  },
  {
    "title": "какое действие выполняется нажатием клавиш CTRL + O в MS-Access?",
    "answer": "Открыть существующую базу данных"
  },
  {
    "title": "какие клавиши открытия баз данных уже существуют в MS-Access?",
    "answer": "CTRL+O"
  },
  {
    "title": "клавиши открытия новой базы данных в программе in MS-Access?",
    "answer": "CTRL+N"
  },
  {
    "title": "какое из нижеследующих не относится к типу данных в MS-Access?",
    "answer": "Таблица"
  },
  {
    "title": "какова максимальная длина текста валидации в MS-Access?",
    "answer": "255"
  },
  {
    "title": "как называются столбцы таблицы Microsoft Access?",
    "answer": "Поля"
  },
  {
    "title": "определите IP-адрес.",
    "answer": "202.50.20.148"
  },
  {
    "title": "значение CSS?",
    "answer": "Cascading Style Sheets"
  },
  {
    "title": "двоичный эквивалент десятичного числа 35?",
    "answer": "100011"
  },
  {
    "title": "адрес почтового сервера ...",
    "answer": "Домены"
  },
  {
    "title": "что такое FTP?",
    "answer": "File Transfer Protocol"
  },
  {
    "title": "сколько частей содержит URL?",
    "answer": "три"
  },
  {
    "title": "какой адрес используется для гиперссылок",
    "answer": "URL"
  },
  {
    "title": "какие форматы используются в графических элементах Веб-страниц?",
    "answer": "GIF, JPEG"
  },
  {
    "title": "что определяет домен высокого уровня?",
    "answer": "наименование государства"
  },
  {
    "title": "из скольких частей (чисел) состоит IP?",
    "answer": "4 части, разделенные точкой"
  },
  {
    "title": "что такое язык гипертекстовой разметки?",
    "answer": "html"
  },
  {
    "title": "как называется получение изображения с внешнего источника - сканера, цифровой фотокамеры?",
    "answer": "import"
  },
  {
    "title": "какой из перечисленных ниже дает определение в соответствии с информационной технологией?",
    "answer": "под информационными технологиями подразумевается использование аппаратного и программного обеспечения для хранения, получения, обработки и распространения информации многих типов."
  },
  {
    "title": "какое из приведенных ниже утверждений неверно?",
    "answer": "Компьютер способен обрабатывать только цифровой сигнал"
  },
  {
    "title": "какие основные функции являются достижением линии и предотвращением столкновения?",
    "answer": "сетевые протоколы"
  },
  {
    "title": "в каком виде хранятся информационные биты в базе данных Гипермедиа?",
    "answer": "узлы"
  },
  {
    "title": "как называется пропускная способность связи высокой емкости и используемая в микроволновых, кабельных и волоконно-оптических сетях?",
    "answer": "широкополосный"
  },
  {
    "title": "Покажите программу работы с видео?",
    "answer": "Adobe Premiere Pro"
  }
]