module.exports = [
  {
    title: 'Екі монеталар лақтырылды. Келесі оқиғалар қарастырылады: A1- бірінші монетада елтаңба бетінің түсуі; A2- екінші монетада елтаңба бетінің түсуі. Тек бір ғана елтаңба бетінің түсу нәтижесінде алынатын оқиғаның ақпарат санын табу қажет.',
    answer: `p(A1)=0.5; p(A2)=0.5;
    p(A1+A2)=p(A1)-p(A2)-p(A1A2)=0.5+0.5-0.25=0.75
    I=-log2 0.75=0.415 бит
    `
  },
  {
    title: 'Жәшікте 9 ақ шар (A) және 16 қарашар (B) бар. Жәшіктен (бір уақытта немесе тізбектеліп) екі шар алынады. Жүзеге асыру кезінде алынған екі шардың да ақ түсті болатын оқиғаның ақпарат санын табу.',
    answer: `P1=9/(9+16)=9/25;
    P2=(9-1)/(25-1)=8/24=1/3;
    P=P1*P2=(9*8)/(25*24)=0.12
    I=-log2P=-log_2 0.12=3,059 бит
    `
  },
  {
    title: 'Хабарлама көзінен қалыптасқан ұзындығы N=47 символдан тұратын келесі ансамбльде сипатталған хабарламаның ақпараттық санын анықтау қажет: A = {s_1/0.2 s_2/0.3 s_3/0.45 s_4/0.05}',
    answer: `H(A)=-(0.2log20.2+0.3log20.3+0.45log20.45+0.05log20.05=1.719 бит/сим
      I=n*H(A)=47*1.719=80.84 бит
    `
  },
  {
    title: 'S1 (кәдімгі) немесе S2 (аномальды) екі жағдайдың бірінде болуы мүмкін, белгілі бір S физикалық жүйесі берілген. S жүйесінде циклдық процесс өтеді, оның барысында p=0,002 ықтималдығы аз жүйе циклдердің әрқайсысында s2 күйіне өтуі мүмкін. k циклі арқылы жүйенің жағдайына тексеру жүргізіледі. Анықтау кезінде алынатын жүйенің жағдайы ең үлкен болатын ақпарат санының k мәнін анықтау қажет. Қарастырылып отырған жүйе келесі ансамбльде сипатталуы мүмкін: S = {s_1 / 1 - (1 - p)^k s_2/ (1 - p)^k}',
    answer: `1-(1-p)^k=(1-p)^k
    k=(-1)/(log_2(1-p))=(-1)/(log_2 (1-0.002))=346`
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бір алтылықтың түсуі;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бір алтылықтың түсуі:  m=10 (1;6) (2;6) (3;6) (4;6) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5)
    P=10/36=0.277;
    I=-log2P=-log_2 0.277=1.852 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бірде бір сүйектің үш еселі санға тең болмауы;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бірде бір сүйектің үш еселі санға тең болмауы;:  m=16 (1;1) (1;2) (1;4) (1:5) (2;1) (2;2) (2;4) (2;5) (4;1) (4;2) (4;4) (4;5) (5;1) (5;2) (5;4) (5;5) 
    P=16/36=0.444
    I=-log2P=-log_2 0.444=1.171 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бір жұп санның түсуі;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бір жұп санның түсуі:  m=18 (1;2) (1;4) (1;6) (2;1) (2;3) (2;5) (3;2) (3;4) (3;6) (4;1) (4;3) (4;5) (5;2) (5;4) (5;6) (6;1) (6;3) (6;5) 
    P=18/36=0.5
    I=-log2P=-log_2 0.5=1 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бірде бір сүйекте алтылықтың болмауы;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бірде бір сүйекте алтылықтың болмауы:  m=25 (1;1) (1;2) (1;3) (1;4) (1:5) (2;1) (2;2) (2;3) (2;4) (2;5) (3;1) (3;2) (3;3) (3;4) (3;5) (4;1) (4;2) (4;3) (4;4) (4;5) (5;1) (5;2) (5;3) (5;4) (5;5) 
    P=25/36=0.694
    I=-log2P=-log20.694=0.5267 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бір екіліктің түсуі;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бір екіліктің түсуі:  m=10 (1;2) (2;1) (2;3) (2;4) (2;5) (2;6) (3;2) (4;2) (5;2) (6;2) 
    P=10/36=0.277;
    I=-log2P=-log2 0.277=1.852 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бірде бір сүйекте жұп санның болмауы;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бірде бір сүйекте жұп санның болмауы:  m=10 (1;1) (1;3) (1:5) (1;6) (3;1) (3;3) (3;5) (5;1) (5;3) (5;5) 
    P=10/36=0.277;
    I=-log2P=-log2 0.277=1.852 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бір үш еселі санның түсуі;',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бір үш еселі санның түсуі:  m=16 (1;3 (1;6) (2;3) (2;6) (3;1) (3;2) (3;4) (3;5) (4;3) (4;6) (5;3) (5;6) (6;1) (6;2) (6;4) (6;5) 
    P=16/36=0.444
    I=-log2P=-log2 0.444=1.171 бит
    `
  },
  {
    title: 'Екі ойын сүйектерін бір рет лақтыру жүргізіледі. Келесі оқиғалар туындаған кезде алынатын ақпарат санын анықтау: - бірдей сандардың түсуі.',
    answer: `Барлық жағдайлар саны n=36 (1;1) (1;2) (1;3) (1;4) (1:5) (1;6) (2;1) (2;2) (2;3) (2;4) (2;5) (2;6) (3;1) (3;2) (3;3) (3;4) (3;5) (3;6) (4;1) (4;2) (4;3) (4;4) (4;5) (4;6) (5;1) (5;2) (5;3) (5;4) (5;5) (5;6) (6;1) (6;2) (6;3) (6;4) (6;5) (6;6)
    Бірдей сандардың түсуі:  m=6 (1;1) (2;2) (3;3) (4;4) (5;5) (6;6)
    P=6/36=0.166
    I=-log2P=-log2 0.166=2.59 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - алғашқы екі карта қызыл, қалған екеуі қара; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы–52. Қызыл–26. Қара–26.
    P1=26/52=0.5; P2=25/51=0.49; P3=26/50=0.52; P4=25/49=0.51;
    P=P1*P2*P3*P4=0.5*0.49*0.52*0.51=0.27;
    I=-log2P=-log20.27=1.88 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - барлық төрт карта әртүрлі масттен; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Қиық – 13; Тапа – 13; Шыбын – 13; Қарға – 13.
    P1=(13+13+13+13)/52=1; P2=(13+13+13)/51=0.76; P3=(13+13)/50=0.52; P4=13/49=0.26
    P=P1*P2*P3*P4=1*0.76*0.52*0.26=0.1
    I=-log2P=-log20.27=1.88 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - алғашқы екі карта туздар, қалған екеуі алтылық; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Тұз – 4. Алтылық – 4.
    P1=4/52=0.077; P2=3/51=0.058; P3=4/50=0.08; P4=3/49=0.061;
    P=P1*P2*P3*P4=0.077*0.058*0.08*0.061=0.00002;
    I=-log2P=-log20.00002=15.6 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - барлық төрт карта сандармен; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52; Сандар – 36;
    P1=36/52=0.692; P2=35/51=0.686; P3=34/50=0.68; P4=33/49=0.693;
    P=P1*P2*P3*P4=0.692*0.686*0.68*0.693=0.22;
    I=-log2P=-log20.22=2.184 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - барлық төрт карта бір масттен; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Қиық – 13; Тапа – 13; Шыбын – 13; Қарға – 13.
    P1=52/52=1; P2=12/51=0.235; P3=11/50=0.22; P4=10/49=0.2;
    P=P1*P2*P3*P4=1*0.235*0.22*0.2=0.01;
    I=-log2P=-log20.01=6.64 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - бірінші екі карта бір масттен, қалған екеуі – басқа масттен; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Қиық – 13; Тапа – 13; Шыбын – 13; Қарға – 13.
    P1=52/52=1; P2=12/51=0.235; P3=39/50=0.78; P4=12/51=0.235;
    P=P1*P2*P3*P4=1*0.235*0.78*0.235=0.043
    I=-log2P=-log20.043=4.54 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - барлық төрт карта қызыл; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы–52. Қызыл–26. Қара–26.
    P1=26/52=0.5; P2=25/51=0.49; P3=24/50=0.48; P4=23/49=0.47;
    P=P1*P2*P3*P4=0.5*0.49*0.48*0.47=0.055
    I=-log2P=-log20.055=4.184 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - барлық төрт карта әр түрлі әріптермен; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Әріптер – 16; Т-4; К-4; Д-4; В-4;
    P1=16/52=0.3; P2=12/51=0.235; P3=0.156; P4=4/52=0.077;
    P=P1*P2*P3*P4=0.3*0.235*0.156*0.077=0.0008
    I=-log2P=-log20.0008=10.2877 бит
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - бірінші карта алтылық, екіншісі - жеті, үшіншісі – тоғыз, төртінші - ондық; Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52; Алтылық – 4; Жетілік – 4; Тоғыздық – 4; Ондық – 4;
    P1=4/52=0.077; P2=4/51=0.078; P3=4/50=0.08; P4=4/49=0.081;
    P= P1*P2*P3*P4=0.077*0.078*0.08*0.081=0.0000389
    I=-log2P=-log20.0000389=14.65 бит	
    `
  },
  {
    title: 'Карталардың толық колодынан (52 парақ, 4 масти) колодқа қайтарусыз төрт картаны біртіндеп алып тастайды. Келесі оқиғаларды жүзеге асыру кезінде алынатын ақпарат санын анықтау қажет: - бірінші екі карта әріптермен, ал қалған екеуі - сандармен;  Ескерту. Карта әріптермен - Тұз, Король, Дама, Валет. Карта сандармен - екілік, үштік,...,ондық.',
    answer: `Барлығы – 52. Әріптер – 16; Сандар – 36.
    P1=16/52=0.3; P2=15/51=0.294; P3=36/50=0.72; P4=35/49=0.714
    P= P1*P2*P3*P4=0.3*0.294*0.72*0.714=0.045
    I=-log2P=-log20.045=4.47 бит
    `
  },
  {
    title: '0,21 0,12 0,05 0,08 0,03 0,14 0,2 0,17',
    answer: `H = -∑ pi * log2pi
    H = -(0.21*log20.21+0.12*log20.12+0.05*log20.05+0.08*log20.05+0.03*log20.03+ 0.14*log20.14+0.2*log20.2+0.17*log20.17)=2.44384 бит/символ
    n=8;
    I= -n*H=19.5507 бит
    `
  },
  {
    title: '0,13 0,04 0,19 0,16 0,18 0,12 0,13 0,05',
    answer: `H = -∑ pi * log2pi
    H = -(0.13*log20.13+0.04*log20.04+0.19*log20.19+0.16*log20.16+0.18*log20.18+ 0.12*log20.12+0.13*log20.13+0.05*log20.05)= 2.85776 бит/символ
    n=8;
    I= -n*H=22.8621 бит
    `
  },
  {
    title: '0,2 0,15 0,16 0,04 0,19 0,05 0,12 0,09',
    answer: `H = -∑ pi * log2pi
    H = -(0.2*log20.2+0.15*log20.15+0.16*log20.16+0.04*log20.04+0.19*log20.19+0.05*log20.05+ 0.12*log20.12+0.09*log20.09)= 2.83475 бит/символ
    n=8;
    I= -n*H=22.678 бит
    `
  },
  {
    title: '0,14 0,1 0,04 0,17 0,12 0,16 0,05 0,22',
    answer: `H = -∑ pi * log2pi
    H =-(0.14*log20.14+0.1*log20.1+0.04*log20.04+0.17*log20.17+0.14*log20.12+ 0.16*log20.16+0.05*log2*0.05+0.22*log20.22)= 2.8364 бит/символ
    n=8;
    I= -n*H=22.6912 бит
    `
  },
  {
    title: '0,06 0,21 0,03 0,23 0,13 0,12 0,14 0,08',
    answer: `H = -∑ pi * log2pi
    H=-(0.06*log20.06+0.21*log20.21+0.03*log20.03+0.23*log20.23+ 0.13*log20.13+0.12*log20.12+0.14*log20.14+0.08*log20.08=2.79412 бит/символ
    n=8;
    I= -n*H=22.353 бит
    `
  },
  {
    title: '0,2 0,15 0,07 0,04 0,19 0,05 0,12 0,09',
    answer: `k=-1/log2(1-p)
    k=-1/log2(1-0.2)=3.10628
    k=-1/log2(1-0.15)=4.26502
    k=-1/log2(1-0.07)=9.55134
    k=-1/log2(1-0.04)=16.9797
    k=-1/log2(1-0.19)=3.28941
    k=-1/log2(1-0.05)=13.5134
    k=-1/log2(1-0.12)=5.42227
    k=-1/log2(1-0.09)=7.34961
    `
  },
  {
    title: '0,1 0,23 0,08 0,02 0,21 0,25 0,16 0,14',
    answer: `k=-1/log2(1-p)
    k=-1/log2(1-0.1)=6.51881
    k=-1/log2(1-0.23)=2.65203
    k=-1/log2(1-0.08)=8.31295
    k=-1/log2(1-0.02)=34.3096
    k=-1/log2(1-0.21)=2.94052
    k=-1/log2(1-0.25)=2.40942
    k=-1/log2(1-0.16)=3.97553
    k=-1/log2(1-0.14)=4.59577
    `
  },
  {
    title: 'Техникалық құрылғы  0,1 0,23 0,08 0,02 0,21 0,25 0,16 0,14',
    answer: `k=-1/log2(1-p)
    k=-1/log2(1-0.1)= 6.51881
    k=-1/log2(1-0.23)= 2.65203
    k=-1/log2(1-0.08)= 8.31295
    k=-1/log2(1-0.02)= 34.3096
    k=-1/log2(1-0.21)= 2.94052
    k=-1/log2(1-0.25)= 2.40942
    k=-1/log2(1-0.16)= 3.97553
    k=-1/log2(1-0.14)= 4.59577
    `
  },
  {
    title: 'Үш секциялы көшедегі бағдаршам үшін алфавит қандай болады?',
    answer: `Бағдаршам бөліктерінің үш түсті жиынтығы. Көріп отырғаныңыздай, жауап өте айқын, бірақ оның толық және нақты тұжырымы бірден пайда болмайды. Бұл бөлімнің міндеттерін практикалық жаттығуларда еркін пікірталас режимінде шешудің мағынасы бар, жеке пікірлер мен әртүрлі тұжырымдар негізінде толық жауап бірте-бірте пайда болады. Мұндай мәселелерді өз бетімен шешкен кезде, ойға келген бірінші жауапты бермеу керек: мәселеде ұсынылған жүйенің жұмыс істеуінің барлық мүмкін нұсқаларын ойластырып, оларды біріктіру керек. Сонымен, келтірілген мысалдың сұрағына бірінші реакция жауап: «үш түстің жиынтығы», біраз талқылаудан кейін бағдаршам сигналдарының қосымша нұсқалары пайда болады, мысалы, қызыл және сары түстер бір уақытта жанып кетуі мүмкін (бірақ сары және жасыл мүмкін емес) немесе сол сары жыпылықтауы мүмкін. Бұл сигналдардың әрқайсысы өз ақпаратын алып жүреді. Соған қарамастан, орыс тілінің кәдімгі әліпбиінің аналогына сілтеме жасай отырып, бағдаршам әліпбиі дәл үш түсті және олардың комбинациясы, ауысу режимі әліпбидің «әріптерінен» тұратын хабарламалар болып табылады деген қорытындыға келдік.`
  },
  {
    title: 'Ашық теңіздегі екі кеменің белгі берушілері прожекторлық телеграф көмегімен бір-біріне хабарлама береді. Бұл жағдайда байланыс арнасы, байланыс желісі не болады? Мұндай байланыс арнасында қандай кедергілер болуы мүмкін?',
    answer: `Анықтамаға сәйкес байланыс арнасы «таратқыш – байланыс желісі – қабылдағыш» жиыны болып табылады. Бұл жағдайда таратқыш прожектор, қабылдағыш сигнал берушінің көру органдары болып табылады. Байланыс сілтемесі, анықтамасы бойынша, сигналды таратқыштан қабылдағышқа тасымалдайтын кез келген физикалық орта. Мысалда бұл ауа ортасы және байланыс арнасындағы мүмкін кедергілер: атмосфералық құбылыстар (тұман, жаңбыр, қар, найзағай), кемелер арасындағы жоғары толқындар, прожекторлардың техникалық ақаулары. Бұл бөлімнің міндеттерін шешу барысында кез келген ақпаратты беру жүйелерінің күрделілігі, олардың қызмет ететін жағдайларының әртүрлілігі туралы түсінік қалыптасады. Бұл ақпарат теориясының басқа бөлімдерін түсінуді одан әрі жеңілдететін «белгі», «сигнал», «ақпарат көзі», «алфавит», «хабарлама» абстрактілі ұғымдарының нақты бейнелерін тудыруы маңызды.`
  },
  {
    title: 'Жауынгер мылтықтан нысананы атады. Әрбір атылған кезде кесу ықтималдығы p1=0,2. Бір рет атылған кездегі оқтың нысанаға тию ықтималдығы p2=0,7. Жауынгер екі рет оқ атады. Оқтың нысанаға тию туралы хабарлама қанша ақпараттан тұрады?',
    answer: `p=1-(p1+(1-p1)(1-p2))2
    p=1-(0.2+(1-0.2)(1-0.7))2=1-(0.2+0.8*0.3)21-0.442=0.8064
    I=-log2p=-log20.8064=0.31 бит
    `
  },
  {
    title: 'Екі бөлшектер жиынтығы бар. Бірінші жиынтықтың бөлшегі стандартты, 0,8 тең, ал екіншісі — 0,9. Алынған жиынтықтың (наугад алынған жиынтық) — стандартты екені туралы хабарламада қанша ақпарат бар?',
    answer: `Бірінші және екінші жиынтықты таңдау ықтималдығы сәйкесінше: p(b1)=0.5; p(b2)=0.5; 
    p(a/b1)=0.8; p(a/b2)=0.9; 
    Стандартты болу ықтималдығы Байес формуласы бойынша
    P(a)= p(b1)* p(a/b1)+ p(b2)* p(a/b2)=0.5*0.8+0.5*0.9=0.85
    I=-log2p(a)=-log20.85=0.23 бит
    `
  },
  {
    title: 'Екі тетраэдрді лақтыру кезінде кездейсоқ сандарды алумен байланысты ансамбльдің энтропиясын (биттердегі) есептеу.',
    answer: `Тэтраедрды лақтарғанда сандардығ кездейсоқ түсу кестесі:
      1	2	3	4
    1	2	3	4	5
    2	3	4	5	6
    3	4	5	6	7
    4	5	6	7	8

    {X,p(x)}={2/1/16 3/2/16 4/3/16 5/4/16 6/3/16 7/2/16 8/1/16}

    H(X)=-∑_(i=1)^k p(x_i ) log_2 p(x_i)

    (X)=-(1/16 log_2  1/16*2+2/16 log_2  2/16*2 + 3/16 log_2  3/16*2 + 4/16 log_2  4/16) ≈ 2.6
    `
  },
  {
    title: 'Екі ансамбльдің энтропиясы қандай қатынаста табылады: x: 0,25 0,5 0,125 0,125 y: 0,5 0,25 0,125 0,125',
    answer: `H(X)=-( 0.5log20.5+0.25log20.25+0.125log20.125+0.125log20.125)=1.75 бит/сим
    H(Y)=-(0.25log20.25+0.5log20.5+0.125log20.125+0.125log20.125)=1.75 бит/сим
    Екі ансамбльдер бойынша энтропиялар тең және ансамбльдердің құрылымында да тек алғашқа екі ансамбльдің орыны бойынша ғана айырмашылық бар. Ансамбльдердің анықталмағандығы да бірдей болады.
    `
  },
  {
    title: '1-ден N-ге дейінгі диапазонда бүтін санды тапқанда 7 бит ақпарат алынды. N неге тең?',
    answer: `I=log2N=7 бит
    N=2^7=128
    `
  },
  {
    title: 'Хабарлама ақпарат көздері символдар ансамблін шығарады x: 0,25 0,5 0,125 0,125 Тізбектегі символдар статистикалық тәуелсіз. Ақпарат көздердің энтропиясын есептеу және алфавиттің артықтығын анықтау',
    answer: `H(X)=-(0.25log20.25+0.5log20.5+0.125log20.125+0.125log20.125)=1.75 бит/сим
    Hmax=log24=2
    γ=H/Hmax=1.75/2=0.875
    `
  },
  {
    title: 'Кездейсоқ шаманың дифференциалдық энтропиясын есептеу',
    answer: `
    H(x)=-∫_(-⧝)^0〖0〖log〗_2 0dx-∫_0^1〖x^2 〖log〗_2 x^2 dx-∫_1^⧝〖1〖log〗_2 1dx〗〗〗
    ∫〖x^p ln x dx= x^(p+1) [lnx/(p+1) - 1/(p+1)^2 ]
    H(x)=-∫_0^1〖x^2 lnx^2 dx=-2∫_0^1〖x^2 lnxdx=-2x^3 [lnx/3-1/9]]_0^1 = 0.22 нат.`
  },
  {
    title: 'X кездейсоқ шаманың ықтимал мәндерінің аймағы [a, b]: a≤x≤b аралығымен шектелетіні белгілі. Ең үлкен энтропияға ие үлестірун табу.',
    answer: `
    H_E (x)=-∫_a^b p(x) log_2 p(x)dx
    ∫_a^b p(x)dx=1
    ∫_a^b F(x,p)dx=∫_a^b [-p(x) log_2 p(x)+λp(x)]dx
    (∂F(x,p))/∂p=[-1- log_2 p +λ]=0
    p=exp(λ-1)
    ∫_a^b exp(λ-1)dx=exp (λ-1)∫_a^b dx=[exp(λ-1)]*(b-a)=1
    p(x)={(0,x<a) (1/(b-a),a≤x≤b) (0,x>b)}
    Берілген шектеулерде ең үлкен энтропияға ие үлестірім біркелкі үлестіру болып табылады.
    `
  },
  {
    title: 'Ақпараттық арнада 8 символдан тұратын алфавит қолданылады. Барлық символдардың ұзақтығы бірдей және тең τ =2мкс. Шу болмаған кезде арнаның өткізу қабілетін анықтау.',
    answer: `C=(log_2 n)/τ=(log_2 8)/(2*10^(-6))=1.5*10^6 бит/сек`
  },
  {
    title: ' Жадсыз екілік симметриялы арна каналды матрицамен берілген P(B/A)=‖(1-p    p  @p     1-p)‖    және кірістегі элементтердің ықтималдығы:  p(a1)= p(a2)=  1/2. Арна бағандарын құру, Н(А) ақпаратты құру жылдамдығын, ақпаратты беру жылдамдығын табу.',
    answer: `Біріншіден, ақпараттың жасалу жылдамдығын көздің энтропиясы ретінде табамыз: 
    H(A)= -∑_i=1^^2 p(a_i) log p(a_i) = - p(a_1) log p(a_1) + -p(a_2) log p(a_2) = 1
    Жауабы: Ақпараттың жасалу жылдамдығы  H (A)  = 1 , ақпараттың беру жылдамдығы I (A, B) = 1+ p log p + (1- p) log(1- p) , каналдың сенімсіздігі H (A / B) = - p log p - (1- p) log(1- p) . Есептеу кезінде мынаған назар аудару керек H (A / B) ықтималдықтары пайдаланылды p(ai / bj ) матрицасынан, жіберілуі берілген нұсқау бойынша.  Бұл симметриялық арнаның қарапайым жағдайында мүмкін, әйтпесе ықтималдықтар p(ai / bj ) мәндерін есептеу керек болады. p(ai ) и p(bj / ai )
    `,
  },
];
