module.exports = [
  {
    "title": "Руководитель восстания 1916 года в Акмолинске",
    "answer": "С.Сейфулин"
  },
  {
    "title": "Председателем Центрального Шуро (Совета мусульман) Туркестана в апреле 1917 г. был избран",
    "answer": "А.Шокай"
  },
  {
    "title": "В социальном плане, основа устойчивости Казахстана-это",
    "answer": "наличие среднего класса"
  },
  {
    "title": "Каспийское море является морем нити субъектов международных отношений",
    "answer": "России и Казахстана"
  },
  {
    "title": "12 апреля 2017 года Президент Республики Казахстан Н.А. Назарбаев выступил с программной статьёй",
    "answer": "Взгляд в будущее: модернизация общественного сознания"
  },
  {
    "title": "Первый руководитель Туркестанской (Кокандской) автономии",
    "answer": "М.Тынышпаев"
  },
  {
    "title": "Экономические связи Казахской ССР с зарубежными странами осуществлялись",
    "answer": "через республиканские министерства "
  },
  {
    "title": "Экономическое движение которого возглавил О.Сулейменов в конце  80-х гг ХХ в",
    "answer": "”Невада-Семипалатинск”"
  },
  {
    "title": "Казахстан согласно захватническим планам фашистов должен был войти в",
    "answer": "Большой Туркестан"
  },
  {
    "title": "По данным Всесоюзной переписи населения 1989г. общая численность населения Казахстана достигла",
    "answer": "16537 тыс. человек "
  },
  {
    "title": "По планам Казахстан должен был войти в колонию по названием",
    "answer": "«Большой Туркестан»"
  },
  {
    "title": "Ассамблея народа Казахстана была создана в",
    "answer": "марте 1995 г."
  },
  {
    "title": "Строительство Турксиба в Казахстане осуществлялось в",
    "answer": "1927-1930 гг."
  },
  {
    "title": "Слова, облетевшие весь фронт: “Велика Россия, а отступать некуда, позади -Москва”, произнес:",
    "answer": "В.Клочков "
  },
  {
    "title": "В постановлений ВЦИК от 4 ноября 1919 г. Относительно членов Алаш-Орды, принимавших участие в борьбе против Советской власти",
    "answer": "Об амнистии "
  },
  {
    "title": "Всеказахский съезд проходил в городе ",
    "answer": "Оренбург "
  },
  {
    "title": "Амангелды Иманов был сардарбеком в ",
    "answer": "Тургайской области"
  },
  {
    "title": "В освобождении народа Европы, в движений Сопротивления участвовали Герои Советского Союза ",
    "answer": "А.Егоров и З.Хусаинов "
  },
  {
    "title": "В годы ожесточенной, истребительной гражданской войны погибло:",
    "answer": "8 млн. человек."
  },
  {
    "title": "Кого по приказу атамана Б. Анненкова в годы гражданской войны живьем сожгли в кочегарке парохода «Монгол»?",
    "answer": "Я. Ушанова."
  },
  {
    "title": "В августе 1919 года войска Семиреченского фронта пытались оказать помощь Черкасской обороне, при этом погиб командующий фронтом.",
    "answer": "Л.Емелев."
  },
  {
    "title": "Когда в годы гражданской войны была введена продразверстка?",
    "answer": "Январь 1919 г."
  },
  {
    "title": "Когда было принято решение о ликвидации Алаш-Орды, именовавшей себя «правительством Киргизии»?",
    "answer": "9 марта 1920 г."
  },
  {
    "title": "В какие годы Оренбург был первой столицей Каз. АССР и сыграл важную роль в ее развитии?",
    "answer": "1920-1924."
  },
  {
    "title": "Вооруженное выступление против насильственной коллективизации в Казахстане произошло:",
    "answer": "В 1929-1931 гг."
  },
  {
    "title": "Когда началось строительство Туркестано-Сибирской железной дороги, соединившей Сибирь со Средней Азией.",
    "answer": "1927 г."
  },
  {
    "title": "Когда планировалось, по решению партии коммунистов, закончить коллективизацию в Казахстане?",
    "answer": "1932 г."
  },
  {
    "title": "Что разрешила новая экономическая политика?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Кто из правителей джунгар проявлял особую жестокость на казахских землях?",
    "answer": "Цеван-Рабдан."
  },
  {
    "title": "Кто из видных общественных деятелей Казахстана участвовал в проведении земельно-водной реформы?",
    "answer": "А.Асылбеков и Д.Барибаев"
  },
  {
    "title": "какой форме по решению правительства взимается сельскохозяйственный налог с крестьян с 1 января 1924 года?",
    "answer": "Только деньгами"
  },
  {
    "title": "Из какого рода был выходцем батыр Раимбек?",
    "answer": "Албан"
  },
  {
    "title": "В каком году произошла битва в местечке Аяк, результатом которой стал договор о ненападении между казахами и джунгарами?",
    "answer": "В 1750 г"
  },
  {
    "title": "Декретом 1919 года Казревком учреждался как высшая:",
    "answer": "Военно-гражданская власть"
  },
  {
    "title": "В 1985году Генеральным секретарем КПСС стал…",
    "answer": "Горбачев"
  },
  {
    "title": "Какой модели развития будет придерживаться Казахстан в создании высокоразвитого общества, по мнению Президента, высказанного в Послании народу(2030)?",
    "answer": "собственной модели"
  },
  {
    "title": "За период с 1991 по 1995гг.в Республику Казахстан  начали  приезжать на постоянное местожительства казахи из дальнего зарубежья:",
    "answer": "Китай"
  },
  {
    "title": "Фильмы,снятые в годы независимости Республики Казахстан:",
    "answer": "«Кочевник»"
  },
  {
    "title": "Стрелковая дивизия,сформированная в 1941г.в Алма-Ате:",
    "answer": "Участвовала в боях за Сталинград"
  },
  {
    "title": "Лидеры либерально-демократической интеллигенции:",
    "answer": "Байтурсынов"
  },
  {
    "title": "На VII съезде Компартии Казахстана вместо Ж.Шаяхметова первым секретарем ЦК Компартии Казахстана был избран",
    "answer": "Пономаренко П.К."
  },
  {
    "title": "Какое предприятие вошло встрой впервое послевоенное десятилетие?",
    "answer": "Усть – Каменогорский свинцово- цинковый комбинат"
  },
  {
    "title": "Какое количество областей насчитывается в Казахстане на современном этапе?",
    "answer": "14."
  },
  {
    "title": "Назовите период функционирования СССР:",
    "answer": "1922-1991гг."
  },
  {
    "title": "Что представляет собой Послание Президента страны народу Казахстана(2030)?",
    "answer": "Все правильные"
  },
  {
    "title": "Что означает термин «стратегия»?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Ключевые слова Президентав Послании народу(2030).:",
    "answer": "Процветание,безопасность и улучшение благосостояния."
  },
  {
    "title": "В1968 году советские войска были введены на территорию…",
    "answer": "Чехословакии"
  },
  {
    "title": "Единственным источником государственной власти в Казахстане в соответствии с Конституцией Республики Казахстан является:",
    "answer": "Народ"
  },
  {
    "title": "Слабость рабочего движения в Казахстанев годы революции 1905-1907гг.была вызвана",
    "answer": "мало численностью рабочего класса"
  },
  {
    "title": "В Казахстане пост Президента учрежден?",
    "answer": "24 апреля 1990 г."
  },
  {
    "title": "Назовите авторов Герба Республики Казахстан?",
    "answer": "Ж.Малибеков,Ш.Уалиханов."
  },
  {
    "title": "По чьей инициативе был создан комитет по проблемам Балхаша и Арала?",
    "answer": "М.Шаханова"
  },
  {
    "title": "Кто написал книгу «Оян,казак»?",
    "answer": "М.Дулатов"
  },
  {
    "title": "Когда Казахская АССР была преобразована в союзную республику?",
    "answer": "1936г."
  },
  {
    "title": "Лиссабонский протокол предусматривал",
    "answer": "Выход КазССР из состава СССР"
  },
  {
    "title": "Когда в РК был принят новый текст Гимна Республики?",
    "answer": "Декабрь 1992"
  },
  {
    "title": "Газета «Қазақ» издавалась в:",
    "answer": "Оренбурге"
  },
  {
    "title": "Первый Всеказахский съезд состоялся в Оренбурге",
    "answer": "21-28 июля 1917 г."
  },
  {
    "title": "Лидером партии «Үш-жүз» был",
    "answer": "К.Тогусов"
  },
  {
    "title": "Партия «Үш жуз» активно поддерживала",
    "answer": "Большевиков"
  },
  {
    "title": "В первые в Казахстане советская власть установилась в городе",
    "answer": "Перовск"
  },
  {
    "title": "В ходе революции в феврале 1917 г.",
    "answer": "Свергнуто самодержавие"
  },
  {
    "title": "По своему характеру февральская революция 1917 г. Была",
    "answer": "буржуазно-демократической"
  },
  {
    "title": "Первый пункт проекта Программы партии «Алаш» был посвящен",
    "answer": "государственному устройству"
  },
  {
    "title": "В годы гражданской войны большевики проводили политику",
    "answer": "военного коммунизма"
  },
  {
    "title": "В годы индустриализации в Казахстане",
    "answer": "был построен Турксиб"
  },
  {
    "title": "Кому принадлежат слова: «Казахстан был и остался колонией…»?",
    "answer": "Садвакасову "
  },
  {
    "title": "Когда Казахская АССР была преобразована в союзную республику?",
    "answer": "1936 г."
  },
  {
    "title": "В Казахстане  пост Президента учрежден?",
    "answer": "24 апреля 1990 г."
  },
  {
    "title": "Когда была принята ныне действующая Конституция Республики Казахстан?",
    "answer": "30 августа 1995 г."
  },
  {
    "title": "Первый Президент Академии наук Казахской ССР.",
    "answer": "Сатпаев К.И."
  },
  {
    "title": "Когда возникло военно-феодальное государство Чингисхана? ",
    "answer": "В начале 13 в. "
  },
  {
    "title": "При каком хане ислам был объявлен государственной религией в Золотой Орде? ",
    "answer": "При Узбеке. "
  },
  {
    "title": "Как называется государство, основанное Едиге-бием? ",
    "answer": "Ногайская Орда "
  },
  {
    "title": "Когда Тамерлан правил в Средней Азии? ",
    "answer": "1370 -1405 гг. "
  },
  {
    "title": "При каких ханах процветала Золотая Орда? ",
    "answer": "Узбек и Жанибек. "
  },
  {
    "title": "Назовите одного из знаменитых жырау в Дешт-и Кипчаке 15 в. ",
    "answer": "Коркут."
  },
  {
    "title": "С каким государством в 561-563 годах тюрки заключили союз против эфталитов? ",
    "answer": "с Ираном. "
  },
  {
    "title": "Когда  территория Казахстана окончательно вошла в состав империи Чингисхана? ",
    "answer": "1224 г. "
  },
  {
    "title": "Какой казахский музыкант и певец второй половины 19 века подвергся гонениям и притеснениям? ",
    "answer": "Жаяу Муса. "
  },
  {
    "title": "Сколько лет в жестокой борьбе Чингисхан шел к единоличной власти? ",
    "answer": "20 лет. "
  },
  {
    "title": "Какую идею высказали на І Всеказахском съезде   Байтурсынов и М.Дулатов?",
    "answer": "создание независимого автономного Казахстана"
  },
  {
    "title": "Временное правительство было свергнуто в результате победы",
    "answer": "Советов в выборах на Учредительном собрании"
  },
  {
    "title": "Первый Всеказахский съезд 21-28 июля 1917 года прошел в:",
    "answer": "Оренбурге"
  },
  {
    "title": "Местом издания газеты «Қазақ» был выбран",
    "answer": "Оренбург"
  },
  {
    "title": "21 ноября 2018 года Президент Республики Казахстан Н. А. Назарбаев выступил с программной статьей",
    "answer": "Семь граней Великой степи"
  },
  {
    "title": "2 октября 1991 года состоялся",
    "answer": "Полет в космос первого казахстанского космонавта Т. Аубакирова"
  },
  {
    "title": "Причины антисоветских выступлений в Казахстане в начале 20-х годов XX века",
    "answer": " недовольство крестьян проведением хлебной разверстки"
  },
  {
    "title": "Казахстанский писатель-участник партизанского движения в годы Великой Отечественной войны",
    "answer": "К. Кайсенов"
  },
  {
    "title": "Вопрос, который поднимался в сборнике стихов «Пробудись, казах!»",
    "answer": "Критика колониальной политики царской Россий"
  },
  {
    "title": "Земельно-водная реформа в 1921-1922 г.г. проводилась в связи с",
    "answer": "образованием КАССР"
  },
  {
    "title": "Основная суть гитлеровского «Плана Барбаросса», принятого в декабре 1940 года состояло в том, чтобы",
    "answer": "Обеспечить «жизненное пространство» на Востоке за счет уничтожения СССР"
  },
  {
    "title": "Первые выборы президента Республики Казахстана состоялись",
    "answer": "1 декабря 1991 года"
  },
  {
    "title": "На рубеже 2000-х годов вся экономика Казахстана",
    "answer": "имела сырьевую направленность"
  },
  {
    "title": "В Казахстане в конце 20-х годов XX века был введен алфавит",
    "answer": "латиница"
  },
  {
    "title": "Комиссию содействия Турксибу возглавил председатель Совнаркома республики:",
    "answer": "Н.Нурмаков"
  },
  {
    "title": "Общество «Долой неграмотность» в Казахской АССР организовано в:",
    "answer": "апреле 1924 г."
  },
  {
    "title": "Проект «О формировании Евразийского Союза государств» по инициативе Н.Назарбаева был опубликован в печати в июне:",
    "answer": "1994 г."
  },
  {
    "title": "При силовой мобилизации в 1916 году царской администрацией было призвано казахов:",
    "answer": "150 тыс."
  },
  {
    "title": "В январе 1919 года Красная Армия освободила:",
    "answer": "Оренбург и Уральск"
  },
  {
    "title": "Автор сборника «1000 песен киргизского (казахского) народа»:",
    "answer": "Затаевич"
  },
  {
    "title": "26 июля 1917 года в г. Оренбурге состоялся первый всеказахский съезд, в котором участвовали представители почти из всех областей Казахстана. Что он рассматривал?",
    "answer": "Все вышеи зложенное."
  },
  {
    "title": "В 1929 г., накануне коллективизации, поголовье скота в Казахстане достигло:",
    "answer": "40,5 млн. голов"
  },
  {
    "title": "Кто был избран сардарбеком в ходе восстания 1916г.?",
    "answer": "А.Иманов"
  },
  {
    "title": "Местом пребывания Алаш-Орды временно был избран город:",
    "answer": "Семипалатинск."
  },
  {
    "title": "В 1920-1924 гг. столицей Каз. АССР был город:",
    "answer": "Оренбург."
  },
  {
    "title": "По чьей инициативе был создан комитет по проблемам Балхаша и Арала?",
    "answer": "М. Шаханова"
  },
  {
    "title": "Кому из казахских батыров по народным рассказам посвятил свой первый кюй «Кишкентай» классик казахской инструментальной музыки Курмангазы?",
    "answer": "Исатаю"
  },
  {
    "title": "Кто является автором сборника произведений «Маса» (Комар), опубликованного в 1911 году в Оренбурге?",
    "answer": "Байтурсынов"
  },
  {
    "title": "Кто был наиболее талантливым учеником великого Абая?",
    "answer": "Ш. Кудайбердыев"
  },
  {
    "title": "Кто написал книгу «Оян, казак»? ",
    "answer": "М. Дулатов"
  },
  {
    "title": "Когда и в каком городе состоялся первый Всеказахский съезд, в котором участвовали представители почти всех областей Казахстана?",
    "answer": "в г. Оренбурге 21-26 июля 1917 г."
  },
  {
    "title": "Когда была создана партия Алаш? ",
    "answer": "1917 г."
  },
  {
    "title": "Какую роль отводил Казахстану Ф. И. Голощекин в ходе индустриализации? ",
    "answer": "сырьевая база центральной промышленности"
  },
  {
    "title": "Какие народы насильственно были переселены в Казахстан в феврале 1944 г.? ",
    "answer": "все перечисленные"
  },
  {
    "title": "Что послужило поводом для декабрьских событий в Алматы? ",
    "answer": "назначение Г. Колбина первым секретарем ЦК"
  },
  {
    "title": "Что означает термин \"стратегия\"?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Назовите ведущий фактор сильных сторон, которыми обладает современный Казахстан (по мнению Президента, высказанному в Послании народу).",
    "answer": "Люди, их воля и знания."
  },
  {
    "title": "В соответствии с постановлением Совета Министров СССР в 1948 году был сооружен ядерный полигон, расположенный на стыке трех областей…",
    "answer": "Семипалатинской, Акмолинской и Карагандинской."
  },
  {
    "title": "Когда была создана Казахская АССР? ",
    "answer": "1920 г."
  },
  {
    "title": "Назовите общественного деятеля, ученого - энциклопедиста, одного из лидеров алашского движения, врача, одного из руководителей Уйильского Оляята:",
    "answer": "Досмухамедов Халел"
  },
  {
    "title": "Кто был автором кюев «Сары - Арка», «Кишкентай?",
    "answer": "Курмангазы"
  },
  {
    "title": "Каков был характер восстания 1916 г.?",
    "answer": "национально-освободительный"
  },
  {
    "title": "Кто был редактором газеты «Казах»?",
    "answer": "А. Байтурсынов"
  },
  {
    "title": "Какая организация была создана Тураром Рыскуловым в городе Мерке?",
    "answer": "Революционный союз казахской молодежи"
  },
  {
    "title": "В каком году было создано правительство «Алаш – орда»? ",
    "answer": "в 1917 г."
  },
  {
    "title": "В Целинограде (Астана) казахская молодежь выступила против создания немецкой автономии в: ",
    "answer": "1979 г."
  },
  {
    "title": "В 1968 году советские войска были введены на территорию…",
    "answer": "Чехословакии"
  },
  {
    "title": "В 1985 году Генеральным секретарем КПСС стал…",
    "answer": "Горбачев"
  },
  {
    "title": "Когда был принята первая Конституция независимого Казахстана?",
    "answer": "28 января 1993 г."
  },
  {
    "title": "Когда было проведено первое ядерное испытание на Семипалатинском полигоне?",
    "answer": "1949 г."
  },
  {
    "title": "Какая форма правления действует в Республике Казахстан согласно действующей Конституции РК?",
    "answer": "Президентская"
  },
  {
    "title": "Каким государством по форме государственного устройства является Казахстан согласно Конституции РК?",
    "answer": "унитарным"
  },
  {
    "title": "Когда состоялась торжественная презентация новой столицы Казахстана-Астаны?",
    "answer": " в июне 1998 года"
  },
  {
    "title": "Когда было произведено первое испытание ядерной бомбы на Семипалатинском полигоне?",
    "answer": "29 августа 1949 г."
  },
  {
    "title": "В каком году произошли трагические события в городе Темиртау? ",
    "answer": "1959 г."
  },
  {
    "title": "Выделите основополагающие принципы деятельности РК согласно Конституции?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Укажите, кто из руководителей восстаний был ближе к народу, демократичнее",
    "answer": "Исатай Тайманулы, поддержанный крестьянами, установил реальную власть в Прикаспийском регионе"
  },
  {
    "title": "Начало массового освоения целинных и залежных земель в Казахстане. ",
    "answer": "1954 г."
  },
  {
    "title": "За период с 1991 по 1995 гг. в Республику Казахстан начали приезжать, а постоянное место жительства казахи из дальнего зарубежья:",
    "answer": "Китай"
  },
  {
    "title": "Главные направления государственной программы индустриально-инновационного развития на 2003-2015 годы:",
    "answer": "Образование и наука"
  },
  {
    "title": "Военным губернатором Семиреченской области в период восстания 1916 г. был:",
    "answer": "Фольбаум"
  },
  {
    "title": "Особо востребованные специальности в 30-х годах ХХ в.:",
    "answer": "Механизаторы"
  },
  {
    "title": "Фильмы, снятые в годы независимости Республики Казахстан:",
    "answer": "«Кочевник»"
  },
  {
    "title": "авиационный, московский институт цветных металлов, объединившись с Украинским государственным университетом вели значительную работу по:",
    "answer": "Подготовке квалифицированных кадров"
  },
  {
    "title": "В самом начале Великой Отечественной войны была создана Комиссия Академии наук СССР по мобилизации ресурсов следующих регионов Советского Союза:",
    "answer": "Урал"
  },
  {
    "title": "Стрелковая дивизия, сформированная в 1941 г. в Алма-Ате:",
    "answer": "Участвовала в боях за Сталинград"
  },
  {
    "title": "На начальном этапе в 2010-х гг. велась основная экономическая работа в рамках программ, выступивших локомотивами казахстанской экономики:",
    "answer": "первой (2010–2014 годы) индустриально- инновационной пятилетки"
  },
  {
    "title": "В эти годы проходили Всемирные курултаи казахов:",
    "answer": "2002"
  },
  {
    "title": "Лидеры либерально-демократической интеллигенции:",
    "answer": "Байтурсынов"
  },
  {
    "title": "Амангелды Иманов:",
    "answer": "Внук знаменитого батыра Имана"
  },
  {
    "title": "Газета «Қазақ» издавалась в:",
    "answer": "Оренбурге"
  },
  {
    "title": "Во время Великой Отечественной войны Казахстан давал:",
    "answer": "1/8 общесоюзной добычи угля"
  },
  {
    "title": "Приоритетные направления развития экономики и социальной сферы согласно Посланию Президента Республики Казахстан Н.А. Назарбаева народу Казахстана. 1 марта 2006 г. «Стратегия вхождения Казахстана в число 50-ти наиболее конкурентоспособных стран мира. Казахстан на пороге нового рывка вперед в своем развитии»:",
    "answer": "Современная социальная политика, защищающая наиболее «уязвимые» слои населения и поддерживающая развитие экономики "
  },
  {
    "title": "Когда были утверждены новый флаг и герб Республики Казахстан?",
    "answer": "4 июня 1992 г."
  },
  {
    "title": "Когда в Республике Казахстан была введена национальная валюта – тенге?",
    "answer": "15 ноября 1993 г."
  },
  {
    "title": "Кто является символом и гарантом единства народа и государственной власти, незыблемости Конституции в РК?",
    "answer": "Президент."
  },
  {
    "title": "Выберите черты, которыми будет владеть новое поколение через 33 года по убеждению Президента, высказанному в Послании народу (2030)",
    "answer": "все перечисленное"
  },
  {
    "title": "В начале ХХ века бесспорным лидером национальной интеллигенции казахского народа стал",
    "answer": "Алихан Бокейханов"
  },
  {
    "title": "Летом 1905 г. первый опыт политических требовании в Казахстане берет начало с",
    "answer": "Каркаралинской питиции"
  },
  {
    "title": "Редактором журнала «Айкап» был",
    "answer": "Мухамеджан Сералин"
  },
  {
    "title": "Печатным органом партии «Алаш» являлась газета",
    "answer": "Қазақ"
  },
  {
    "title": "Лидером партии «Үш-жүз» был",
    "answer": "К.Тогусов"
  },
  {
    "title": "Партия «Үш жуз» активно потдерживало",
    "answer": "Большевиков"
  },
  {
    "title": "Правильная последовательность переноса столиц в Казахстане выглядит так",
    "answer": "Оренбург – Кызыл-Орда – Алматы"
  },
  {
    "title": "Какое количество областей насчитывается в Казахстане на современном этапе? ",
    "answer": "14."
  },
  {
    "title": "Ключевые слова Президента в Послании народу (2030).:",
    "answer": "Процветание, безопасность и улучшение благосостояния."
  },
  {
    "title": "Единственным источником государственной власти в Казахстане в соответствии с Конституцией Республики Казахстан является:",
    "answer": "Народ"
  },
  {
    "title": "Идея создания «строя цивилизованных кооператоров» относится к периоду:",
    "answer": "Коллективизации сельского хозяйства"
  },
  {
    "title": "Когда началось освоение целинных и залежных земель в Казахстане? ",
    "answer": "1954"
  },
  {
    "title": "7 основных долгосрочных приоритетов определены Президентом в стратегии: ",
    "answer": "«Казахстан-2030»"
  },
  {
    "title": "Казахстан 2030 года: ",
    "answer": "Пройдет сложный путь и вступит в следующий этап развития."
  },
  {
    "title": "Кто, по мнению Президента, высказанному в Послании народу (2030), является ведущей опорой и стабилизирующим фактором нашего государства на современном этапе? ",
    "answer": "средний класс"
  },
  {
    "title": "Какой внешний фактор, способствующий дальнейшему развитию Казахстана, подчеркивает Президент в Послании народу (2030)? ",
    "answer": "выгодное географическое положение"
  },
  {
    "title": "Джадидизм-это...",
    "answer": "новометодные школы"
  },
  {
    "title": "В 1900 г. первая школа образованная по методу И.Гаспринского была открыта в:",
    "answer": "Туркестане "
  },
  {
    "title": "Сколько рабочих в среднем насчитывались в самых крупных предприятиях?",
    "answer": "300-400 чел."
  },
  {
    "title": "Сколько земель было отобрано у казахов в 1906-1907 гг.  ",
    "answer": "17 млн. десятин "
  },
  {
    "title": "Кто является автором реформы царского правительства в начале XX в.?",
    "answer": "Столыпин"
  },
  {
    "title": "Сколько человек переселилось в Казахстан по аграрной реформе Столыпина в 1907- 1912 гг.?",
    "answer": "2 млн. 400 тыс."
  },
  {
    "title": "Главная предпосылка  революционных выступлений трудящихся Казахстана 1905-1907 г.г.?",
    "answer": "Колониальная аграрная политика царизма  "
  },
  {
    "title": "Организатор антиправительственного митинга в Каркаралинске в мае 1905 г.? ",
    "answer": "Миржакуп Дулатов  "
  },
  {
    "title": "Как восприняли казахская национально-демократическая интеллигенция царский манифест 17 октября 1905 года?",
    "answer": "Подвергли критике основные положения манифеста "
  },
  {
    "title": "Для усмирения какой политической забастовки в городе Семипалатинске губернатор области Галкин вызвал военную колонну из Каркаралинска?",
    "answer": "Забастовки почтово-телеграфных служащих"
  },
  {
    "title": "21 ноября 1905 года выразили протест против антинародных действий царских властей солдаты гарнизона города:",
    "answer": "Жаркента  "
  },
  {
    "title": "Когда министр внутренних дел Дурнов применил силу для подавления крестьянских волнений в Казахстане? ",
    "answer": "10 января   1906 г. "
  },
  {
    "title": "Депутат 2-ой Государственной Думы от «туземной» части населения Семиречья.",
    "answer": "М.Тынышпаев "
  },
  {
    "title": "Депутат 2-ой Государственной Думы от «туземной» части населения Тургайской  области: ",
    "answer": "А.Беремжанов"
  },
  {
    "title": "Депутат Государственной Думы от Семипалатинской области, отказавшийся от предвыборных обещаний.",
    "answer": "Н.Коншин"
  },
  {
    "title": "Депутат 2-ой Государственной Думы от коренных жителей Акмолинской области?",
    "answer": "Ш.Косшыгулов"
  },
  {
    "title": "Когда начался период нового подъема демократического движения в Казахстане? ",
    "answer": "В 1912 г. "
  },
  {
    "title": "Годы 1-ой мировой войны",
    "answer": "1914-18 гг. "
  },
  {
    "title": "Повседневная средняя заработная плата в Казахстане в годы Первой Мировой войны составляла:",
    "answer": "20 копеек "
  },
  {
    "title": "Какое событие усилило значение российских сырьевых колоний, в том числе и Казахстана в 1915-1918 гг.?",
    "answer": "Первая мировая война   "
  },
  {
    "title": "В какой области Казахстана разместили 22 тыс. военнопленных в годы 1-ой мировой войны",
    "answer": "Акмолинской"
  },
  {
    "title": "Какую позицию заняло мусульманское духовенство Казахстана в отношении к Указу царя от 25 июня 1916 года? ",
    "answer": "Освободить от набора в армию мусульманское духовенство  "
  },
  {
    "title": "В какие годы Ахмет Байтурсынов - лидер национально-демократической интеллигенции, проживал в г. Оренбурге. ",
    "answer": "1910-1917 гг.  "
  },
  {
    "title": "В каком году в городах Казахстана прошли волнения, названные «бунтом солдаток»? ",
    "answer": "Осень 1916 г. "
  },
  {
    "title": "Название лагеря для военнопленных в годы Первой мировой войны, между Челябинском и Костанаем?",
    "answer": "«Лагерь мертвецов» "
  },
  {
    "title": "Когда впервые были изданы книги Ш. Кудайбердиева и А.Байтурсынова?",
    "answer": "В годы революции 1905-1907 гг. "
  },
  {
    "title": "Труд Ш.Қудайбердыулы, изданное в начале ХХ в.:",
    "answer": "«Условия мусульманства»"
  },
  {
    "title": "Редактор газеты «Казах» в 1913-1917 гг.",
    "answer": "А.Байтурсынов"
  },
  {
    "title": "Произведение М.Дулатова, опубликованное в 1915 г.",
    "answer": "«Терме»"
  },
  {
    "title": "Автор сборника произведений «Маса» (Комар), опубликованного в 1911 году в Оренбурге? ",
    "answer": "А.Байтурсынов"
  },
  {
    "title": "Кто был наиболее талантливым учеником великого Абая? ",
    "answer": "Ш. Кудайбердыев "
  },
  {
    "title": "Какой журнал пропагандировал идеи просвещения и образования среди казахов?",
    "answer": "«Айкап»"
  },
  {
    "title": "Главный редактор журнала «Айкап»:",
    "answer": "Сералин М."
  },
  {
    "title": "Автор романа «Несчастная Жамал», . изданный в 1910 г. ",
    "answer": "Дулатов М."
  },
  {
    "title": "Кто написал книгу «Оян, казак»? ",
    "answer": "М.Дулатов "
  },
  {
    "title": "Главная причина национально - освободительной войны 1916 года?",
    "answer": "Усиление колониальной политики царизма "
  },
  {
    "title": "Сколько джигитов планировалось мобилизовать из Туркестана и степного края?",
    "answer": "500. 000"
  },
  {
    "title": "Набору на тыловые  по царскому Указу подлежало все трудоспособное население в возрасте до ... лет:",
    "answer": "19-43 "
  },
  {
    "title": "Численность повстанческих отрядов в Тургайском очаге восстания 1916 г.",
    "answer": "50 тыс. чел. "
  },
  {
    "title": "Какое количество казахов и киргизов в 1916 г. преследуемых царскими властями, вынуждены были бежать из Семиречья в Китай? ",
    "answer": "300 тыс. человек "
  },
  {
    "title": "В каком печатном органе была опубликована программа партии «Алаш»? ",
    "answer": "Газета «Казах»"
  },
  {
    "title": "Какая часть интеллигенции примкнула к восстанию 1916 года?",
    "answer": "Революционно-демократическая  "
  },
  {
    "title": "Кто был избран сардарбеком в ходе восстания 1916 г.?",
    "answer": "А.Иманов "
  },
  {
    "title": "В какой области Т.Бокин был руководителем  восстания",
    "answer": "Семиречье "
  },
  {
    "title": "Кто был военным губернатором Семиречья в ходе восстания 1916 года в Казахстане?",
    "answer": "Фольбаум"
  },
  {
    "title": "Кто автор слов: «Само существование казахской нации стало острой проблемой»?",
    "answer": "Ахмет Байтурсынов"
  },
  {
    "title": "Кто был избран ханом в Тургайской области в ходе восстания 1916 года?",
    "answer": "Адулгафар Джанбосынов "
  },
  {
    "title": "Кто на заседании 4 Государственной Думы подверг резкой критике царское подавление восстания 1916 года?",
    "answer": "Керенский "
  },
  {
    "title": "Руководитель восстания 1916 года в Семиречье, повешенный карателями на сопке Бурундай?",
    "answer": "Б.Ашекеев "
  },
  {
    "title": "В каком произведении писателя Сабита Муканова нашло отражение восстание 1916 года? ",
    "answer": "«Ботагоз»  "
  },
  {
    "title": "Назовите произведение М.Ауезова о восстании 1916 г.?",
    "answer": "Килы заман"
  },
  {
    "title": "Сколько подписчиков имела газета «Казах» к началу 1917 г.?",
    "answer": "8.000 чел."
  },
  {
    "title": "Какой был состав правительств в период Двоевластия?",
    "answer": "Временное правительство и советы рабочих и солдатских депутатов "
  },
  {
    "title": "Кто возглавил Временное правительство в России",
    "answer": "Керенский "
  },
  {
    "title": "Назовите комиссаров Временного правительства",
    "answer": "А. Бокейханов, М.Тынышпаев "
  },
  {
    "title": "Кто из казахов являлся членом ЦК российской кадетской партии",
    "answer": "А. Бокейханов"
  },
  {
    "title": "Кто был избран председателем Центрального Шуро (Совета мусульман) Туркестана в апреле 1917 года? ",
    "answer": "М. Шокай "
  },
  {
    "title": "Кто являлся лидером партии «Шуро - и- улема»",
    "answer": "Серали Лапин"
  },
  {
    "title": "Кто был лидером  партии Уш-Жуз?",
    "answer": "К. Тогусов"
  },
  {
    "title": "Год рождения Алихана Бокейханова",
    "answer": "1866 г. 5 марта "
  },
  {
    "title": "Когда была создана партия «Иттифок-и-муслимин», выдвинувшая идею территориальной автономии? ",
    "answer": "1917 г. "
  },
  {
    "title": "Лозунг партии эсеров,обеспечивший успех в Советах Туркестанского края к лету 1917 года?",
    "answer": "« Землю надо передать тем, кто ее обрабатывает» "
  },
  {
    "title": "Когда Советами рабочих депутатов в Петропавловске, Уральске, Семипалатинске был введен 8-ми часовой рабочий день? ",
    "answer": "летом 1917 года "
  },
  {
    "title": "Назовите одного из лидеров алашского движения, врача, одного из руководителей Уильского Оляята: ",
    "answer": "Досмухамедов Халел  "
  },
  {
    "title": "Где и когда проходил I Всеказахский съезд?",
    "answer": "21- 26 июля 1917 г в г. Оренбурге"
  },
  {
    "title": "Когда проходил I Всероссийский съезд мусульман?",
    "answer": "май 1917 г."
  },
  {
    "title": "Сторонник автономии Туркестана под эгидой России, написавший ряд трудов с критикой сталинизма и Советской системы? ",
    "answer": "Мустафа Шокай  "
  },
  {
    "title": "Области Казахстана, вошедшие в состав Туркестанской Автономии в ноябре 1917 года. ",
    "answer": "Сырдарьинская и Семиреченская  "
  },
  {
    "title": "Автономия, официально провозгласившая ислам государственной религией?",
    "answer": "Туркестанская (Кокандская) Автономия "
  },
  {
    "title": "Когда по решению Ташкентского Совета был взят штурмом и разрушен город Коканд?",
    "answer": "В феврале 1918 г."
  },
  {
    "title": "Кто возглавил Туркестанскую (Кокандсткую) Автономию после ухода М.Тынышпаева в отставку.",
    "answer": "М.Шокай "
  },
  {
    "title": "В какой стране жил М.Шокай в годы  эмиграции",
    "answer": "Франция"
  },
  {
    "title": "Сколько мест предоставлялось в Народном Совете «Алашорда» русским, живущим среди казахов?",
    "answer": "15 мест"
  },
  {
    "title": "Что показали выборы, прошедшие в Казахстане в ноябре 1917 - январе 1918 года в Учредительное собрание? ",
    "answer": "Абсолютное большинство казахских трудящихся поддерживают партию Алаш"
  },
  {
    "title": "Когда власть Советов была установлена в Ташкенте? ",
    "answer": "1 ноября      1917 г. "
  },
  {
    "title": "За сколько месяцев была установлена советской власти в Казахстане?",
    "answer": "4 месяца"
  },
  {
    "title": "В каком городе Казахстана 8 января 1918 года власть перешла в руки Советов? ",
    "answer": "В Актюбинске  "
  },
  {
    "title": "Где Советская власть была установлена в ночь со 2 на 3 марта 1918 года ? ",
    "answer": "В Верном  "
  },
  {
    "title": "Декрет , подписанный Лениным, о национализации  крупных промышленных предприятий в Казахстане? ",
    "answer": "Весной 1918 года  "
  },
  {
    "title": "Кто возглавил Акмолинский отдел народного образования после Октябрьского переворота? ",
    "answer": "С. Сейфуллин"
  },
  {
    "title": "Завод в Казахстане, дававший 40 % общесоюзной добычи свинца, был сдан в эксплуатацию к 1923 году? ",
    "answer": "Риддерский "
  },
  {
    "title": "Документ правительства, усиливший значение товарообмена и товарооборота в годы НЭПа? ",
    "answer": "Декрет «Об обмене» от 24 мая 1921 года "
  },
  {
    "title": "Кто из лидеров Алаш - Орды в марте 1920 года возглавил переход на сторону советской власти со своими сторонниками?",
    "answer": "А. Байтырсунов  "
  },
  {
    "title": "Деятель, не участвовавший в установлении Советской власти в Семиречье: ",
    "answer": "С. Сейфуллин "
  },
  {
    "title": "В мае 1920 года  Комитет Труда и Обороны РСФСР  призвал в армию среди нерусских национальностей  в возрасте от 19 до 35 лет в количестве: ",
    "answer": "25. 000 трудящихся "
  },
  {
    "title": "Кто возглавлял экспедицию, доставившую оружие Актюбинскому фронту в годы Гражданской войны? ",
    "answer": "Алиби Джангильдин"
  },
  {
    "title": "В годы гражданской войны погибло:",
    "answer": "8 млн. человек "
  },
  {
    "title": "Когда в годы гражданской войны была введена продразверстка?",
    "answer": "1919 г."
  },
  {
    "title": "Какая железнодорожная линия должна была соединить Урало-Эмбенский нефтяной регион с Центральной Россией?",
    "answer": "Александров Гай - Эмбa "
  },
  {
    "title": "Когда было принято решение о ликвидации правительства Алашорды? ",
    "answer": "1920 г. "
  },
  {
    "title": "Какую должность в правительстве Каз.АССР занимал В. Радус-Зенькович? ",
    "answer": "Председатель СНК "
  },
  {
    "title": "Посредник между А.Байтурсыновым и А.Джангильдиным о переходе алашординцев на сторону Советской власти? ",
    "answer": "Алманов Балмен "
  },
  {
    "title": "Когда губком принимает решение о включении Оренбурга в состав Казахстана?",
    "answer": "1919 г.  "
  },
  {
    "title": "В какие годы Оренбург был первой столицей Каз. АССР?",
    "answer": "1920-1924 "
  },
  {
    "title": "Кто предложил преобразовать ТАССР в «Тюркскую республику»",
    "answer": "Рыскулов  "
  },
  {
    "title": "Кто из казахов был послом (постпредом) СССР в Королевстве Хиджаз (Саудовская Аравия) в 30-ые годы.",
    "answer": "Назир Торекулов  "
  },
  {
    "title": "Кто был первым редактором газеты «Ак жол», органа коммунистов ТАССР.",
    "answer": "Султанбек Кожанов "
  },
  {
    "title": "Где находился Казахский институт просвещения (Казинпрос, Казпедвуз) в 1920-28 гг.",
    "answer": "В Ташкенте  "
  },
  {
    "title": "Когда началось строительство Туркестано-Сибирской железной дороги.",
    "answer": "1927 г. "
  },
  {
    "title": "Постановлением от 4 августа 1922 года Казахской АССР  выделено 25 млн. рублей. ",
    "answer": "Для закупки сельхозмашин и орудий"
  },
  {
    "title": "Сколько земель было возвращено коренному населению Семиречья в ходе земельно-водной реформы 1921г.",
    "answer": "460 тыс.десятин   "
  },
  {
    "title": "В годы НЭПа посевная площадь в республике в 1928 году достигла уровня...",
    "answer": "4,4  млн. га. "
  },
  {
    "title": "В каком году V Всеказахстанский съезд Советов постановил: для восстановления верного имени народа «впредь именовать киргиз - казахами»?",
    "answer": "В 1925 г."
  },
  {
    "title": "Когда постановлением ЦИК КазАССР принято точное наименование: казахи, Казахстан? ",
    "answer": "1936 г."
  },
  {
    "title": "Укажите годы жизни комсомольского организатора в Казахстане и Туркестане Гани Муратбаева",
    "answer": "1902-1924 гг.  "
  },
  {
    "title": "Кто возглавил комплексную экспедицию в казахскую степь «Кызыл керуен» («Красный караван»)? ",
    "answer": "Алиби Джангильдин "
  },
  {
    "title": "Декрет ЦИК Казахстана «О введении делопроизводства на киргизском (казахском) языке? ",
    "answer": "В ноябре 1923 г. "
  },
  {
    "title": "Декрет СНК Казахской АССР «О порядке употребления киргизского (казахского) и русского языков»? ",
    "answer": "В январе 1921 г. "
  },
  {
    "title": "Укажите годы первой пятилетки: ",
    "answer": "1928-1932 гг. "
  },
  {
    "title": "В какие годы первым секретарем Казкрайкома партии был Ф.И.Голощекин? ",
    "answer": "1925-1933 гг.  "
  },
  {
    "title": "Первый секретарь Казкрайкома партии,  выдвинул идею «Малого Октября». ",
    "answer": "Ф.Голощекин  "
  },
  {
    "title": "Кому принадлежат слова: «Товарищ Голощекин! Я думаю, что политика, намеченная в настоящей записке, является единственно правильной...»? ",
    "answer": "И.В. Сталину  "
  },
  {
    "title": "Кто выступил против курса «Малого Октября»? ",
    "answer": "С.Садвакасов и Ж.Мынбаев "
  },
  {
    "title": "Какую идею отстаивала оппозиция курсу «Малого Октября»?",
    "answer": "Приближение промышленности к источникам сырья  "
  },
  {
    "title": "Что изучала экспедиция академика И.М.Губкина накануне индустриализации? ",
    "answer": "Урало-Эмбенский район  "
  },
  {
    "title": "Количество трудящихся на строительстве Турксиба?",
    "answer": "100 тысяч "
  },
  {
    "title": "Железная дорога Турксиб соединила... ",
    "answer": "Среднюю Азию с Сибирью"
  },
  {
    "title": "Строитель, прошедший путь от рядового строителя до начальника Турксиба? ",
    "answer": "Д.Омаров  "
  },
  {
    "title": "В годы индустриализации в Казахстане была создана нефтяная база, названная «вторым Баку».  ",
    "answer": "Нефтяная Эмба "
  },
  {
    "title": "Количество поголовья скота, насчитывавшегося в республике к 1929 году? ",
    "answer": "40,5 млн. голов "
  },
  {
    "title": "Когда предлагалось завершить процесс оседания кочевых хозяйств в Казахстане? ",
    "answer": "К 1933 году"
  },
  {
    "title": "Вооруженное выступление против насильственной коллективизации в Казахстане произошло: ",
    "answer": "В 1929-1931 гг.  "
  },
  {
    "title": "Кому принадлежит девиз: «Перегибов не допускать - парнокопытных не оставлять!»? ",
    "answer": "Тургайским  перегибщикам "
  },
  {
    "title": "Сколько крестьян было привлечено к ответственности в годы коллективизации? ",
    "answer": "Более 56 тысяч"
  },
  {
    "title": "Кому было адресовано «Письмо пяти»,  написанная деятелями республики в  1932 г.? ",
    "answer": "Ф. Голощекину "
  },
  {
    "title": "Кто писал Сталину о масштабах катастрофы, возникшей в результате коллективизации? ",
    "answer": "Т. Рыскулов  "
  },
  {
    "title": "1931-33 гг. в республике из 6,2 млн. населения умерли от голода:",
    "answer": "2,1 млн."
  },
  {
    "title": "1931-33 гг. кроме казахов умерли от голода другие представители наций",
    "answer": "0,4 млн."
  },
  {
    "title": "В результате коллективизации на первое января 1933 года республика насчитывала всего голов скота: ",
    "answer": "4,5 млн. "
  },
  {
    "title": "Основной формой в животноводческих районах в годы коллективизации должно стать: ",
    "answer": "Товарищество по совместной обработке земли и косьбе  "
  },
  {
    "title": "Когда в Казахстане создаются первые машинно-тракторные станции (МТС)?",
    "answer": "В 1929 г."
  },
  {
    "title": "Мятежный район, численностью восставших 5000 человек, недовольные политикой коллективизации ",
    "answer": "Каракумы "
  },
  {
    "title": "Назовите одного из руководителей восстания крестьян в Созакском районе: ",
    "answer": "Джакупов "
  },
  {
    "title": "Кто рассматривал уголовные дела «банд восстаний» против коллективизации в Казахстана? ",
    "answer": "Внесудебный орган - «тройка»  "
  },
  {
    "title": "Количество восстаний и массовых волнений в Казахстане в годы коллективизации?",
    "answer": "372 "
  },
  {
    "title": "Кто был обвинен в «заговоре» строителей «Красной столицы» (Кзыл-Орда, 1928 г)?",
    "answer": "П.Буддаси, С.Голдгор, М.Тынышпаев"
  },
  {
    "title": "Когда в Казахстане началось массовое движение женщин за овладение мужскими профессиями?",
    "answer": "В 1940 г. "
  },
  {
    "title": "Какое место в СССР по производству свинца занимал Казахстан накануне ВОВ?",
    "answer": "Первое "
  },
  {
    "title": "Какой канал был построен в Западном Казахстане в 40-е годы XX века? ",
    "answer": "Урало-Кушумский  "
  },
  {
    "title": "Когда вводят всеобщее обязательное обучение населения в возрасте от 15 до 50 лет? ",
    "answer": "В 1931 г. "
  },
  {
    "title": "Назовите города сплошной грамотности в Казахстане в 1939 г.?",
    "answer": "Аулие-Ата, Чимкент, Риддер "
  },
  {
    "title": "Автор иллюстрированного букваря, вышедшего в 20-х гг.",
    "answer": "А.Байтурсынов  "
  },
  {
    "title": "Автор первого учебника географии на казахском языке",
    "answer": "А.Бокейханов  "
  },
  {
    "title": "Автор  первого учебника алгебры на казахском языке",
    "answer": "К.Сатпаев "
  },
  {
    "title": "Первый вуз открытый в Алматы",
    "answer": "Казахский педагогический институт "
  },
  {
    "title": "В каком году в Алма-Ате открылся медицинский институт? ",
    "answer": "В 1931 г. "
  },
  {
    "title": "Какое количество средних специальных заведений действовало в Казахстане накануне Великой Отечественной войны?",
    "answer": "118 "
  },
  {
    "title": "Автор учебника «История Казахстана с древнейших времен»  1935 г.",
    "answer": "С.Асфендияров  "
  },
  {
    "title": "Первый казахский художественный фильм, снятый в киностудии «Ленфильм»?",
    "answer": "«Амангельды»"
  },
  {
    "title": "Первый Казахский национальны театр?",
    "answer": "В 1926 г. – Кызыл-Орда"
  },
  {
    "title": "Первый режиссер казахского национального театра?",
    "answer": "Ж.Шанин  "
  },
  {
    "title": "Первая пьеса, поставленная Казахским национальным театром?",
    "answer": "«Енлик-Кебек»"
  },
  {
    "title": "Казахский поэт, переводивший произведения Гете, Гейне, Горького?",
    "answer": "М.Жумабаев  "
  },
  {
    "title": "Количество ВУЗов действовало в Казахстане накануне ВОВ?",
    "answer": "20  "
  },
  {
    "title": "Два сектора действовавшие в составе Казахстанской базы Академии Наук СССР в 1932 г.? ",
    "answer": "Зоологический и ботанический"
  },
  {
    "title": "Археолог, производивший раскопки в Аулие-Ате в 1926 году, на месте древнего города Тараз? ",
    "answer": "Массон "
  },
  {
    "title": "Деятель,  решением ОГПУ осудившего к расстрелу, с заменой на 10 лет заключения в Соловецком лагере? ",
    "answer": "М.Дулатов"
  },
  {
    "title": "В 1938 году из Дальнего Востока были депортированы:",
    "answer": "корейцы"
  },
  {
    "title": "В 1938 году из Дальнего Востока было депортировано:",
    "answer": "100. 000 человек"
  },
  {
    "title": "Кто  автор стихотворения «Марсельеза казахской молодежи».? ",
    "answer": "С. Сейфуллин  "
  },
  {
    "title": "Назовите произведение Исы Байзакова? ",
    "answer": "«Куралай Сулу»   "
  },
  {
    "title": "Волнующие песни и поэмы создали накануне Великой Отечественной войны казахские акыны:",
    "answer": "Н. Байганин, И. Байзаков "
  },
  {
    "title": "Кто из казахской дореволюционной интеллигенции проявил себя искусным переводчиком? ",
    "answer": "А. Байтурсынов "
  },
  {
    "title": "Почему А. В. Затаевича в 20-е-30-е годы XX века называли «искателем жемчуга»? ",
    "answer": "Собирал песни и кюи народа "
  },
  {
    "title": "Автор труда «1000 казахских песен» ?",
    "answer": "А. Затаевич   "
  },
  {
    "title": "Когда в Алма - Ате был организован первый уйгурский музыкально-драматический театр?",
    "answer": "В 1933 г. "
  },
  {
    "title": "Музыкальная драма, имевшая успех на сцене корейского театра в 1937 году в Кызыл - Орде? ",
    "answer": "«Чупхин-дон»   "
  },
  {
    "title": "Когда был открыт Казахский Государственный музыкальный театр оперы и балета? ",
    "answer": "В 1934 г. "
  },
  {
    "title": "Спектакль на сцене Казахского театра оперы и балета  в 1934 г. был показан более 100 раз?",
    "answer": "«Айман-Шолпан»    "
  },
  {
    "title": "Композитор, возглавивший в 1934 году Казахский государственный оркестр имени Курмангазы? ",
    "answer": "А.Жубанов "
  },
  {
    "title": "Когда проходила декада казахского искусства  в Москве? ",
    "answer": "В 1938 году "
  },
  {
    "title": "Произведение  переложенное Е.Брусиловским на музыку (опера) и поставленное на декаде казахского искусства в 1938 году в Москве? ",
    "answer": "«Кыз-Жибек»   "
  },
  {
    "title": "Когда было открыта Казахская Государственная филармония имени Жамбыла? ",
    "answer": "В 1936 г. "
  },
  {
    "title": "Когда началась Вторая Мировая война? ",
    "answer": "1939 г.  "
  },
  {
    "title": "Когда началась Великая Отечественная война? ",
    "answer": "1941 г.  "
  },
  {
    "title": "Когда закончилась Вторая Мировая война? ",
    "answer": "2 сентября 1945 г.  "
  },
  {
    "title": "Сколько казахстанцев были среди удостоенных звания Герой Советского Союза. ? ",
    "answer": "497 человек "
  },
  {
    "title": "Герой Советского Союза Нуркен Абдиров был: ",
    "answer": "Летчиком  "
  },
  {
    "title": "В рядах Красной Армии сражалось в годы Второй Мировой войны казахстанцев: ",
    "answer": "1 млн. 200 тыс.  "
  },
  {
    "title": "Какой из перечисленных фильмов в годы войны был снят в Алма-Ате?",
    "answer": "«Два бойца» "
  },
  {
    "title": "Трижды Герой Советского Союза? ",
    "answer": "И. Кожедуб  "
  },
  {
    "title": "Генерал-майор И.В. Панфилов командовал: ",
    "answer": "316-ой стрелковой дивизией  "
  },
  {
    "title": "Назовите имя сына казахского национального героя, погибшего у деревни Воронино под Серпуховым в годы ВОВ? ",
    "answer": "Р.Амангельдиев  "
  },
  {
    "title": "Кем была Алия Молдагулова на фронте? ",
    "answer": "Снайпером "
  },
  {
    "title": "Автор стихотворения «Ленинградцы, дети мои!», написанный в 1941 году? ",
    "answer": "Жамбыл Жабаев "
  },
  {
    "title": "Когда Указом Президиума Верховного совета СССР в бассейне Каспия было введено военное положение в годы ВОВ?",
    "answer": "Осенью 1942 г. "
  },
  {
    "title": "Сын поэта Жамбыла - Алгадай командовал расчетом в 19-ом гвардейском полку и геройски погиб близ: ",
    "answer": "Города Синельникова "
  },
  {
    "title": "Казахстан направил в военные училища в года Второй Мировой войны: ",
    "answer": "45 тысяч юношей "
  },
  {
    "title": "Сколько заводов и фабрик, было перебазировано в Казахстан в 1941-1942 гг.?",
    "answer": "220 "
  },
  {
    "title": "За какое время фашистская Германия рассчитывала разгромить СССР.",
    "answer": "За 3-4 месяца  "
  },
  {
    "title": "В чём состоит суть гитлеровского «Плана Барбаросса».? ",
    "answer": "Обеспечить «жизненное пространство» на Востоке за счёт уничтожения СССР"
  },
  {
    "title": "По плану фашистов в какую колониальную страну должен был войти Казахстан? ",
    "answer": "«Большой Туркестан»  "
  },
  {
    "title": "Студенткой какого вуза Алма-Аты была Маншук Маметова до ВОВ?",
    "answer": "АГМИ "
  },
  {
    "title": "В битве за какой город совершила незабываемый подвиг Маншук  Маметова?",
    "answer": "Невель "
  },
  {
    "title": "27 военных учебных заведений эвакуированных в Казахстан, за годы ВОВ подготовили: ",
    "answer": "16 тыс. офицеров "
  },
  {
    "title": "Защитник « Дома Павлова» в Сталинграде, выходец из Южного Казахстана? ",
    "answer": "Толыбай Мурзаев "
  },
  {
    "title": "Воин-казахстанец, закрывший грудью вражеский дзот в годы ВОВ? ",
    "answer": "Тастемир Рустемов  "
  },
  {
    "title": "В боях за Днепр самым юным Героем Советского Союза из казахов стал 18 летний: ",
    "answer": "Ж.Елеусов  "
  },
  {
    "title": "Казахстанские воины, водрузившие знамя 1008-го стрелкового полка на крыше ратуши Берлина? ",
    "answer": "К.Маденов и Р.Караманов  "
  },
  {
    "title": "Казахстанцы - Герои Советского Союза, участистники движения Сопротивления зарубежных стран? ",
    "answer": "А.Егоров и З.Хусаинов  "
  },
  {
    "title": "Казахстанский лётчик, повторивший подвиг  Гастелло в 10 августа 1945 года?",
    "answer": "М.Янко  "
  },
  {
    "title": "Сколько казахстанцев удостоено Ордена Славы трёх степеней? ",
    "answer": "142 "
  },
  {
    "title": "Сколько поэтов и писателей сражалось на фронтах ВОВ?",
    "answer": "Около 90 "
  },
  {
    "title": "За какой труд в период ВОВ получил Государственную премию К.Сатпаев? ",
    "answer": "За исследование Джезказганского месторождения меди "
  },
  {
    "title": "Объясните, что значит депортация? ",
    "answer": "Изгнание, ссылка  "
  },
  {
    "title": "Каковы потери СССР за годы Великой Отечественной войны?",
    "answer": "27 млн. человек "
  },
  {
    "title": "Основная причина неэффективности сельского хозяйства в советское время. ",
    "answer": "Отчуждение крестьянства от результатов своего труда  "
  },
  {
    "title": "Когда в Казахстане были предприняты попытки внедрения хозрасчета? ",
    "answer": "Середина 60-х годов  "
  },
  {
    "title": "Когда после ВОВ была отменена карточная система на продовольствие и промышленные товары? ",
    "answer": "Декабрь 1947 г. "
  },
  {
    "title": "С какой целью в конце 40-х-начале 50-х годов в  было осуществлено слияние мелких колхозов в более крупные? ",
    "answer": "В целях повышения производства продукции "
  },
  {
    "title": "Кому в 1949 году была присуждена Государственная премия за роман-эпопею. ",
    "answer": "Мухтар Ауэзов и его роман «Абай»  "
  },
  {
    "title": "С целью улучшения образования созданы интернаты, в которых в 1953 году училось: ",
    "answer": "40 тысяч учащихся "
  },
  {
    "title": "Какую должность занимал Жумабай Шаяхметов в 1949-1954 гг. ",
    "answer": "Первым секретарем ЦК Компартии Казахстана  "
  },
  {
    "title": "Кто был первым президентом Академии Наук КазССР? ",
    "answer": "Сатпаев Каныш  "
  },
  {
    "title": "С чего начался перевод экономики СССР на рельсы мирного строительства? ",
    "answer": "Перевод военных предприятий (конверсия) на выпуск мирной продукции  "
  },
  {
    "title": "По данным народного комиссариата госбезопасности СССР на октябрь 1946 года на спецпоселении в Казахстане находилось: ",
    "answer": "Около 900 тысяч человек  "
  },
  {
    "title": "Какова основная задача послевоенного пятилетнего плана на 1946-1950 года? ",
    "answer": "Восстановление и дальнейшее развитие народного хозяйства "
  },
  {
    "title": "Какой свинцово-цинковый комбинат в 1947 году дал свою первую продукцию? ",
    "answer": "Усть - Каменогорский "
  },
  {
    "title": "1 августа 1958 г. в г. Темиртау волнение и беспорядки произошли... ",
    "answer": "Из-за низкого жизненного уровня "
  },
  {
    "title": "Фамилия «инакомыслящего учителя», который написал письмо на имя Хрущева.",
    "answer": "Еликбаев  М."
  },
  {
    "title": "Чабан Жамбылской области, известный на международных аукционах каракуля в Дели, Нью-Йорке, Познани  в 50-е годы? ",
    "answer": "Куанышпаев  Ж."
  },
  {
    "title": "В июле 1953 года Пленум ЦК КПСС вывел из состава ЦК и исключил из рядов КПСС.",
    "answer": "Берия Л."
  },
  {
    "title": "Укажите регионы, вошедшие в понятие «целина»: ",
    "answer": "Южная Сибирь, Казахстан, Урал, Поволжье, Северный Кавказ "
  },
  {
    "title": "Какой тезис был выдвинут и поддержан XIX съездом КПСС?",
    "answer": "Замена товарно-денежных отношений прямым продуктообменом"
  },
  {
    "title": "Принцип экономической политики, доминирующий в  послевоенный период? ",
    "answer": "Непропорционально ускоренное развитие тяжелой промышленности "
  },
  {
    "title": "Какой город не был разрушен фашистскими оккупантами?",
    "answer": "Новороссийск "
  },
  {
    "title": "Меры правительства Казахстана для преодоления нехватки специалистов после ВОВ? ",
    "answer": "Создаются школы и училища трудовых резервов "
  },
  {
    "title": "В 1945 г. сколько тракторов было отправлено из Казахстана на Украину, пострадавшее от фашистов?",
    "answer": "500 тракторов "
  },
  {
    "title": "Сколько предприятий легкой и пищевой промышленности было в Казахстане в 50-х г. XX века?",
    "answer": "65 предприятия "
  },
  {
    "title": "Почему количество колхозов уменьшилось с 1945 по 1952 гг.? ",
    "answer": "Шел процесс укрупнения колхозов - мелкие, путем слияния, преобразовывались в крупные                         "
  },
  {
    "title": "В каком году была проведена денежная реформа  после ВОВ?",
    "answer": "В 1947 г. "
  },
  {
    "title": "За счет чего в период после ВОВ проводилось необоснованное снижение цен: ",
    "answer": "За счет резкого ухудшения жизни в аулах и деревнях "
  },
  {
    "title": "Когда М. Ауэзов завершил вторую книгу своего романа-эпопеи «Абай»? ",
    "answer": "В 1947 г. "
  },
  {
    "title": "Взгляды историка, открывшего археологический памятник - Бегазы, были объявлены лженаучными?",
    "answer": "Маргулан "
  },
  {
    "title": "Когда «История Казахской ССР», одним из авторов которой был Е.Бекмаханов, увидела свет?",
    "answer": "В 1943 г. "
  },
  {
    "title": "В каком году Е.Бекмаханов осуждается Верховным судом КазССР на 25 лет? ",
    "answer": "В 1952 г. "
  },
  {
    "title": "В каком году дело Е.Бекмаханова было пересмотрено и он вернулся в Казахстан?",
    "answer": "В 1954 г. "
  },
  {
    "title": "Какое количество научно - исследовательских учреждений действовало в системе Академии наук Казахстана к концу 1950 года?",
    "answer": "55 "
  },
  {
    "title": "В чем состоит историческое значение XX съезда КПСС? ",
    "answer": "Был разоблачен культ личности И. В. Сталина  "
  },
  {
    "title": "Когда был напечатан полный текст доклада, произнесенного Н.С. Хрущевым на XX съезде партии?",
    "answer": "Через 33 года"
  },
  {
    "title": "Количество «инакомыслящих» граждан СССР подвергшихся санкциям через психиатрию в 50-е - 60-е годы XX века? ",
    "answer": "90 тыс. человек "
  },
  {
    "title": "На каком съезде КПСС Н. Хрущев провозгласил о наступлении «развернутого строительства коммунистического общества»? ",
    "answer": "21 съезде КПСС  "
  },
  {
    "title": "Какое количество целинных земель было распахано в Казахстане к августу 1954 года?",
    "answer": "6,5 млн. га. "
  },
  {
    "title": "Для освоения целинны в Северный Казахстан в 1954-1955 годах прибыло 650 тысяч человек. В действительности же требовалось:",
    "answer": "130 тысяч "
  },
  {
    "title": "Что не относится к негативным последствиям освоения целинных и залежных земель:",
    "answer": "Казахстан стал зерносеющей республикой"
  },
  {
    "title": "Количество скота в Казахстане к 1960 году?",
    "answer": "36,4  млн. голов "
  },
  {
    "title": "С какой целью в 1957-1958 годах у селян стали изымать крупный рогатый скот? ",
    "answer": "Увеличение колхозно-совхозного поголовья  "
  },
  {
    "title": "С какими странами Востока расширяются международные связи Казахстана в 50-е годы XX века? ",
    "answer": "Индия, Индонезия, Бирма, Непал, КНР  "
  },
  {
    "title": "Последствия « договора о запрещении ядерных испытаний в атмосфере, космосе и под водой» между СССР и США от 5 августа 1963 года? ",
    "answer": "Переход к подземным испытаниям на Семипалатинском полигоне"
  },
  {
    "title": "Когда с казахстанской земли стартовал первый космонавт  Ю.А. Гагарин? ",
    "answer": "12 апреля 1961 г. "
  },
  {
    "title": "Какую часть населения Казахстана составили казахи в 1962 г.?",
    "answer": "29 % "
  },
  {
    "title": "На X съезде ЛКСМ Казахстана в 1962 году было принято? ",
    "answer": "Шефство над животноводством "
  },
  {
    "title": "Массовая организация трудящихся, имеющая целью улучшить условия жизни и труда своих членов?",
    "answer": "Профсоюзы "
  },
  {
    "title": "Первый в мире полет человека в космос подводило экономику страны к необходимости начать переход: ",
    "answer": "К научно-индустриальному производству  "
  },
  {
    "title": "Одно из главных направлений научно-технического прогресса страны в 60-е годы XX века? ",
    "answer": "Электрификация производства  "
  },
  {
    "title": "В 1965 году свою первую нефть дало месторождение: ",
    "answer": "Узень   "
  },
  {
    "title": "Отрасли экономики  республики, приобредшие общесоюзное значение к 1970 году? ",
    "answer": "Нефтедобывающая и химическая"
  },
  {
    "title": "Где в Казахстане была построена первая в мире атомная водоопреснительная установка? ",
    "answer": "На берегу Каспийского моря "
  },
  {
    "title": "Плотина для защиты Алма-Аты от селевых потоков создавалась в 1966 г. методом...",
    "answer": "Направленного взрыва  "
  },
  {
    "title": "Сколько воинов- казахстанцев погибло в афганской войне?",
    "answer": "780 чел."
  },
  {
    "title": "Когда в Казахстане была принята последняя советская Конституция?",
    "answer": "Апрель  1978г.  "
  },
  {
    "title": "Автор книги «Аз и Я» (книга благонамеренного читателя).? ",
    "answer": "Сулейменов  О."
  },
  {
    "title": "Когда молодежь Целинограда (Акмола) выступила против создания немецкой автономии на территории Казахстана. ",
    "answer": "Июнь     1979 г. "
  },
  {
    "title": "Какая из перечисленных ниже отраслей Казахстана в 80-х годах 20 века являлась преобладающей в экспорте? ",
    "answer": "Сырьевая "
  },
  {
    "title": "Стоимость одного атомного экспериментального устройства и его подземное испытание (взрыв) на Семипалатинском полигоне?",
    "answer": "30 млн. рублей "
  },
  {
    "title": "С какого года в Казахстане начали проводиться медицинские обследования людей, подвергшихся радиации. ",
    "answer": "С 1962 г. "
  },
  {
    "title": "Когда у озера Жаланашколь Семипалатинской области произошло столкновение советских и китайских войск? ",
    "answer": "13 августа 1969 г. "
  },
  {
    "title": "Встреча каких руководителей в аэропорту г. Пекина 11 сентября 1969 года предотвратили ядерный конфликт? ",
    "answer": "Косыгина и Чжоу Эньлая"
  },
  {
    "title": "Крупный территориально - производственный комплекс, сложившийся в Казахстана в 70-е годы 20 века:",
    "answer": "Мангистауский  "
  },
  {
    "title": "Интенсивное использование водных ресурсов Аральского бассейна. Укажите неправильный ответ. ",
    "answer": "Аральское море стало еще полноводнее"
  },
  {
    "title": "Что стало тормозом в развитии сельского хозяйства Казахстана в 70-е годы 20 века? ",
    "answer": "Государственные плановые закупки сельхозпродукции  "
  },
  {
    "title": "Кто в 70-е годы 20 века предложил эффективную  методику развития сельского хозяйства, но был предан суду и умер в тюрьме?",
    "answer": "Худенко И. "
  },
  {
    "title": "Какой характер носили события 16-18 декабря 1986 года в Алма-Аты?",
    "answer": "Политический  "
  },
  {
    "title": "Кто из общественных деятелей Казахстана возглавил Комитет по проблемам Балхаша и Арала? ",
    "answer": "Шаханов  М."
  },
  {
    "title": "Какое место занимал Казахстан по объему экспортных поставок в СССР в конце 80-х годов 20-го века?",
    "answer": "Пятое "
  },
  {
    "title": "Почему реформы 1962-89 годов в СССР не дали эффективных результатов? ",
    "answer": "Реформы не предусматривали коренных изменений экономических отношений  "
  },
  {
    "title": "В какие годы Д.А. Конаев возглавлял Казахстан?",
    "answer": "Январь 1960 - декабрь 1986 года  "
  },
  {
    "title": "Когда Президент Республики Казахстан И.А. Назарбаев подписал указ о закрытии Семипалатинского ядерного полигона?",
    "answer": "28 августа   1991 г.   "
  },
  {
    "title": "Референдум о продлении полномочий Президента Казахстана Н.А. Назарбаева до 2000 года.",
    "answer": "1995 г. "
  },
  {
    "title": "В каком году начался массовый самороспуск местных Советов в Казахстане?",
    "answer": "конец 1993 г.  "
  },
  {
    "title": "25 октября 1990 г. ... ",
    "answer": "Принята Декларация о государственном суверенитете КазССР   "
  },
  {
    "title": "Что заставило руководство Казахстана пойти на либерализацию цен в начале 1992 г? ",
    "answer": "Потребительские цены были отпущены в России"
  },
  {
    "title": "Когда была введена национальная валюта-тенге?",
    "answer": "1993 г. "
  },
  {
    "title": "Указ Н.А.Назарбаева «О реабилитации граждан привлеченных к ответственности за участие в событиях 17-18 декабря 1986 года в Казахстане? ",
    "answer": "12 декабря 1991 г. "
  },
  {
    "title": "Когда Казахстан подписал Лиссабонский протокол и объявил, что свободен от ядерного оружия? ",
    "answer": "В 1993 году "
  },
  {
    "title": "Процесс разгосударствления и передачи собственности народу Казахстана называется: ",
    "answer": "Приватизация "
  },
  {
    "title": "Какой вопрос рассматривался на декабрьском 1986 года Пленуме Компартии Казахстана? ",
    "answer": "Замена руководителя Республики  "
  },
  {
    "title": "Какую цель ставило перед собой оформившееся в Казахстане в июле 1990 года гражданское движение «Азат»? ",
    "answer": "Борьба за обретение государственного суверенитета  "
  },
  {
    "title": "Сколько политизированных общественных формирований действовало в Казахстана к началу 1990 года?",
    "answer": "100 "
  },
  {
    "title": "Когда в Казахстане создано историко-просветительское общество «Адилет». ",
    "answer": "В 1989 году "
  },
  {
    "title": "В ходе забастовки 1989 года какие требования прозвучали карагандинских шахтеров? ",
    "answer": "Политические "
  },
  {
    "title": "Совместные предприятия, зарегистрированные в Казахстане в первой половине 1991 года? ",
    "answer": "35 предприятий"
  },
  {
    "title": "Какое количество национально-культурных центров действовало на территории Казахстана в 90-е годы XX века? ",
    "answer": "19 "
  },
  {
    "title": "Когда в Казахстане был принят «Закон о языках».",
    "answer": "22 сентября 1989 года "
  },
  {
    "title": "В каком году люди, осужденные за декабрьское восстание 1986 года, образовали свою партию «Желтоксан». ",
    "answer": "В 1990 году "
  },
  {
    "title": "Какой процент населения Казахстана проживал в сельской местности к началу 1991 года?",
    "answer": "Более 42% "
  },
  {
    "title": "В каком году были оправданы А.Байтурсынов, М.Жумабаев, М.Дулатов, Ш.Кудайбердиев? ",
    "answer": "В 1988 году"
  },
  {
    "title": "Как называется движение в защиту экологии, созданное под руководством О. Сулейменова в 80-е годы XX века?",
    "answer": "«Невада - Семипалатинск»"
  },
  {
    "title": "В каком году были утверждены Государственный Флаг и Герб Республики? ",
    "answer": "В июне 1992 г. "
  },
  {
    "title": "Форма правления  в Республике Казахстан согласно  Конституции РК? ",
    "answer": "Президентская "
  },
  {
    "title": "Единственным источником государственной власти в Казахстане в соответствии с Конституцией Республики является:",
    "answer": "Народ "
  },
  {
    "title": "Какие формы собственности действуют в Казахстане согласно Конституции? ",
    "answer": "Частная и государственная "
  },
  {
    "title": "Когда состоялась торжественная презентация новой столицы Казахстана-Астаны? ",
    "answer": "В июне 1998 года "
  },
  {
    "title": "Кто по Конституции РК является главой государства?",
    "answer": "Президент "
  },
  {
    "title": "Авторы Герба Республики Казахстан? ",
    "answer": "Ж.Малибеков, Ш.Уалиханов"
  },
  {
    "title": "Автор Флага Республики Казахстан? ",
    "answer": "Ш.Ниязбеков"
  },
  {
    "title": "Когда был принят  текст первого Гимна Республики Казахстан?",
    "answer": "Декабрь 1992 года "
  },
  {
    "title": "Кто является символом и гарантом единства народа и государственной власти, незыблемости Конституции в РК? ",
    "answer": "Президент "
  },
  {
    "title": "Назовите орган местной исполнительной власти в РК, согласно Конституции. ",
    "answer": "Акимат  "
  },
  {
    "title": "Количество областей в Казахстане на современном этапе? ",
    "answer": "14 "
  },
  {
    "title": "Назовите период функционирования СССР: ",
    "answer": "1922-1991 гг. "
  },
  {
    "title": "Ключевые слова Президента в Послании народу (2030).:",
    "answer": "Процветание, безопасность и улучшение благосостояния  "
  },
  {
    "title": "Что, по мнению Президента, следует отстаивать в контактах с иностранными партнерами в первую очередь? ",
    "answer": "Экологию "
  },
  {
    "title": "С чего, по мнению Президента, высказанного в Послании народу (2030), следует начинать, создавая процветающий Казахстан?",
    "answer": "Создать здоровую экономику   "
  },
  {
    "title": "Страна Великой Преображенной Степи (Ұлы Дала Елі)-это...",
    "answer": "Казахстан"
  },
  {
    "title": "Кто возглавил ГКЧП?",
    "answer": "Янаев Г."
  },
  {
    "title": "Какая партия была образована вместо коммунистической партии?",
    "answer": "Социалистическая"
  },
  {
    "title": "Назовите сопредседателей партии «Народного конгресса Казахстана», созданную 5 октября 1991 г.?",
    "answer": "Сулейменов О. и Шаханов М."
  },
  {
    "title": "Как называлась\tкомсомольская организация Казахстана с 1991 г.?",
    "answer": "Союз молодежи Казахстана"
  },
  {
    "title": "В каком городе было объявлено о роспуске СССР и о создании СНГ?",
    "answer": "Алматы "
  },
  {
    "title": "Когда состоялись первые всенародные выборы Президента Республики Казахстан?",
    "answer": "1 декабря 1991 г."
  },
  {
    "title": "В каком предприятии начал трудовую деятельность Н.А.Назарбаев в 1960 г.?",
    "answer": "В Карагандинском металлургическом комбинате"
  },
  {
    "title": "Когда было принято решение о переименовании Казахской Советской Социалистической Республики в Республику Казахстан?",
    "answer": "10 декабря 1991 г. "
  },
  {
    "title": "В 1989-1992 гг. началась работа по переименованию городов. Какое имя было возвращено г. Шевченко? ",
    "answer": "Актау "
  },
  {
    "title": "Сколько тысяч человек было реабилитировано незаконно репрессированных лиц?",
    "answer": "более 17 тысяч граждан"
  },
  {
    "title": "Когда Республика Казахстан стала полноправным членом Организации Объединенных Наций?",
    "answer": "2 марта      1992 г."
  },
  {
    "title": "В каком городе проходил 2-ой Всемирный курултай казахов?",
    "answer": "Туркестане"
  },
  {
    "title": "Когда состоялось полет второго космонавта-казаха, борт-инженера коробля «Союз ТМ- 19» Талгата Мусабаева в космос?",
    "answer": "В июле 1994 г. "
  },
  {
    "title": "В каком году город Акмола переименован в город Астану?",
    "answer": "1998 г. "
  },
  {
    "title": "Какая страна первым признала независимость суверенного Казахстана?",
    "answer": "Турция"
  },
  {
    "title": "В каком году образована антиядерное движение «Невада-Семипалатинск»?",
    "answer": "1989 г. "
  },
  {
    "title": "Какой закон Республики Казахстан был принят в 1996 г.?",
    "answer": "Закон о политических партиях  "
  },
  {
    "title": "Самые многочисленные делегации в работе 1 Курултая Всемирных казахов?",
    "answer": "Узбекистан и Россия  "
  },
  {
    "title": "Республиканский референдум о продлении сроков полномочий Президента РК Н. А. Назарбаева?",
    "answer": "29 апреля  1995 г."
  },
  {
    "title": "Посольство какой страны играло «роль форпоста казахстанской политики в странах Восточной Европы»?",
    "answer": "Венгрия "
  },
  {
    "title": "В каком году Президент Казахстана Н. А. Назарбаев выступил с идеей образования Евразийского Союза Государств?",
    "answer": "1994 г."
  },
  {
    "title": "Город - единственное в Центральной Азии представительство ЮНЕСКО?",
    "answer": "Алматы "
  },
  {
    "title": "Когда был принят Патриотический акт \"Мәңгілік ел\"",
    "answer": "15 декабря 2014 года"
  },
  {
    "title": "Произведение Махмуда Кашгари",
    "answer": "Дивани лугат ат-тюрк"
  },
  {
    "title": "Кто являлся первыми правителями Казахского ханства?",
    "answer": "Жанибек и Керей "
  },
  {
    "title": "Что выступала основой формирования многоукладной экономики?",
    "answer": "осуществление жесткой денежно- кредитной и финансовой политики"
  },
  {
    "title": "В какой сектор была направлена большая часть (58,5%) инвестиций в Казахстане?",
    "answer": "Нефтегазовый "
  },
  {
    "title": "Какой год в Казахстане был объявлен «Годом поддержки культуры»?",
    "answer": "1999 г. "
  },
  {
    "title": "Юбилей какого великого ученого казахского народа был отмечен в 1999 г.? ",
    "answer": "Каныша Сатпаева"
  },
  {
    "title": "Найдите ошибку в списке трудов Н.А.Назарбаева?",
    "answer": "Между востоком и западом"
  },
  {
    "title": "В каком г. было отмечено юбилейные празднования - 100-летия Мухтара Ауезова?",
    "answer": "1997 г. "
  },
  {
    "title": "Какое юбилейное празднование было отмечено в 1996 г.?",
    "answer": "150 -летие Жамбыла Жабаева"
  },
  {
    "title": "Какой древний город отметил свой юбилей в 2000 г.?",
    "answer": "Туркестан "
  },
  {
    "title": "100-летний юбилей какого видного деятеля были проведены в 2004 г.?",
    "answer": "Алкея Маргулана"
  },
  {
    "title": "Когда был принят Закон \"О науке\"?",
    "answer": "2011 г. "
  },
  {
    "title": "Произведение аль-Фараби",
    "answer": "Книга о смысле философии  "
  },
  {
    "title": "В каком году вышла книга Н.А.Назарбаева «В потоке истории»?",
    "answer": "1999 г. "
  },
  {
    "title": "В каком году была обнародована Стратегическая программа развития страны «Казахстан-2030»?",
    "answer": "1997 г. "
  },
  {
    "title": "Сколько долгосрочных приоритетных направлений были утверждены в Стратегической программе «Казахстан-2030»?",
    "answer": "7"
  },
  {
    "title": "Произведение Жусупа Баласагуни",
    "answer": "Кутадгу Билиг  "
  },
  {
    "title": "Произведение Ходжа Ахмета Яссауи",
    "answer": "Дивани Хикмет  "
  },
  {
    "title": "Какой сектор экономики не относится для защиты иностранных инвестиций и возможности репатриации прибыли?",
    "answer": "разработка природных ресурсов"
  },
  {
    "title": "Какую продукцию необходимо эффективно использовать как энергетические ресурсы Казахстана?",
    "answer": "Нефти и газа "
  },
  {
    "title": "Когда учреждена Международная стипендия  «Болашақ». ",
    "answer": "5 ноября 1993 года"
  },
  {
    "title": "Какая долгосрочная программа принята для экономического развития страны до 2015 г.?",
    "answer": "Индустриально-инновационная  "
  },
  {
    "title": "Какие направления предпринимательской деятельности будут обеспечены государственной поддержкой?",
    "answer": "Малый и средний"
  },
  {
    "title": "Решением глав 11 бывших республик СССР на встрече 21 декабря 1991 г. в Алма-Ате является:",
    "answer": "создание СНГ"
  },
  {
    "title": "Какое событие в жизни республики произошло 1 декабря 1991г.?",
    "answer": "Состоялись всенародные выборы Президента Казахстана "
  },
  {
    "title": "Какое событие произошло 16 декабря 1991г.? ",
    "answer": "Закон о государственной независимости Республики Казахстан "
  },
  {
    "title": "Какое событие в жизни Казахстана произошло 2 марта 1992 г.?",
    "answer": "Казахстан вступает в ООН "
  },
  {
    "title": "Какое общественное движение (организация) имело наибольшую поддержку и влияние в Казахстане 1989-1991гг.? ",
    "answer": "Движение « Невада-Семипалатинск »"
  },
  {
    "title": "Какая партия возникла в Казахстане на базе бывшей коммунистической партии? ",
    "answer": "Социалистическая"
  },
  {
    "title": "В каком году в СССР начался курс на перестройку?",
    "answer": "1985 г. "
  },
  {
    "title": "С каким государством Казахстан впервые (после 1985 г.) заключил экономические связи?",
    "answer": "Южная Корея"
  },
  {
    "title": "Первым министром обороны независимого Казахстана был назначен генерал-лейтенант:",
    "answer": "С.Нурмагамбетов"
  },
  {
    "title": "В каком году вышла в свет работа Н.А.Назарбаева «Стальной профиль Казахстана»",
    "answer": "1985  год"
  },
  {
    "title": "В каком году вышла в свет работа Н.А.Назарбаева « В сердце Евразии»",
    "answer": "2005  год"
  },
  {
    "title": "Как называется день 16 декабря 1991 г. в Республике Казахстан?",
    "answer": "День Независимости Казахстана "
  },
  {
    "title": "Решение о продлении полномочий  Президента РК Н.А.Назарбаева сроком до  1 декабря 2000 года:",
    "answer": "По итогам  республиканского   референдума"
  },
  {
    "title": "В начале 2000-х голов партия «Ак жол», партия «Демократический выбор Казахстана» и Коммунистическая партия перед выборами в Мажилис Парламента:",
    "answer": "Составили оппозиционное крыло"
  },
  {
    "title": "Режиссер  фильма о Н.А.Назарбаеве «Небо моего детства»?",
    "answer": "Р. Абдырашев"
  },
  {
    "title": "Какой пост занимал Н.А.Назарбаев в 1984-1989 годы. ",
    "answer": "Председатель Совета Министров Казахской ССР "
  },
  {
    "title": "В каком труде Н.А.Назарбаева описаны основные задачи развития Казахстана в будущем?",
    "answer": "«Казахстан – 2030»"
  },
  {
    "title": "Когда Президент Казахстана утвердил содержание клятвы для военнослужащих РК?",
    "answer": "1992 год, август"
  },
  {
    "title": "Какую должность возглавлял  Н.А.Назарбаев в  1989-1991 годы?",
    "answer": "Первый секретарь ЦК КП Казахстана"
  },
  {
    "title": "В каком году родился Президент Республики Казахстан  Н.А.Назарбаев?",
    "answer": "6 июля 1940 года"
  },
  {
    "title": "Кто имеет  право  по Конституции РК обращаться от имени народа?",
    "answer": "Президент и  Парламент"
  },
  {
    "title": "22-ой   казахстанец награжденный «Халық қаһарманы»",
    "answer": "Аимбетов А."
  },
  {
    "title": "Процентный показатель овладения казахского языка граждан Казахстана к 2025 году.",
    "answer": "95 процентов"
  },
  {
    "title": "В  каком году был поднят вопрос о переходе к латинскому алфавиту? ",
    "answer": "2012 году"
  },
  {
    "title": "В каком году Казахстан приняли  в состав Международного выставочного бюро  EXPO :",
    "answer": "1997 году"
  },
  {
    "title": "Какой город  участвовал в конкурсе на проведение  Международной выставки EXPO с городом Астана ?",
    "answer": "Город Льеж в Бельгии"
  },
  {
    "title": "Сколько  государств выступило против проведения в городе Астана Международной выставки  «ЕХРО-2017»?",
    "answer": "44"
  },
  {
    "title": "Основные цели  Стратегии Қазақстан- 2050 ",
    "answer": "Войти в состав 30 развитых стран"
  },
  {
    "title": "Когда состоялся первый  Всемирный Курултай  казахов в Алматы?",
    "answer": "1992 году"
  },
  {
    "title": "В каком году состоялся второй Всемирный Курултай казахов в Туркестане.",
    "answer": "23 октября 2002  года"
  },
  {
    "title": "Год   организации Ассамблея народа Казахстана ?",
    "answer": "1 марта      1995 года"
  },
  {
    "title": "Когда образовался Таможенный Союз?",
    "answer": "2010 году"
  },
  {
    "title": "Какие государства вошли в состав тройки Таможенного Союза?",
    "answer": "Казахстан, Россия, Беларусь"
  },
  {
    "title": "Сколько  объектов Всемирного культурного наследия Казахстана в ЮНЕСКО.",
    "answer": "3"
  },
  {
    "title": "В  каком  году Казахстан вошел в состав   Организацию Европейской безопасностии сотрудничества (ОБСЕ)",
    "answer": "30 января  1992 года"
  },
  {
    "title": "Мероприятие,организованное в столице  Астане  с 1 по 2 декабря  2010 года",
    "answer": "Саммит  организации Европейской безопасности и  сотрудничества (ОБСЕ)\t"
  },
  {
    "title": "Сколько  участников - государств ОБСЕ участвовало в саммите в Астане?  ",
    "answer": "56 государств"
  },
  {
    "title": "По Конституции 1995 г. законодательным органом Республики Казахстан  является:",
    "answer": "Парламент"
  },
  {
    "title": "Сколько было видов медалей  представлено в истории VII Зимних Азиатских игр? ",
    "answer": "69 медалей"
  },
  {
    "title": "Сколько  государств участниц-спортсменов участвовало на VII Зимних Азиадских играх? ",
    "answer": "27"
  },
  {
    "title": "В каком году Н.А.Назарбаев  вручил семье Б. Момышулы «Золотую Звезду Героя Советского Союза» ?",
    "answer": "30 декабря 1990 года"
  },
  {
    "title": "Н.А. Назарбаев в труде  «Мыслями с народом поделюсь»  писал, что «Там где нет  закона, там  ...»",
    "answer": "нет свободы, нет демократии  "
  },
  {
    "title": "Н.А. Назарбаев в труде  «Мыслями с народом поделюсь»  писал, что «Демократия  не устанавливается  ...».",
    "answer": "указом"
  },
  {
    "title": "В  каком труде  Н.А.Назарбаев, осмысливает  историю казахского народа?",
    "answer": "В потоке истории"
  },
  {
    "title": "О чем  книга Н.А. Назарбаева «Без правых и левых»?",
    "answer": "Автобиографические  воспоминания "
  },
  {
    "title": "В какой книге Н.А.Назарбаева рассматривается деятельность КПСС по созданию металлургической базы в Казахской ССР. ",
    "answer": "Стальной профиль Казахстана"
  },
  {
    "title": "Какая книга включает автобиографические  очерки  Н.А. Назарбаева?",
    "answer": "Без правых и левых"
  },
  {
    "title": "В каком году  всенародным голосованием Н.А.Назарбаев был избран президентом Казахской ССР ?",
    "answer": "1991 год"
  },
  {
    "title": "Когда была подписана  конвенция о отказе от ядерного оружия Н.А.Назарбаевым? ",
    "answer": "1999 г."
  },
  {
    "title": "В какой книге Н.Назарбаев объединил дневниковые записи о сложных решениях, посвященные новой столице? ",
    "answer": "В сердце Евразии "
  },
  {
    "title": "В каком труде Н.А.Назарбаев рассказывает о том, как Казахстан добровольно отказался от применения ядерного оружия на своей территории?",
    "answer": "Эпицентр мира"
  },
  {
    "title": "Где была предложена идея Н.А.Назарбаева о проведений  съезда традиционных мировых религий?",
    "answer": "На 62 сессии Генеральной Ассамблеи ООН"
  },
  {
    "title": "Какая книга Главы государства о пути становления независимого государства.?",
    "answer": "«Казахстанский путь »"
  },
  {
    "title": "Книга-размышление о трудных поисках человечеством формулы «ядерной» безопасности...?",
    "answer": "«Эпицентр мира»"
  },
  {
    "title": "В какой книге обосновываются выводы и предложения по повышению эффективности  приватизации собственности",
    "answer": "Рынок и социально-экономическое развитие "
  },
  {
    "title": "Книга Н.А.Назарбаева об актуальныч проблемах ресурсосбережения и  ресурсопотребления?",
    "answer": "Стратегия ресурсосбережения и переход к рынку "
  },
  {
    "title": "С какого времени начали сообщать населению об испытаниях ядерного оружия",
    "answer": "1953 г."
  },
  {
    "title": "Когда была впервые испытана ядерная бомба в СССР",
    "answer": "1949 г.  29 августа"
  },
  {
    "title": "Год празднования 550 летия  Казахского ханства",
    "answer": "2015 г."
  },
  {
    "title": "В каком году Президенты Н.Назарбаев, И.Каримов, А.Акаев встретились на горе Ордабасы",
    "answer": "1993 г."
  },
  {
    "title": "В какой статье Президент РК дал поручение внедрить предмет «Краеведение» в учебный процесс.",
    "answer": "Двадцать шагов к обществу всеобщего труда"
  },
  {
    "title": "В каком труде Президент РК дал критическую оценку содержанию предмету «История Казахстана».",
    "answer": "Двадцать шагов к обществу всеобщего труда"
  },
  {
    "title": "В Казахстане 1 марта является праздником...",
    "answer": "День Благодарности"
  },
  {
    "title": "В каком труде Президент РК дал поручение внедрить предмет «Акмеология»в учебный процесс.",
    "answer": "Двадцать шагов к обществу всеобщего труда"
  },
  {
    "title": "В каком труде Президент РК дал поручение внедрить предмет «Казахстанское право» в учебный процесс.",
    "answer": "Двадцать шагов к обществу всеобщего труда"
  },
  {
    "title": "Основная цель выставки «ЭКСПО-2017»",
    "answer": "Экономия энергетических ресурсов, переход на «зеленую» энергетику"
  },
  {
    "title": "В каком году был подписал указ Президента РК  «О столице Республики Казахстан» ",
    "answer": "1995 г. сентябрь"
  },
  {
    "title": "Кто автор новой редакции Гимна Казахстана",
    "answer": "Назарбаев Н."
  },
  {
    "title": "Процесс президентских выборов  в РК является....",
    "answer": "Мажоритарным, пропорциональным"
  },
  {
    "title": "Когда Казахстан присоединился к Соглашению о полном запрещении испытания ядерного оружия",
    "answer": "1996 г."
  },
  {
    "title": "Какой мыслитель перевел слово «психология» как «тайна души»",
    "answer": "Кудайбердыулы Ш."
  },
  {
    "title": "Кто из Казахстана был на конференции Японии в 1957 г. по вопросу закрытия Семипалатинского ядерного полигона",
    "answer": "Ауезов М."
  },
  {
    "title": "Найдите государство - не члена СНГ",
    "answer": "Литва"
  },
  {
    "title": "Где Н.Назарбаев предложил разработать «План Глобальной Стратегической Инициативы – 2045»",
    "answer": "На сессии ГА ООН"
  },
  {
    "title": "Численность рабочих в районе железной дороги Ташкент-Оренбург к 1902-1904 гг. достигла:",
    "answer": "30.000 чел."
  },
  {
    "title": "В каком городе был образован  первый марксисткий кружок?",
    "answer": "Оренбург"
  },
  {
    "title": "Назовите число переселенцев в степных областях Казахстана с 1870 по 1906 гг.?",
    "answer": "521.023 чел."
  },
  {
    "title": "Удельный вес бедняков и батраков в начале XX века в Семиречье:",
    "answer": "28,3%"
  },
  {
    "title": "В каком городе в октябре 1905 г. прошла политическая демонстрация, где казахи и русские выступили сообща?",
    "answer": "Перовск"
  },
  {
    "title": "Когда планировалось, по решению партии коммунистов, закончить коллективизацию в Казахстане? ",
    "answer": "1932 г. "
  },
  {
    "title": "С 1945 по 1948 годы из рядов Советской армии было демобилизовано:",
    "answer": "8,5 млн. человек "
  },
  {
    "title": "В каком году состоялась Первая официальная поездка  Н.А. Назарбаева в КНР ?",
    "answer": "1991 году"
  },
  {
    "title": "Где Н.Назарбаев заявил о необходимости передислокации штаб-квартиры ООН на территорию Азии",
    "answer": "На сессии ГА ООН"
  },
  {
    "title": "На каком языке сделал доклад Н.Назарбаев на сессии Генеральной Ассамблеи ООН 28 сентября 2015 г.",
    "answer": "на казахском"
  },
  {
    "title": "Первый космонавт – казахстанец",
    "answer": "Аубакиров Т."
  },
  {
    "title": "Сколько приоритетов включает  «Стратегия «Казахстан-2050»",
    "answer": "7"
  }
]