module.exports = [
  {
    "title": "Руководитель восстания 1916 года в Акмолинске",
    "answer": "С.Сейфулин"
  },
  {
    "title": "Председателем Центрального Шуро (Совета мусульман) Туркестана в апреле 1917 г. был избран",
    "answer": "А.Шокай"
  },
  {
    "title": "В социальном плане, основа устойчивости Казахстана-это",
    "answer": "наличие среднего класса"
  },
  {
    "title": "Каспийское море является морем нити субъектов международных отношений",
    "answer": "России и Казахстана"
  },
  {
    "title": "12 апреля 2017 года Президент Республики Казахстан Н.А. Назарбаев выступил с программной статьёй",
    "answer": "Взгляд в будущее: модернизация общественного сознания"
  },
  {
    "title": "Первый руководитель Туркестанской (Кокандской) автономии",
    "answer": "М.Тынышпаев"
  },
  {
    "title": "Экономические связи Казахской ССР с зарубежными странами осуществлялись",
    "answer": "через республиканские министерства"
  },
  {
    "title": "Экономическое движение которого возглавил О.Сулейменов в конце  80-х гг ХХ в",
    "answer": "”Невада-Семипалатинск”"
  },
  {
    "title": "Казахстан согласно захватническим планам фашистов должен был войти в",
    "answer": "Большой Туркестан"
  },
  {
    "title": "По данным Всесоюзной переписи населения 1989г. общая численность населения Казахстана достигла",
    "answer": "16537 тыс. человек"
  },
  {
    "title": "По планам Казахстан должен был войти в колонию по названием",
    "answer": "«Большой Туркестан»"
  },
  {
    "title": "Ассамблея народа Казахстана была создана в",
    "answer": "марте 1995 г."
  },
  {
    "title": "Строительство Турксиба в Казахстане осуществлялось в",
    "answer": "1927-1930 гг."
  },
  {
    "title": "Слова, облетевшие весь фронт: “Велика Россия, а отступать некуда, позади -Москва”, произнес:",
    "answer": "В.Клочков"
  },
  {
    "title": "В постановлений ВЦИК от 4 ноября 1919 г. Относительно членов Алаш-Орды, принимавших участие в борьбе против Советской власти",
    "answer": "Об амнистии"
  },
  {
    "title": "Всеказахский съезд проходил в городе",
    "answer": "Оренбург"
  },
  {
    "title": "Амангелды Иманов был сардарбеком в",
    "answer": "Тургайской области"
  },
  {
    "title": "В освобождении народа Европы, в движений Сопротивления участвовали Герои Советского Союза",
    "answer": "А.Егоров и З.Хусаинов"
  },
  {
    "title": "В годы ожесточенной, истребительной гражданской войны погибло:",
    "answer": "8 млн. человек."
  },
  {
    "title": "Кого по приказу атамана Б. Анненкова в годы гражданской войны живьем сожгли в кочегарке парохода «Монгол»?",
    "answer": "Я. Ушанова."
  },
  {
    "title": "В августе 1919 года войска Семиреченского фронта пытались оказать помощь Черкасской обороне, при этом погиб командующий фронтом.",
    "answer": "Л.Емелев."
  },
  {
    "title": "Когда в годы гражданской войны была введена продразверстка?",
    "answer": "Январь 1919 г."
  },
  {
    "title": "Когда было принято решение о ликвидации Алаш-Орды, именовавшей себя «правительством Киргизии»?",
    "answer": "9 марта 1920 г."
  },
  {
    "title": "В какие годы Оренбург был первой столицей Каз. АССР и сыграл важную роль в ее развитии?",
    "answer": "1920-1924."
  },
  {
    "title": "Вооруженное выступление против насильственной коллективизации в Казахстане произошло:",
    "answer": "В 1929-1931 гг."
  },
  {
    "title": "Когда началось строительство Туркестано-Сибирской железной дороги, соединившей Сибирь со Средней Азией.",
    "answer": "1927 г."
  },
  {
    "title": "Когда планировалось, по решению партии коммунистов, закончить коллективизацию в Казахстане?",
    "answer": "1932 г."
  },
  {
    "title": "Что разрешила новая экономическая политика?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Кто из правителей джунгар проявлял особую жестокость на казахских землях?",
    "answer": "Цеван-Рабдан."
  },
  {
    "title": "Кто из видных общественных деятелей Казахстана участвовал в проведении земельно-водной реформы?",
    "answer": "А.Асылбеков и Д.Барибаев"
  },
  {
    "title": "какой форме по решению правительства взимается сельскохозяйственный налог с крестьян с 1 января 1924 года?",
    "answer": "Только деньгами"
  },
  {
    "title": "Из какого рода был выходцем батыр Раимбек?",
    "answer": "Албан"
  },
  {
    "title": "В каком году произошла битва в местечке Аяк, результатом которой стал договор о ненападении между казахами и джунгарами?",
    "answer": "В 1750 г"
  },
  {
    "title": "Декретом 1919года Казревком учреждался как высшая:",
    "answer": "Военно-гражданская власть"
  },
  {
    "title": "В1985году Генеральным секретарем КПССстал…",
    "answer": "Горбачев"
  },
  {
    "title": "Какой модели развития будет придерживаться Казахстан в создании высоко развитого общества, помнению Президента, высказанного в Послании народу(2030)?",
    "answer": "собственной модели"
  },
  {
    "title": "За период с1991по1995гг.вРеспублику Казахстан  начали  приезжать\nНа постоянное местожительства казахи издальнего зарубежья:",
    "answer": "Китай"
  },
  {
    "title": "Фильмы,снятыев годы независимости Республики Казахстан:",
    "answer": "«Кочевник»"
  },
  {
    "title": "Стрелковая дивизия,сформированнаяв1941г.вАлма-Ате:",
    "answer": "Участвовала в боях за Сталинград"
  },
  {
    "title": "Лидеры либерально-демократическойинтеллигенции:",
    "answer": "Байтурсынов"
  },
  {
    "title": "На VII съезде Компартии Казахстана вместо Ж.Шаяхметова первым секретарем ЦК Компартии Казахстана был избран",
    "answer": "ПономаренкоП.К."
  },
  {
    "title": "Какое предприятие вошло встрой впервое послевоенное десятилетие?",
    "answer": "Усть – Каменогорский свинцово- цинковыйкомбинат"
  },
  {
    "title": "Какое количество областей на считывается в Казахстанена современном этапе?",
    "answer": "14."
  },
  {
    "title": "Назовите период функционирования СССР:",
    "answer": "1922-1991гг."
  },
  {
    "title": "Что представляет собой Послание Президента страны народу Казахстана(2030)?",
    "answer": "Все правильные"
  },
  {
    "title": "Что означает термин«стратегия»?",
    "answer": "Всеперечисленное."
  },
  {
    "title": "Ключевые слова Президентав Послании народу(2030).:",
    "answer": "Процветание,безопасность и улучшение благосостояния."
  },
  {
    "title": "В1968 году советскиевой скабылив ведены натерриторию…",
    "answer": "Чехословакии"
  },
  {
    "title": "ЕдинственнымисточникомгосударственнойвластивКазахстаневсоответствиисКонституциейРеспубликиКазахстан является:",
    "answer": "Народ"
  },
  {
    "title": "Слабость рабочего движения в Казахстанев годы революции1905-1907гг.была вызвана",
    "answer": "мало численностью рабочего класса"
  },
  {
    "title": "В Казахстане пост Президента учрежден?",
    "answer": "24 апреля 1990 г."
  },
  {
    "title": "Назовите авторов Герба Республики Казахстан?",
    "answer": "Ж.Малибеков,Ш.Уалиханов."
  },
  {
    "title": "Почьей инициативе был создан комитет по проблемам Балхашаи Арала?",
    "answer": "М.Шаханова"
  },
  {
    "title": "Кто написал книгу«Оян,казак»?",
    "answer": "М.Дулатов"
  },
  {
    "title": "Когда Казахская АССР была преобразованав союзную республику?",
    "answer": "1936г."
  },
  {
    "title": "Лис сабонский протокол предусматривал",
    "answer": "Выход КазССР изсостава СССР"
  },
  {
    "title": "Когда в РК был принят новый текст Гимна Республики?",
    "answer": "Декабрь1992"
  },
  {
    "title": "Газета «Қазақ» издаваласьв:",
    "answer": "Оренбурге"
  },
  {
    "title": "Первый Всеказахский съезд состоялся в Оренбурге",
    "answer": "21-28 июля 1917 г."
  },
  {
    "title": "Лидеромпартии «Үш-жүз» был",
    "answer": "К.Тогусов"
  },
  {
    "title": "Партия «Үш жуз» активно поддерживала",
    "answer": "Большевиков"
  },
  {
    "title": "В первые в Казахстане советская власть установилась в городе",
    "answer": "Перовск"
  },
  {
    "title": "В ходе революции в феврале 1917 г.",
    "answer": "Свергнуто самодержавие"
  },
  {
    "title": "По своему характеру февральская революция 1917 г. Была",
    "answer": "буржуазно-демократической"
  },
  {
    "title": "Первый пункт проекта Программы партии «Алаш» был посвящен",
    "answer": "государственному устройству"
  },
  {
    "title": "В годы гражданской войны большевики проводили политику",
    "answer": "военного коммунизма"
  },
  {
    "title": "В годы индустриализации в Казахстане",
    "answer": "был построен Турксиб"
  },
  {
    "title": "Кому принадлежат слова: «Казахстан был и остался колонией…»?",
    "answer": "Садвакасову"
  },
  {
    "title": "Когда Казахская АССР была преобразована в союзную республику?",
    "answer": "1936 г."
  },
  {
    "title": "В Казахстане  пост Президента учрежден?",
    "answer": "24 апреля 1990 г."
  },
  {
    "title": "Когда была принята ныне действующая Конституция Республики Казахстан?",
    "answer": "30 августа 1995 г."
  },
  {
    "title": "Первый Президент Академии наук Казахской ССР.",
    "answer": "Сатпаев К.И."
  },
  {
    "title": "Когда возникло военно-феодальное государство Чингисхана?",
    "answer": "В начале 13 в."
  },
  {
    "title": "При каком хане ислам был объявлен государственной религией в Золотой Орде?",
    "answer": "При Узбеке."
  },
  {
    "title": "Как называется государство, основанное Едиге-бием?",
    "answer": "Ногайская Орда"
  },
  {
    "title": "Когда Тамерлан правил в Средней Азии?",
    "answer": "1370 -1405 гг."
  },
  {
    "title": "При каких ханах процветала Золотая Орда?",
    "answer": "Узбек и Жанибек."
  },
  {
    "title": "Назовите одного из знаменитых жырау в Дешт-и Кипчаке 15 в.",
    "answer": "Коркут."
  },
  {
    "title": "С каким государством в 561-563 годах тюрки заключили союз против эфталитов?",
    "answer": "с Ираном."
  },
  {
    "title": "Когда  территория Казахстана окончательно вошла в состав империи Чингисхана?",
    "answer": "1224 г."
  },
  {
    "title": "Какой казахский музыкант и певец второй половины 19 века подвергся гонениям и притеснениям?",
    "answer": "ЖаяуМуса."
  },
  {
    "title": "Сколько лет в жестокой борьбе Чингисхан шел к единоличной власти?",
    "answer": "20 лет."
  },
  {
    "title": "Какую идею высказали на І Всеказахском съезде   Байтурсынов и М.Дулатов?",
    "answer": "создание независимого автономного Казахстана"
  },
  {
    "title": "Временное правительство было свергнуто в результате победы",
    "answer": "Советов в выборах на Учредительном собрании"
  },
  {
    "title": "Первый Всеказахский съезд 21-28 июля 1917 года прошел в:",
    "answer": "Оренбурге"
  },
  {
    "title": "Местом издания газеты «Қазақ» был выбран",
    "answer": "Оренбург"
  },
  {
    "title": "21 ноября 2018 года Президент Республики Казахстан Н. А. Назарбаев выступил с программной статьей",
    "answer": "Семь граней Великой степи"
  },
  {
    "title": "2 октября 1991 года состоялся",
    "answer": "Полет в космос первого казахстанского космонавта Т. Аубакирова"
  },
  {
    "title": "Причины антисоветских выступлений в Казахстане в начале 20-х годов XX века",
    "answer": "недовольство крестьян проведением хлебной разверстки"
  },
  {
    "title": "Казахстанский писатель-участник партизанского движения в годы Великой Отечественной войны",
    "answer": "К. Кайсенов"
  },
  {
    "title": "Вопрос, который поднимался в сборнике стихов «Пробудись, казах!»",
    "answer": "Критика колониальной политики царской Россий"
  },
  {
    "title": "Земельно-водная реформа в 1921-1922 г.г. проводилась в связи с",
    "answer": "образованием КАССР"
  },
  {
    "title": "Основная суть гитлеровского «Плана Барбаросса», принятого в декабре 1940 года состояло в том, чтобы",
    "answer": "Обеспечить «жизненное пространство» на Востоке за счет уничтожения СССР"
  },
  {
    "title": "Первые выборы президента Республики Казахстана состоялись",
    "answer": "1 декабря 1991 года"
  },
  {
    "title": "На рубеже 2000-х годов вся экономика Казахстана",
    "answer": "имела сырьевую направленность"
  },
  {
    "title": "В Казахстане в конце 20-х годов XX века был введен алфавит",
    "answer": "латиница"
  },
  {
    "title": "Комиссию содействия Турксибу возглавил председатель Совнаркома республики:",
    "answer": "Н.Нурмаков"
  },
  {
    "title": "Общество «Долой неграмотность» в Казахской АССР организовано в:",
    "answer": "апреле 1924 г."
  },
  {
    "title": "Проект «О формировании Евразийского Союза государств» по инициативе Н.Назарбаева был опубликован в печати в июне:",
    "answer": "1994 г."
  },
  {
    "title": "При силовой мобилизации в 1916 году царской администрацией было призвано казахов:",
    "answer": "150 тыс."
  },
  {
    "title": "В январе 1919 года Красная Армия освободила:",
    "answer": "Оренбург и Уральск"
  },
  {
    "title": "Автор сборника «1000 песен киргизского (казахского) народа»:",
    "answer": "Затаевич"
  },
  {
    "title": "26 июля 1917 года в г. Оренбурге состоялся первый всеказахский съезд, в котором участвовали представители почти из всех областей Казахстана. Что он рассматривал?",
    "answer": "Все вышеи зложенное."
  },
  {
    "title": "В 1929 г., накануне коллективизации, поголовье скота в Казахстане достигло:",
    "answer": "40,5 млн. голов"
  },
  {
    "title": "Кто был избран сардарбеком в ходе восстания 1916г.?",
    "answer": "А.Иманов"
  },
  {
    "title": "Местом пребывания Алаш-Орды временно был избран город:",
    "answer": "Семипалатинск."
  },
  {
    "title": "В 1920-1924 гг. столицей Каз. АССР был город:",
    "answer": "Оренбург."
  },
  {
    "title": "По чьей инициативе был создан комитет по проблемам Балхаша и Арала?",
    "answer": "М. Шаханова"
  },
  {
    "title": "Кому из казахских батыров по народным рассказам посвятил свой первый кюй «Кишкентай»классик казахской инструментальной музыки Курмангазы?",
    "answer": "Исатаю"
  },
  {
    "title": "Кто является автором сборника произведений «Маса» (Комар), опубликованного в 1911 году в Оренбурге?",
    "answer": "Байтурсынов"
  },
  {
    "title": "Кто был наиболее талантливым учеником великого Абая?",
    "answer": "Ш. Кудайбердыев"
  },
  {
    "title": "Кто написал книгу «Оян, казак»?",
    "answer": "М. Дулатов"
  },
  {
    "title": "Когда и в каком городе состоялся первый Всеказахский съезд, в котором участвовали представители почти всех областей Казахстана?",
    "answer": "в г. Оренбурге 21-26 июля 1917 г."
  },
  {
    "title": "Когда была создана партия Алаш?",
    "answer": "1917 г."
  },
  {
    "title": "Какую роль отводил Казахстану Ф. И. Голощекин в ходе индустриализации?",
    "answer": "сырьевая база центральной промышленности"
  },
  {
    "title": "Какие народы насильственно были переселены в Казахстан в феврале 1944 г.?",
    "answer": "все перечисленные"
  },
  {
    "title": "Что послужило поводом для декабрьских событий в Алматы?",
    "answer": "назначение Г. Колбина первым секретарем ЦК"
  },
  {
    "title": "Что означает термин \"стратегия\"?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Назовите ведущий фактор сильных сторон, которыми обладает современный Казахстан (по мнению Президента, высказанному в Послании народу).",
    "answer": "Люди, их воля и знания."
  },
  {
    "title": "В соответствии с постановлением Совета Министров СССР в 1948 году был сооружен ядерный полигон, расположенный на стыке трех областей…",
    "answer": "Семипалатинской, Акмолинской и Карагандинской."
  },
  {
    "title": "Когда была создана Казахская АССР?",
    "answer": "1920 г."
  },
  {
    "title": "Назовите общественного деятеля, ученого - энциклопедиста, одного из лидеров алашского движения, врача, одного из руководителей Уйильского Оляята:",
    "answer": "Досмухамедов Халел"
  },
  {
    "title": "Кто был автором кюев «Сары - Арка», «Кишкентай?",
    "answer": "Курмангазы"
  },
  {
    "title": "Каков был характер восстания 1916 г.?",
    "answer": "национально-освободительный"
  },
  {
    "title": "Кто был редактором газеты «Казах»?",
    "answer": "А. Байтурсынов"
  },
  {
    "title": "Какая организация была создана Тураром Рыскуловым в городе Мерке?",
    "answer": "Революционный союз казахской молодежи"
  },
  {
    "title": "В каком году было создано правительство «Алаш – орда»?",
    "answer": "в 1917 г."
  },
  {
    "title": "В Целинограде (Астана) казахская молодежь выступила против создания немецкой автономии в:",
    "answer": "1979 г."
  },
  {
    "title": "В 1968 году советские войска были введены на территорию…",
    "answer": "Чехословакии"
  },
  {
    "title": "В 1985 году Генеральным секретарем КПСС стал…",
    "answer": "Горбачев"
  },
  {
    "title": "Когда был принята первая Конституция независимого Казахстана?",
    "answer": "28 января 1993 г."
  },
  {
    "title": "Когда было проведено первое ядерное испытание на Семипалатинском полигоне?",
    "answer": "1949 г."
  },
  {
    "title": "Какая форма правления действует в Республике Казахстан согласно действующей Конституции РК?",
    "answer": "Президентская"
  },
  {
    "title": "Каким государством по форме государственного устройства является Казахстан согласно Конституции РК?",
    "answer": "унитарным"
  },
  {
    "title": "Когда состоялась торжественная презентация новой столицы Казахстана-Астаны?",
    "answer": "в июне 1998 года"
  },
  {
    "title": "Когда было произведено первое испытание ядерной бомбы на Семипалатинском полигоне?",
    "answer": "29 августа 1949 г."
  },
  {
    "title": "В каком году произошли трагические события в городе Темиртау?",
    "answer": "1959 г."
  },
  {
    "title": "Выделите основополагающие принципы деятельности РК согласно Конституции?",
    "answer": "Все перечисленное."
  },
  {
    "title": "Укажите, кто из руководителей восстаний был ближе к народу, демократичнее",
    "answer": "Исатай Тайманулы, поддержанный крестьянами, установил реальную власть в Прикаспийском регионе"
  },
  {
    "title": "Начало массового освоения целинных и залежных земель в Казахстане.",
    "answer": "1954 г."
  },
  {
    "title": "За период с 1991 по 1995 гг. в Республику Казахстан начали приезжать, а постоянное место жительства казахи из дальнего зарубежья:",
    "answer": "Китай"
  },
  {
    "title": "Главные направления государственной программы индустриально-инновационного развития на 2003-2015 годы:",
    "answer": "Образование и наука"
  },
  {
    "title": "Военным губернатором Семиреченской области в период восстания 1916 г. был:",
    "answer": "Фольбаум"
  },
  {
    "title": "Особо востребованные специальности в 30-х годах ХХ в.:",
    "answer": "Механизаторы"
  },
  {
    "title": "Фильмы, снятые в годы независимости Республики Казахстан:",
    "answer": "«Кочевник»"
  },
  {
    "title": "Фильмы, снятые в годы независимости авиационный, московский институт цветных металлов, объединившись с Украинским государственным университетом вели значительную работу по:",
    "answer": "Подготовке квалифицированных кадров"
  },
  {
    "title": "В самом начале Великой Отечественной войны была создана Комиссия Академии наук СССР по мобилизации ресурсов следующих регионов Советского Союза:",
    "answer": "Урал"
  },
  {
    "title": "Стрелковая дивизия, сформированная в 1941 г. в Алма-Ате:",
    "answer": "Участвовала в боях за Сталинград"
  },
  {
    "title": "На начальном этапе в 2010-х гг. велась основная экономическая работа в рамках программ, выступивших локомотивами казахстанской экономики:",
    "answer": "первой (2010–2014 годы) индустриально- инновационной пятилетки"
  },
  {
    "title": "В эти годы проходили Всемирные курултаи казахов:",
    "answer": "2002"
  },
  {
    "title": "Лидеры либерально-демократической интеллигенции:",
    "answer": "Байтурсынов"
  },
  {
    "title": "Амангелды Иманов:",
    "answer": "Внук знаменитого батыра Имана"
  },
  {
    "title": "Газета «Қазақ» издавалась в:",
    "answer": "Оренбурге"
  },
  {
    "title": "Во время Великой Отечественной войны Казахстан давал:",
    "answer": "1/8 общесоюзной добычи угля"
  },
  {
    "title": "Приоритетные направления развития экономики и социальной сферы согласно Посланию Президента Республики Казахстан Н.А. Назарбаева народу Казахстана. 1 марта 2006 г. «Стратегия вхождения Казахстана в число 50-ти наиболее конкурентоспособных стран мира. Казахстан на пороге нового рывка вперед в своем развитии»:",
    "answer": "Современная социальная политика, защищающая наиболее «уязвимые» слои населения и поддерживающая развитие экономики"
  },
  {
    "title": "Когда были утверждены новый флаг и герб Республики Казахстан?",
    "answer": "4 июня 1992 г."
  },
  {
    "title": "Когда в Республике Казахстан была введена национальная валюта – тенге?",
    "answer": "15 ноября 1993 г."
  },
  {
    "title": "Кто является символом и гарантом единства народа и государственной власти, незыблемости Конституции в РК?",
    "answer": "Президент."
  },
  {
    "title": "Выберите черты, которыми будет владеть новое поколение через 33 года по убеждению Президента, высказанному в Послании народу (2030)",
    "answer": "все перечисленное"
  },
  {
    "title": "В начале ХХ века бесспорным лидером национальной интеллигенции казахского народа стал",
    "answer": "Алихан Бокейханов"
  },
  {
    "title": "Летом 1905 г. первый опыт политических требовании в Казахстане берет начало с",
    "answer": "Каркаралинской питиции"
  },
  {
    "title": "Редактором журнала «Айкап» был",
    "answer": "Мухамеджан Сералин"
  },
  {
    "title": "Печатным органом партии «Алаш» являлась газета",
    "answer": "Қазақ"
  },
  {
    "title": "Лидером партии «Үш-жүз» был",
    "answer": "К.Тогусов"
  },
  {
    "title": "Партия «Үш жуз» активно потдерживало",
    "answer": "Большевиков"
  },
  {
    "title": "Правильная последовательность переноса столиц в Казахстане выглядит так",
    "answer": "Оренбург – Кызыл-Орда – Алматы"
  },
  {
    "title": "Какое количество областей насчитывается в Казахстане на современном этапе?",
    "answer": "14."
  },
  {
    "title": "Ключевые слова Президента в Послании народу (2030).:",
    "answer": "Процветание, безопасность и улучшение благосостояния."
  },
  {
    "title": "Единственным источником государственной власти в Казахстане в соответствии с Конституцией Республики Казахстан является:",
    "answer": "Народ"
  },
  {
    "title": "Идея создания «строя цивилизованных кооператоров» относится к периоду:",
    "answer": "Коллективизации сельского хозяйства"
  },
  {
    "title": "Когда началось освоение целинных и залежных земель в Казахстане?",
    "answer": "1954"
  },
  {
    "title": "7 основных долгосрочных приоритетов определены Президентом в стратегии:",
    "answer": "«Казахстан-2030»"
  },
  {
    "title": "Казахстан 2030 года:",
    "answer": "Пройдет сложный путь и вступит в следующий этап развития."
  },
  {
    "title": "Кто, по мнению Президента, высказанному в Послании народу (2030), является ведущей опорой и стабилизирующим фактором нашего государства на современном этапе?",
    "answer": "средний класс"
  },
  {
    "title": "Какой внешний фактор, способствующий дальнейшему развитию Казахстана, подчеркивает Президент в Послании народу (2030)?",
    "answer": "выгодное географическое положение"
  }
]