module.exports = [
  {
    "title": "Концепция  вычислительной  сети  физических  предметов  оснащённых  встроенными технологиями  для  взаимодействия  друг с другом или  с внешней средой",
    "answer": "Интернет вещей(internet of Things)"
  },
  {
    "title": "Эргономика это",
    "answer": "научная дисциплина, которая изучает сложные функциональные возможности человека в трудных и бытовых процессах"
  },
  {
    "title": "Сердце (и мозг) компьютера это",
    "answer": "CPU(процессор)"
  },
  {
    "title": "Государственная программа Casinoв рамках которой осуществляется сбор проектов по направлениям",
    "answer": "Возобновляемые источники энергии"
  },
  {
    "title": "ISO обозначает",
    "answer": "Международные организации для стандартизации"
  },
  {
    "title": "Отдельная пользовательская компьютерная система, подобная персональному компьютеру, но имеющая более мощные микропроцессоры",
    "answer": "Супер компьютер"
  },
  {
    "title": "Перевести десятичное число 38 в двоичную систему счисления",
    "answer": "100110"
  },
  {
    "title": "Надежность функционирования комплекса программ и возможный риск от его применения для людей, бизнеса и внешней среды",
    "answer": "Безопасность"
  },
  {
    "title": "Потребительский показатель качества информации, обеспечивающийся выполнением соответствующих процедур ее получения и преобразования",
    "answer": "Доступность"
  },
  {
    "title": "Компьютеры, выполняющие преобразование доменного имени в числовой IP-адрес",
    "answer": "DNS-сервера"
  },
  {
    "title": "Базы данных. Поле",
    "answer": "Указатель на связанную таблицу"
  },
  {
    "title": "Число 1DE шестнадцатеричной системы счисления в десятичной системе счисления имеет вид",
    "answer": "478"
  },
  {
    "title": "Компьютер, управляющий сетью и дающий доступ сетевым пользование к своим ресурсам.",
    "answer": "Сервер"
  },
  {
    "title": "Видео состоят из последовательности.",
    "answer": "Фреймов"
  },
  {
    "title": "Однопользовательская однозначная компьютерная операционная система которая использует интерфейс командной строки.",
    "answer": "MS-DOS"
  },
  {
    "title": "Стандартный язык запросов для работы с реляционными базами данных.",
    "answer": "SQL"
  },
  {
    "title": "Информация, обработанная и завершенная на информационном носителе это.",
    "answer": "данные"
  },
  {
    "title": "Устройство которое позволяет компьютерам обмениваться данными по телефонной линии.",
    "answer": "Модем"
  },
  {
    "title": "Что отражает и реализует концепцию, определяющую модель, структуру,выполняемые функции и взаимосвязь всех компонентов информационных систем (ИС).",
    "answer": "Архитектура информационной системы"
  },
  {
    "title": "Мобильная операционная система, разработанная Google, основанная на ядре Linux и предназначенная для сенсорных мобильных устройств таких как смартфоны и планшеты.",
    "answer": "Android"
  },
  {
    "title": "Число 101 двоичной системы счислении в десятичной системе счисления имеет вид.",
    "answer": "5"
  },
  {
    "title": "Число D в шестнадцатеричной системе счисления соответствует в десятичной системе счисления числу.",
    "answer": "13"
  },
  {
    "title": "Набор программ, предназначенных для решения конкретного класса задач ( функциональная подсистема. Бизнес приложение)",
    "answer": "Пакет прикладных программ"
  },
  {
    "title": "Интернет это?",
    "answer": "Крупнейшая в мире коммуникационная сеть компьютеров"
  },
  {
    "title": "Роботизация-это",
    "answer": "автоматизацияпроизводства с использованием  промышленных  роботов"
  },
  {
    "title": "Программное обеспечение или сценарий, доступный через интернет для поиска документов и файлов по ключевым словам и результатом любых файл содержащих эти ключевые слова",
    "answer": "Поисковая система"
  },
  {
    "title": "Наука о методах и процессах сбора , хранения ,передачи, анализа и оценки информации с применением компьютерных технологий",
    "answer": "информатика"
  },
  {
    "title": "Число А шестнадцатеричной системе счисления соответствует в десятичной системе счисления числу",
    "answer": "10"
  },
  {
    "title": "Форма деловых сделок,при которой взаимодействие сторон осуществляется с помощью компьютерных сетей, обмена электронными документами",
    "answer": "Электронный бизнес"
  },
  {
    "title": "Создание движения изображения с помощью компьютера",
    "answer": "компьютерная анимация"
  },
  {
    "title": "Перевести двоичное число 110111 в 16–ричную систему счисления",
    "answer": "37"
  },
  {
    "title": "MSExcel  знак операции возведении  в степень",
    "answer": "^"
  },
  {
    "title": "Модель продаж товаров и услуг  одного потребителя другим",
    "answer": "C2C"
  },
  {
    "title": "Схема именованные однородного  локатора ресурсов, предоставляющая пользователям  способ получить доступ к Веб-ресурсам используемый однородное обозначения  при обращении к  Веб-ресурсам",
    "answer": "URL"
  },
  {
    "title": "Масштабный государственный проект, включенный в Государственную программу развития образования Республики Казахстан на 2011-2021 годы.",
    "answer": "Развитие информатизаций образования"
  },
  {
    "title": "Особенности HDD.",
    "answer": "120Gb"
  },
  {
    "title": "Научное направление, в рамках которого ставятся и решаются задачи аппаратного или программного моделирования тех видов человеческой деятельности, которые традиционно считаются интеллектуальными.",
    "answer": "Искусственный интеллект"
  },
  {
    "title": "Домены, принадлежащие муниципальным или коммерческим организациям.",
    "answer": "Домены первого уровня"
  },
  {
    "title": "Схема, предоставляющая пользователям способ получить доступ к Веб-ресурсам, используемый Однородные обозначения при обращений к веб-ресурсам.",
    "answer": "URL"
  },
  {
    "title": "Сообщество представителей. Предоставляющее управление пользователям сети Интернет",
    "answer": "ISOC (internet Society)"
  },
  {
    "title": "Мультимедиа это",
    "answer": "область, связанная с производством анимационных фильмов и обработки видео файлов"
  },
  {
    "title": "Число 10101010 двоичной системы в шестнадцатеричной  системе счисления имеет вид",
    "answer": "АА"
  },
  {
    "title": "MSExcel  смысл ошибки #значение!",
    "answer": "формула использует неправильный тип операнда или аргумента"
  },
  {
    "title": "Понятие «частное облако»",
    "answer": "безопасная ИТ-инфраструктура, контролируемая и эксплуатируемая в интересах  одной-единственной организации"
  },
  {
    "title": "Наука о приспособлении рабочих мест, предметов и объектов труда, а также компьютерных программ для наиболее безопасного и эффективного труда",
    "answer": "Эргономика"
  },
  {
    "title": "Анализ накопления информации, которая выполняется быстро или через определенные промежутки и позволяет гарантировать пользователю, изменять последовательность событий",
    "answer": "аудит"
  },
  {
    "title": "Обработка данных, предшествующая классификации, позволяющая создавать новые группы и классы",
    "answer": "Кластеризация"
  },
  {
    "title": "Коллекция программ той или иной системы программирования",
    "answer": "Библиотека программ"
  },
  {
    "title": "Формат звукового файла инструментального звучания: пианино, гитара, дудочка, орган, контрабас и т.д., занимающий мало места на диске",
    "answer": "MP3"
  },
  {
    "title": "Вид соединения между таблицами непредусмотреное в  Microsoft Access?",
    "answer": "альфа-соединение"
  },
  {
    "title": "Укажите какую функцию может исполнять рабочая станция в составе компьютерной сети",
    "answer": "Клиент или сервер"
  },
  {
    "title": "Как называется топология, еcли кoмпьютepы пoдключeнывдoль oднoгo кaбeля [ceгмeнтa (segment)]?",
    "answer": "Шинoй"
  },
  {
    "title": "Процессор обрабатывает информацию…",
    "answer": "в двоичном коде"
  },
  {
    "title": "Класс программ, не относящихся к антивирусным:",
    "answer": "программы сканирования"
  },
  {
    "title": "Для создания шаблона бланка со сложным форматированием необходимо вставить в документ:",
    "answer": "таблицу"
  },
  {
    "title": "Множество данных определенной структуры, с которыми могут работать одна или несколько прикладных программ– это:",
    "answer": "база данных"
  },
  {
    "title": "Поле которое однозначно идентифицирует каждый объект в таблице, т.е. позволяет четко отличить один объект от другого– это:",
    "answer": "ключевое поле"
  },
  {
    "title": "Как называется компьютер в составе сети ,который стоит на информационном обслуживании со стороны другого компьютера сети?",
    "answer": "Клиент"
  },
  {
    "title": "К устройствам накопления информации относится:",
    "answer": "ВЗУ"
  },
  {
    "title": "В каком файле может храниться рисунок?",
    "answer": "CREML.BMP"
  },
  {
    "title": "Электронная таблица —это:",
    "answer": "компьютерный эквивалент обычной таблицы"
  },
  {
    "title": "Основным элементом электронных таблиц является:",
    "answer": "ячейка"
  },
  {
    "title": "Основную структуру текстового документа определяет:",
    "answer": "шаблон"
  },
  {
    "title": "Укажите правильное определение URL",
    "answer": "Указатель символьного вида для доступа на Web- сайт Интернет."
  },
  {
    "title": "Какие существуют методы реализации антивирусной защиты?",
    "answer": "Программные, аппаратные, организационные"
  },
  {
    "title": "Укажите какие программы из нижеперечисленных относятся к антивирусным",
    "answer": "AVP, DrWeb, Avast"
  },
  {
    "title": "Компьютер, подключенный к Интернет, обязательно имеет...",
    "answer": "IP-адрес"
  },
  {
    "title": "Какой протокол используется для передачи в сети web-страниц и спользуется протокол...",
    "answer": "http"
  },
  {
    "title": "Слово \"модулятор\" означает …",
    "answer": "модернизация сигнала"
  },
  {
    "title": "Слово \"демодулятор\" означает…",
    "answer": "де модернизация сигнала"
  },
  {
    "title": "Что такое провайдер?",
    "answer": "организация (юридическое лицо, обеспечивающая работу в сети Интернет)"
  },
  {
    "title": "Что такое FTP?",
    "answer": "протокол передачи файлов"
  },
  {
    "title": "Как называется мощный Компьютер в вычислительных сетях, который поддерживает структуру сети и на которой инсталлированы основные программные продукты:",
    "answer": "Сервер"
  },
  {
    "title": "Язык разметки гипертекста-это:",
    "answer": "HTML"
  },
  {
    "title": "Электронная почта передает адресату чере зкомпьютерные сети письма в коде?",
    "answer": "Двоичном"
  },
  {
    "title": "К электронной коммерции относят:",
    "answer": "Электронное движение капитала"
  },
  {
    "title": "При помощи какого языка создаются Web-страницы?",
    "answer": "HTML"
  },
  {
    "title": "Назовите функции ОЗУ",
    "answer": "накопление и хранение данных оперативного доступа"
  },
  {
    "title": "Что такое серверы?",
    "answer": "Это кoмпьютepы пpeдocтaвляющиe cвoи pecypcы ceтeвым пoльзoвaтeлям"
  },
  {
    "title": "Укажите основные типы компьютерных вирусов",
    "answer": "Программные, загрузочные, макровирусы"
  },
  {
    "title": "Укажите формат представления информации в Web-странице",
    "answer": "Формат HTML"
  },
  {
    "title": "Локальная вычислительная сеть –это",
    "answer": "Компьютерная сеть, размещенная в пределах одного помещения или здания"
  },
  {
    "title": "Компьютерная сеть это:",
    "answer": "два и более компьютеров, объединенных средствами информационных коммуникаций"
  },
  {
    "title": "Жизненный цикл БД содержит две фазы:",
    "answer": "Проектирования, реализация"
  },
  {
    "title": "Как называется указание адреса ячейки в Microsoft Excel?",
    "answer": "ссылка"
  },
  {
    "title": "Какой формат используется в Microsoft Excel по умолчанию, обеспечивая запись числовых данных в ячейках в том же виде, как они вводятся или вычисляются:",
    "answer": "основной"
  },
  {
    "title": "Web сайт – это:",
    "answer": "набор связанных друг с другом документов, для связи таких документов используются гиперссылки"
  },
  {
    "title": "Personal Web Server – это:",
    "answer": "программа, с помощью которой мы можем регулировать работу Web сервиса."
  },
  {
    "title": "Укажите базовый протокол в Интернет.",
    "answer": "TCP/IP"
  },
  {
    "title": "Гиперссылки на web – странице могут обеспечить переход...",
    "answer": "на любую web - страницу любого сервера Интернет"
  },
  {
    "title": "Что такое домен ?",
    "answer": "часть адреса, определяющая адрес компьютера пользователя в сети"
  },
  {
    "title": "URL адрес – это …",
    "answer": "адрес, на котором расположен ресурс;"
  },
  {
    "title": "Точка экранного изображения называется",
    "answer": "пикселом"
  },
  {
    "title": "Укажите главный недостаток локальных сетей?",
    "answer": "необходимость дополнительных затрат на оборудование и обслуживание сети"
  },
  {
    "title": "Toпoлoгия ceти xapaктepизyeт",
    "answer": "физичecкoe pacпoлoжeниe кoмпьютepoв, кaбeлeй и дpyгиx кoмпoнeнтoв ceти"
  },
  {
    "title": "Укажите какие программы из ниже перечисленных относятся к антивирусным",
    "answer": "AVP, DrWeb, Avast"
  },
  {
    "title": "Информацию, не зависящую от личного мнения или суждения, называют:",
    "answer": "объективной"
  },
  {
    "title": "В кодировке Unicode на каждый символ отводится два байта. Определите информационный объем слова из двадцати шести символов в этой кодировке.",
    "answer": "416 бит"
  },
  {
    "title": "Что такое ярлык?",
    "answer": "указатель на объект"
  },
  {
    "title": "Алгоритм, в котором выполнение действия зависит от поставленного условия, называется",
    "answer": "Алгоритмом ветвления"
  },
  {
    "title": "Из скольких этапов состоит разработка моделей в среде электронных таблиц",
    "answer": "4"
  },
  {
    "title": "В электронной таблице выделен диапазон ячеек A1:C4. Сколько ячеек содержит данный диапазон?",
    "answer": "12"
  },
  {
    "title": "Укажите абсолютную ссылку",
    "answer": "A4"
  },
  {
    "title": "Информационно-поисковые системы делятся на:",
    "answer": "Поисковые, информационные"
  },
  {
    "title": "Объектно-ориентированное программирование – это…",
    "answer": "Метод программирования, при использовании которого главными элементами программ являются объекты"
  },
  {
    "title": "Что такое модификаторы?",
    "answer": "Инструменты для измерения изображения"
  },
  {
    "title": "Укажите материал, который используется для создания сеточного каркаса модели.",
    "answer": "Wire"
  },
  {
    "title": "Что не относится к методам поиска?",
    "answer": "Программный поиск"
  },
  {
    "title": "Из какого места на компьютере производится установка и удаление программ?",
    "answer": "Панель управления"
  },
  {
    "title": "Определите значение переменной x после выполнения следующего фрагмента программы: a:=7;b:=22; a:=b-a*3; if a>b then x:=a+b else x:=b-a",
    "answer": "21"
  },
  {
    "title": "Какой формат в Microsoft Excel обеспечивает представление чисел в ячейка с заданной точностью, определяемой пользователем десятичной точки:",
    "answer": "с фиксированным количеством десятичных знаков"
  },
  {
    "title": "Какой формат в Microsoft Excel обеспечивает представление введенных данных в формате процентов в соответствии с установленным количеством десятичных знаков:",
    "answer": "процентный"
  }
]