module.exports = [
  {
    "title": "Философия возникла",
    "answer": "одновременно в Древних Индии, Китае и Греции"
  },
  {
    "title": "Первоначальное значение понятия “диалектика”:",
    "answer": "искусство спора"
  },
  {
    "title": "Пантеизм - это:",
    "answer": "учение, отрицающее личного Бога и приближающее его к природе, отождествляя их"
  },
  {
    "title": "Одно из важнейших сочинений К. Поппера, посвященное проблеме развития общества  ",
    "answer": "Открытое общество и его враги"
  },
  {
    "title": "Гносеологический оптимизм означает признание",
    "answer": "принципиальной познаваемости мира"
  },
  {
    "title": "Наука как специфический тип духовного производства и социальный институт возникла в эпоху:",
    "answer": "Нового времени"
  },
  {
    "title": "Как К.Маркс решает вопрос о соотношении общественного бытия и общественного сознания?",
    "answer": "Общественное бытие (общественное производство) определяет общественное сознание"
  },
  {
    "title": "Воззрение, которое основывается на ценности человека как личности, праве человека на свободу, счастье, благополучие:",
    "answer": "Гуманизм"
  },
  {
    "title": "Организация западных ученых, социологов, общественных деятелей, сформулировавшая понятие \"глобальные проблемы\"",
    "answer": "\"Римский клуб\""
  },
  {
    "title": "Принцип, утверждающий Бога в качестве первопричины мира, но отрицающий при этом его вмешательство в дальнейшее развитие мироздания….",
    "answer": "деизм"
  },
  {
    "title": "Что означает термин «коэволюция»:",
    "answer": "совместное, взаимосогласованное развитие человека и природы"
  },
  {
    "title": "Философы, которые относятся к арабской средневековой философии?",
    "answer": "Аль-Фараби, Ибн-Сина, Ибн-Рушд"
  },
  {
    "title": "Кто из мыслителей создал философскую поэму «Кутадгу  билик»?",
    "answer": "Ж. Баласагуни "
  },
  {
    "title": "Какое направление русской философии фокусируется на судьбах России и ее роли в мировом историческом процессе?",
    "answer": "Западничество\t"
  },
  {
    "title": "Как называется направление в русской философии ХIХ в., основанное на вере в православие и народность, идее общины?",
    "answer": "Анархизм"
  },
  {
    "title": "В чем Ф. Достоевский видит сущность человека?",
    "answer": "Сущность человека иррациональна и скрыта, проявляется через внутренний мир и в ситуации выбора "
  },
  {
    "title": "Кому принадлежит идея обуздание человеческого эгоизма, влекущего за собой «войну всех против  всех»  является  причиной,  обуславливающей  необходимость государства  и  права.",
    "answer": "Т. Гоббсу"
  },
  {
    "title": "Фундаментальное понятие философии  К. Юнга:",
    "answer": "рхетип коллективного бессознательного "
  },
  {
    "title": "Что было предметом размышлений Асан- Кайгы?",
    "answer": "Жизнь человека на родной земле, счастье и смысл его жизни "
  },
  {
    "title": "Основной философский труд Шакарима  — “Три …”:",
    "answer": "Истины "
  },
  {
    "title": "Какие идеи развиваются во второй половине ХIХ века в Казахстане?",
    "answer": "Просвещения "
  },
  {
    "title": "Философское направление, признающее разум за основу познания:",
    "answer": "Рационализм"
  },
  {
    "title": "В философии «агностицизм» понимается как:",
    "answer": "полное или частичное отрицание принципиальной возможности познания"
  },
  {
    "title": "Важнейшей особенностью философии является то, что она:",
    "answer": "всегда ставит непреходящие, вечные вопросы человеческого бытия "
  },
  {
    "title": "Под понятием «исторический тип философии» понимается:",
    "answer": "философы разных взглядов и убеждений, но сформировавшиеся в едином пространстве и времени культуры "
  },
  {
    "title": "Наука, согласно Шакариму Кудайбердиеву, предлагаемая для введения в систему образования?",
    "answer": "Наука о совести "
  },
  {
    "title": "Что такое сублимация?",
    "answer": "Перемещение бессознательной энергии в деятельность"
  },
  {
    "title": "Философское направление, признающее существование двух независимых начал, субстанций:",
    "answer": "дуализм "
  },
  {
    "title": "Универсальной формой существования материи является:",
    "answer": "движение "
  },
  {
    "title": "З. Фрейду принадлежит открытие проблемы",
    "answer": "бессознательного "
  },
  {
    "title": "Что можно отнести к основным признакам постиндустриального общества",
    "answer": "Информацию и знание"
  },
  {
    "title": "Термин «Глобальная деревня» ввел",
    "answer": "М. Маклюэн"
  },
  {
    "title": "Поскольку истина не зависит от познающего субъекта, она:",
    "answer": "объективна "
  },
  {
    "title": "Вид познания в жизнедеятельности субъекта, не обладающий доказательной силой, называется:",
    "answer": "обыденным "
  },
  {
    "title": "Понятие, противоположное по смыслу «истине» в гносеологии:",
    "answer": "заблуждение "
  },
  {
    "title": "Форма мышления, отражающая предельно общие закономерные связи, стороны, признаки явлений, закрепляемые в определениях:",
    "answer": "категория "
  },
  {
    "title": "Что означает «пограничная ситуация» в экзистенциализме?",
    "answer": "Ситуацию между жизнью и смертью "
  },
  {
    "title": "Согласно учению Ницше, место умершего бога должен занять",
    "answer": "верхчеловек"
  },
  {
    "title": "Как Ж.П.Сартр определяет свободу?",
    "answer": "Свобода- это способ бытия человека, это выбор, на что обречен человек и за что он несет ответственность"
  },
  {
    "title": "Какие формы движения характерны неживой материи согласно классификации форм движения Ф.Энгельса?",
    "answer": "Механическая, физическая, химическая "
  },
  {
    "title": "Бытие – это… ",
    "answer": "философское понятие, обозначающее все, что существует "
  },
  {
    "title": "Сократ придерживался мнения, что высшей ценностью является",
    "answer": "добродетель"
  },
  {
    "title": "Что такое герменевтика?",
    "answer": "Искусство и теория истолкования текстов "
  },
  {
    "title": "Учение о морали, нравственности ",
    "answer": "Этика"
  },
  {
    "title": "Кто впервые в мировой науке заговорил о пагубности роста населения?",
    "answer": "Мальтус "
  },
  {
    "title": "Эстетика – это",
    "answer": "Раздел философии"
  },
  {
    "title": "Как называется философское учение о развитии, о всеобщих связях и взаимодействии?",
    "answer": "Диалектика"
  },
  {
    "title": "Ведущая роль в постиндустриальном обществе принадлежит",
    "answer": "Информационным технологиям"
  },
  {
    "title": "Рефлексивный тип мировоззрения:",
    "answer": "Философия"
  },
  {
    "title": "Как называется в философии теория познания",
    "answer": "гносеология"
  },
  {
    "title": "Как называется уровень научного познания, который обобщает данные опыта и выводит из них концепции?",
    "answer": "Теоретический \t"
  },
  {
    "title": "Как называется уровень научного познания, основу которого составляет опыт, наблюдение?",
    "answer": "Эмпирический\t"
  },
  {
    "title": "Как называется совокупность принципов, приемов, правил, которыми надо руководствоваться в процессе познания?",
    "answer": "Метод\t"
  },
  {
    "title": "Основные проблемы этики",
    "answer": "проблема критериев добра и зла"
  },
  {
    "title": "Какая форма мышления отражает общие, существенные признаки и свойства предметов и явлений?",
    "answer": "понятие "
  },
  {
    "title": "Как называется истина, содержание которой не зависит от человека?",
    "answer": "Объективная истина "
  },
  {
    "title": "Основными составляющими суфизма принято считать:",
    "answer": "Аскетизм и мистицизм"
  },
  {
    "title": "Что такое искусство как форма общественного сознания? ",
    "answer": "Отражение мира в художественных образах и преобразование мира по законам красоты "
  },
  {
    "title": "Научные знания отличаются от других знаний:",
    "answer": "доказательностью и обоснованностью "
  },
  {
    "title": "Что является предметом социальной философии?",
    "answer": "Общество \t"
  },
  {
    "title": "В число основных вопросов философии истории входят:",
    "answer": "критерии исторического прогресса"
  },
  {
    "title": "Главное в триединстве “воли, разума, сердца” Абая:",
    "answer": "Сердце"
  },
  {
    "title": "Какой признак характерен для постиндустриального общества",
    "answer": "Приоритет отдается сфере услуг"
  },
  {
    "title": "Что такое общественно- экономическая формация?",
    "answer": "Этап развития, форма общества в основе которого лежит определенный способ производства "
  },
  {
    "title": "Среди представителей казахской интеллигенции, которые внесли наиболее существенный вклад в развитие казахской философии начала ХХ в. огромную роль сыграли",
    "answer": "Миржакып Дулатов, Ахмет Байтурсынов"
  },
  {
    "title": "Какое положение лучше всего выражает суть идеалистического понимания истории?",
    "answer": "Идеи правят миром "
  },
  {
    "title": "Что такое общество?",
    "answer": "Это социальная реальность, сущность которой состоит в отношениях и связях между людьми, складывающиеся в процессе их деятельности "
  },
  {
    "title": "Укажите исторические типы мировоззрения, предшествовавшие философскому",
    "answer": "Религиозное, мифологическое"
  },
  {
    "title": "Какое из перечисленных понятий можно отнести к философским категориям",
    "answer": "бытие "
  },
  {
    "title": "В чем просветители видели источник исторического прогресса? ",
    "answer": "В развитии человеческого разума, науки, образовании, воспитании человека\t"
  },
  {
    "title": "Назовите представителя философского идеализма",
    "answer": "Г. Гегель "
  },
  {
    "title": "Что можно отнести к ведическим текстам",
    "answer": "Упанишады "
  },
  {
    "title": "Назовите представителей философского материализма",
    "answer": "К. Маркс "
  },
  {
    "title": "Укажите характерные особенности большинства философских учений Древней Индии",
    "answer": "большое значение уделялось практическим этико-психологическим проблемам "
  },
  {
    "title": "Укажите основные проблемы философии Конфуция",
    "answer": "искусство управления государством, воспитание человека"
  },
  {
    "title": "Согласно философии И. Канта с какими трудностями сталкивается человек в процессе познания:",
    "answer": "ограниченность познавательных возможностей "
  },
  {
    "title": "Какие черты раскрывают сущность средневековой западноевропейской философии",
    "answer": "Теоцентризм, креационизм"
  },
  {
    "title": "Укажите отличительные особенности философского мышления в эпоху Возрождения:",
    "answer": "антропоцентризм "
  },
  {
    "title": "Укажите труды аль-Фараби",
    "answer": "Трактат о взглядах жителей добродетельного города "
  },
  {
    "title": "Кто из российских ученых развивал космическую философию:",
    "answer": "В.И. Вернадский "
  },
  {
    "title": "Кто из представителей русской философии были известными славянофилами",
    "answer": "А.С. Хомяков, И. П. Киреевский"
  },
  {
    "title": "В чем состоит сущность цивилизационной теории исторического развития?",
    "answer": "История предстает как развитие и смена самостоятельных, ничем не связанных друг с другом цивилизаций "
  },
  {
    "title": "В чем состоит сущность формационной теории исторического развития?",
    "answer": "История общества предстает как закономерная смена общественно- экономических формаций"
  },
  {
    "title": "В чем формационная теория видит источник развития общества? ",
    "answer": "В противоречии между производительными силами и производственными отношениями"
  },
  {
    "title": "Философские произведения эпохи Возрождения, которые носят социально-утопический характер",
    "answer": "Город Солнца "
  },
  {
    "title": "Античная философия - это учения:",
    "answer": "Древней Греции и Древнего Рима "
  },
  {
    "title": "Каково марксистское понимание сущности человека?",
    "answer": "Социально- трудовое\t"
  },
  {
    "title": "В каком понятии обозначается уникальность, неповторимость, самобытность человека во всем богатстве его свойств и качеств?",
    "answer": "Индивидуальность\t"
  },
  {
    "title": "Исторически многие гуманитарные и естественные науки",
    "answer": "c течением времени отделились от философии и стали самостоятельными "
  },
  {
    "title": "Философские категории:",
    "answer": "отражают наиболее общие связи и отношения реальности "
  },
  {
    "title": "Для философии и методологии Р. Декарта характерно:",
    "answer": "призыв подвергать сомнению абсолютно все"
  },
  {
    "title": "Философия Нового времени",
    "answer": "период который называют эпохой научной революции "
  },
  {
    "title": "Что характеризует понятие «личность» в человеке?",
    "answer": "Социальное "
  },
  {
    "title": "Произведение Ж. Деррида",
    "answer": "О грамматологии"
  },
  {
    "title": "Материализм:",
    "answer": "философская теория, основанная на предположении о том, что в мире не существует ничего, помимо материи "
  },
  {
    "title": "Какие формы отражения выделяются в процессе развития материи?",
    "answer": "Пассивное отражение в неживой материи, активное отражение в живой материи, психическое отражение, сознание "
  },
  {
    "title": "Синергетика:",
    "answer": "Теория самоорганизации сложных систем "
  },
  {
    "title": "Какая идея характеризует воззрения Дж. Бруно:",
    "answer": "Идея бесконечности вселенной "
  },
  {
    "title": "Как называется процесс формирования социальных качеств человека, усвоения индивидом определенной системы знаний, норм и ценностей?",
    "answer": "Социализация\t"
  },
  {
    "title": "Представитель философии персонализма, в которой личность и ее духовные ценности признаются высшим смыслом земной цивилизации:",
    "answer": "Н.А Бердяев "
  },
  {
    "title": "В центре философии представителей экзистенциализма находится проблема человеческой свободы:",
    "answer": "Ж.П. Сартр,  К. Ясперс"
  },
  {
    "title": "Как называется социальный пол, т.е. социокультурный конструкт, который общество надстраивает над физиологической реальностью?",
    "answer": "Гендер\t"
  },
  {
    "title": "Аскетизм в этике:",
    "answer": "отказ от мирских благ и наслаждений "
  },
  {
    "title": "Прагматизм как направление в философии морали исходит из того, что",
    "answer": "смысл жизни усматривает в достижении успеха"
  },
  {
    "title": "Раздел прикладной этики",
    "answer": "Биоэтика "
  },
  {
    "title": "Что такое самосознание?",
    "answer": "Способность сознания отражать свое собственное содержание "
  },
  {
    "title": "Кто разработал учение о том, что решающим фактором развития культуры и цивилизации является ответ на вызов истории или природы?",
    "answer": "А.Тойнби"
  },
  {
    "title": "Какие цивилизации О.Шпенглер называет локальными? ",
    "answer": "Самостоятельные, ничем не\tсвязанные друг с другом цивилизации, адаптированные к природной среде "
  },
  {
    "title": "Как называется философская теория, предметом которой выступают природа ценностей?",
    "answer": "Аксиология"
  },
  {
    "title": "Цивилизационный подход, а также циклическое представление исторического развития характерно для работ:",
    "answer": "А. Тойнби, О. Шпенглера"
  },
  {
    "title": "Кто обосновал классовый подход в понимании ценностей? ",
    "answer": "К.Маркс\t"
  },
  {
    "title": "К числу основных методологических подходов к исследованию истории человечества относится:",
    "answer": "цивилизационный подход"
  },
  {
    "title": "Кто из философов утверждал, что все, к чему прикасается наука, дегуманизируется, поскольку перманентная цель науки – покорение природы?",
    "answer": "А. М. Хайдеггер"
  },
  {
    "title": "Географический детерминизм:",
    "answer": "концепция, согласно которой географические условия предопределяют развитие общества"
  },
  {
    "title": "Различают следующие направления развития",
    "answer": "Прогресс и регресс"
  },
  {
    "title": "Восходящее развитие или прогресс:",
    "answer": "движение от простого к сложному, от низшего к высшему"
  },
  {
    "title": "Наиболее существенным и всеохватывающим для начала современной НТР явилось:",
    "answer": "Автоматизация производства"
  },
  {
    "title": "Эвтаназия означает:",
    "answer": "«тихая» смерть"
  },
  {
    "title": "Основные признаки “субкультуры”",
    "answer": "автономность, альтернативность, контрарность"
  },
  {
    "title": "Специфика философии:",
    "answer": "в стремлении познать мир в его всеобщности и целостности"
  },
  {
    "title": "Элементы социальной системы:",
    "answer": "Государство, право, мораль, религия "
  },
  {
    "title": "Мировоззрение представляет собой ",
    "answer": "систему взглядов, определяющих общее понимание мира и места человека в мире"
  },
  {
    "title": "Майевтика:",
    "answer": "сократовский метод установления истины"
  },
  {
    "title": "Религия как форма общественного сознания – это:",
    "answer": "Совокупность взгляда отражающих веру в Бога "
  },
  {
    "title": "Регресс – это ",
    "answer": "Деградация природы и общества"
  },
  {
    "title": "Основное понятие философии Ф. Ницше:",
    "answer": "воля к власти"
  },
  {
    "title": "Представитель философии суфизма",
    "answer": "Яссауи"
  },
  {
    "title": "Как называется духовное образование, выражающее отношение человека к предмету, значимому для него?",
    "answer": "Ценность\t"
  },
  {
    "title": "Кто обосновал необходимость\tпереоценки ценностей в  европейской культуре и является автором «неприятных» истин?",
    "answer": "Ф.Ницше\t"
  },
  {
    "title": "Кто впервые ввел понятие «ценность»?",
    "answer": "Р.Лотце\t"
  },
  {
    "title": "К теоретическим методам познания относится:",
    "answer": "идеализация "
  },
  {
    "title": "Р. Декарт:",
    "answer": "Утверждал, что «Я мыслю – следовательно, я существую»"
  },
  {
    "title": "Основные понятия, связанные с Родиной, которые занимают центральное место в иерархии ценностей у казахов:",
    "answer": "Атамекен, кіндік қаны тамған жер"
  },
  {
    "title": "Специфика казахской философии:",
    "answer": "отражала особенности кочевой культуры и развивалась в форме поэзии"
  },
  {
    "title": "Объяснение сущности сознания и его происхождения в религиозно-философских учениях",
    "answer": "человек рассматривается как творение Бога"
  },
  {
    "title": "Процесс получения знания предполагает взаимодействие",
    "answer": "Субъекта и объекта"
  },
  {
    "title": "По вопросу о роли чувственного и рационального в процессе познания в истории философии сложились две прямо противоположные точки зрения:",
    "answer": "Рационализм и эмпиризм"
  },
  {
    "title": "Гносеология - это учение:",
    "answer": "о сущности познания "
  },
  {
    "title": "Автор теории «Двойственной истины»",
    "answer": "Ибн-Рушд"
  },
  {
    "title": "Уровни научного познания:",
    "answer": "Эмпирический и теоретический "
  },
  {
    "title": "Практику возможно определить как:",
    "answer": "Основу и источник познания"
  },
  {
    "title": "Рефлексия – это",
    "answer": "Принцип мышления, направленный на осмысление и осознание самого себя"
  },
  {
    "title": "Абсолютизация позитивной роли науки в жизни общества, в системе культуры:",
    "answer": "сциентизм"
  },
  {
    "title": "Классическое общефилософское утверждение гласит, что личность человеческая …",
    "answer": "Социальна по своей природе"
  },
  {
    "title": "Факторы, позволивший человечеству выделиться из природной среды — …",
    "answer": "Трудовая деятельность, общение"
  },
  {
    "title": "Детерминизм является учением:",
    "answer": "о всеобщей закономерной связи, причинно-следственной обусловленности явлений"
  },
  {
    "title": "Философы периода Казахского Просвещения:",
    "answer": "Шокан Валиханов, Ыбырай Алтынсарин"
  },
  {
    "title": "Вопрос о смысле и ценности жизни связан с проблемами:",
    "answer": "смерти и бессмертия человека"
  },
  {
    "title": "Идеал:",
    "answer": "выражает высшую цель стремлений и деятельности человека"
  },
  {
    "title": "Деонтология - это:",
    "answer": "теория долга "
  },
  {
    "title": "Понимание свободы Ж.-П. Сартра характеризует тезис:",
    "answer": "Свобода – это свобода выбора, которую никто не может отнять у человека"
  },
  {
    "title": "Волюнтаризм наиболее характерен для этического иррационализма:",
    "answer": "Шопенгауэра, Ницше"
  },
  {
    "title": "Представителем философии эпохи Возрождения является:",
    "answer": "Н. Кузанский"
  },
  {
    "title": "Идея антропоцентризма принадлежит эпохе",
    "answer": "Возрождения"
  },
  {
    "title": "Что являлось центральной проблемой в философии Н. Кузанского:",
    "answer": "ученое незнание"
  },
  {
    "title": "Философ Нового времени, который ввел термин «монада» как духовную единицу бытия:",
    "answer": "Лейбниц"
  },
  {
    "title": "О характере изменений мира в целом учит:",
    "answer": "диалектика"
  },
  {
    "title": "Принцип «двойственной истины» заключает в себе:",
    "answer": "разделение научной и религиозной истин"
  },
  {
    "title": "Ф. Бекон различает четыре вида идола или призраков. Определите, что не относится к идолам, признакам?",
    "answer": "Идолы Вселенной"
  },
  {
    "title": "О врожденных идеях было изложено в философии рационализма 17 в.",
    "answer": "Декартом"
  },
  {
    "title": "Понятие субстанции характерно для философии:",
    "answer": "Р. Декарта"
  },
  {
    "title": "Основным методом получения истинных фактов считал дедукцию:",
    "answer": "Р. Декарт"
  },
  {
    "title": "Проблему онтологии Р. Декарт решает:",
    "answer": "дуалистически"
  },
  {
    "title": "Учение о единой субстанции разработал:",
    "answer": "Б. Спиноза"
  },
  {
    "title": "Основным методом получения истинных фактов в “Новом Органоне” считал индукцию:",
    "answer": "Ф. Бэкон"
  },
  {
    "title": "В философии Нового времени было два следующих направления:",
    "answer": "эмпиризм-рационализм"
  },
  {
    "title": "Понятие “монады” относится к философии:",
    "answer": "Г. Лейбница"
  },
  {
    "title": "Ф. Бэкон был представителем направления:",
    "answer": "эмпиризма"
  },
  {
    "title": "Работа Канта «Критика чистого разума» посвящена проблемам:",
    "answer": "гносеологии"
  },
  {
    "title": "Фейербах относится к представителям:",
    "answer": "материализма"
  },
  {
    "title": "Работа Канта «Критика практического разума» посвящена проблемам:",
    "answer": "морали"
  },
  {
    "title": "По мнению Фейербаха:",
    "answer": "Человек создал Бога"
  },
  {
    "title": "Понятие «вещь в себе» принадлежит философии:",
    "answer": "И. Канта"
  },
  {
    "title": "Понятие императив означает:",
    "answer": "закон"
  },
  {
    "title": "По мнению Фейербаха исходным пунктом философии является:",
    "answer": "человек"
  },
  {
    "title": "Кому принадлежали слова: «… поступай так, чтобы использовать человека для себя так же, как и для другого, всегда как цель и ни когда лишь как средство»?",
    "answer": "И. Канту"
  },
  {
    "title": "С точки зрения философии Канта сущность вещи познать:",
    "answer": "нельзя"
  },
  {
    "title": "К законам диалектики относится:",
    "answer": "Закон отрицания отрицания"
  },
  {
    "title": "К законам диалектики относится:",
    "answer": "закон перехода количественных изменений в качественные"
  },
  {
    "title": "Автор работы «Феноменология духа»:",
    "answer": "Г. Гегель"
  },
  {
    "title": "Специальный раздел философии, который занимается проблемой человека, называется:",
    "answer": "антропологией"
  },
  {
    "title": "Представитель экзистенциализма:",
    "answer": "К. Ясперс"
  },
  {
    "title": "Экзистенция – категория философии.",
    "answer": "Экзистенциализма"
  },
  {
    "title": "Отрицание действенного присутствия Бога в мире после сотворения мира:",
    "answer": "деизм"
  },
  {
    "title": "Фундаментальная идея психоанализа – идея:",
    "answer": "бессознательного"
  },
  {
    "title": "Представитель «Философии жизни»:",
    "answer": "Г. Зиммель"
  },
  {
    "title": "Проблема человека является центральной в философии 20 века:",
    "answer": "экзистенциализма"
  },
  {
    "title": "Понятие «пограничной ситуации» характерно для философии:",
    "answer": "экзистенциализма"
  },
  {
    "title": "Представителем критического рационализма является:",
    "answer": "К. Поппер"
  },
  {
    "title": "Человек делает самого себя, обретает свою сущность, уже существуя – эта точка зрения характерна для:",
    "answer": "экзистенциализма"
  },
  {
    "title": "Что не относится к формам рационального познания?",
    "answer": "Воля"
  },
  {
    "title": "Назовите философское понятие, которое отражает процесс осмысления собственных духовных процессов, раздумья над приемами своей мысли и их социальной значимостью.",
    "answer": "Рефлексия (принцип человеческого сознания)"
  },
  {
    "title": "Понятие «верификации» принадлежит философии:",
    "answer": "неопозитивизма"
  },
  {
    "title": "Понятие «экзистенция» переводится как:",
    "answer": "существование"
  },
  {
    "title": "С философской точки зрения человек есть существо:",
    "answer": "биосоциальное"
  },
  {
    "title": "Одним из объектов исследования структурализма является:",
    "answer": "знаковые системы"
  },
  {
    "title": "Представителем «герменевтики» является:",
    "answer": "Гадамер"
  },
  {
    "title": "Представителем постмодернизма является:",
    "answer": "Ж. Делёз"
  },
  {
    "title": "Античный мудрец Зенон пытался теоретически осмыслить движение. Как назывались его доказательства?",
    "answer": "апории"
  },
  {
    "title": "По Аристотелю, материя- это:",
    "answer": "потенциальная предпосылка или возможность существования вещи"
  },
  {
    "title": "Античный философ, автор тезиса «Человек есть мера всех вещей»:",
    "answer": "Протагор"
  },
  {
    "title": "Основоположник атомизма:",
    "answer": "Демокрит"
  },
  {
    "title": "В Древней Греции искусство вести беседу - одна из форм:",
    "answer": "Диалектики"
  },
  {
    "title": "Природа платоновской идеи:",
    "answer": "Не материальна, но умопостигаема"
  },
  {
    "title": "Безмятежность, невозмутимость духа, спокойное созерцание вечной истины в Древней Греции считалось:",
    "answer": "Высшей ценностью, идеалом свободного человека"
  },
  {
    "title": "Кто из перечисленных древнегреческих философов принадлежал к элейской школе:",
    "answer": "Зенон"
  },
  {
    "title": "По Аристотелю:",
    "answer": "Материя пассивна, форма активна"
  },
  {
    "title": "Укажите имя философа, не являющегося представителем античности:",
    "answer": "Спиноза"
  },
  {
    "title": "Выдающийся римский оратор и политик, соединивший греческую и римскую культуры, латинский гений, распространивший греческую мысль по всему миру:",
    "answer": "Цицерон"
  },
  {
    "title": "Понятие «Ли» означает:",
    "answer": "Следование церемониям"
  },
  {
    "title": "Изречение «Мораль благородного мужа подобна ветру, мораль низкого человека – траве. Трава наклоняется туда, куда дует ветер» характерно для философской школы:",
    "answer": "Конфуцианства"
  },
  {
    "title": "Управление обществом в конфуцианстве сравнивается с отношениями:",
    "answer": "отца и сына"
  },
  {
    "title": "Основатель даосизма:",
    "answer": "Лао-цзы"
  },
  {
    "title": "Книги «Китайской образованности» в своем составе насчитывают:",
    "answer": "5 книг"
  },
  {
    "title": "Основателем джайнистского учения считается:",
    "answer": "Махавира Вардхамана"
  },
  {
    "title": "Священные тексты Древней Индии:",
    "answer": "Веды"
  },
  {
    "title": "Центральной идеей джайнизма является:",
    "answer": "Принцип ахимсы (непричинение зла)"
  },
  {
    "title": "Древнеиндийская система материализма:",
    "answer": "чарвака"
  },
  {
    "title": "Первая заповедь буддизма гласит:",
    "answer": "Жизнь есть страдание"
  },
  {
    "title": "К ортодоксальным школам-даршан относятся:",
    "answer": "ньяя"
  },
  {
    "title": "Будда в переводе означает:",
    "answer": "просветленный"
  },
  {
    "title": "Закон сансары означает:",
    "answer": "закон круговорота перерождений"
  },
  {
    "title": "Настоящее имя Будды:",
    "answer": "Сиддхартха Гаутама"
  },
  {
    "title": "Термин «патристика» означает:",
    "answer": "учение «отцов церкви»"
  },
  {
    "title": "О чем шел спор между реалистами и номиналистами:",
    "answer": "О природе общих понятий (универсалий)"
  },
  {
    "title": "Оправдание Бога за существование зла в мире и обществе:",
    "answer": "Теодицея"
  },
  {
    "title": "Дискуссия между реалистами и номиналистами происходила в :",
    "answer": "средневековой философии"
  },
  {
    "title": "Креационизм объясняет возникновение жизни :",
    "answer": "творением Бога"
  },
  {
    "title": "Человек в средневековой философии рассматривался как :",
    "answer": "Образ и подобие Бога"
  },
  {
    "title": "Догмат – это установление, истинность которого принимается:",
    "answer": "Без доказательства"
  },
  {
    "title": "Представителем периода схоластики является:",
    "answer": "Фома Аквинский"
  },
  {
    "title": "Что такое пантеизм?",
    "answer": "всебожие – признание присутствия Бога во всей природе"
  },
  {
    "title": "Христианство как религия выросла из недр:",
    "answer": "иудаизма"
  },
  {
    "title": "Главный философский труд Августина называется:",
    "answer": "«Исповедь»"
  },
  {
    "title": "Какое направление средневековой арабо-мусульманской философии предлагает мистический путь постижения Бога?",
    "answer": "Суфизм"
  },
  {
    "title": "Смысл теории «двойственной истины», согласно Ибн-Рушду, заключается в :",
    "answer": "Признании самостоятельными истины веры и философского умозаключения"
  },
  {
    "title": "Средневековая Европа знала Аристотеля в изложении:",
    "answer": "Аль-Фараби"
  },
  {
    "title": "В средневековой арабо-язычной мысли термин «фалсафа» означает:",
    "answer": "рациональный способ постижения мира"
  },
  {
    "title": "Важнейшая традиция, воспринятая Аль-Фараби из античной философии:",
    "answer": "Перипатетизм"
  },
  {
    "title": "Первый представитель восточного аристотелизма:",
    "answer": "Аль-Кинди"
  },
  {
    "title": "Кто автор труда «Канон врачебной науки»?",
    "answer": "Ибн-Сина"
  },
  {
    "title": "Средневековая мусульманская философия имеет свое начало в",
    "answer": "Аравии"
  },
  {
    "title": "Основу неотомизма составляет философия:",
    "answer": "Фомы Аквинского"
  },
  {
    "title": "Мусульманство связано с идеей:",
    "answer": "строгого монотеизма"
  },
  {
    "title": "В философии суфизма основная проблема есть отношение человека к:",
    "answer": "Богу"
  },
  {
    "title": "Предмет философии:",
    "answer": "система «Мир- человек»"
  },
  {
    "title": "Категория - :",
    "answer": "это общее понятие, отражающее общие взаимосвязи природы, общества и познания, идеальные формы практической деятельности;"
  },
  {
    "title": "Субстратом всех физических процессов являются:",
    "answer": "элементарные частицы:"
  },
  {
    "title": "Фундаментальный принцип диалектического мышления – единство диалектики:",
    "answer": "логики и теории познания;"
  },
  {
    "title": "Диалектика сущности и явления такова:",
    "answer": "явление существенно, сущность- является;"
  },
  {
    "title": "Выберите определение материи, являющееся философским:",
    "answer": "материя – это объективная реальность, данная нам в ощущениях;"
  },
  {
    "title": "Выделите группу категорий, выражающих содержание закона единства и борьбы противоположностей:",
    "answer": "различие, противоположность, противоречие;"
  },
  {
    "title": "Какому способу мышления присуще формирование парных, полярных категорий?",
    "answer": "диалектике;"
  },
  {
    "title": "В процессе развития закон взаимного перехода количественных и качественных изменений раскрывает:",
    "answer": "механизм;"
  },
  {
    "title": "Категории диалектики:",
    "answer": "сущность и явление;"
  },
  {
    "title": "Под структурностью материи понимается:",
    "answer": "внутренне расчлененная целостность, закономерный порядок связи элементов в составе целого;"
  },
  {
    "title": "Найдите неправильный тезис:",
    "answer": "Развитие есть линейный процесс, совершающийся на неизменной основе;"
  },
  {
    "title": "К уровням организации неживых систем можно отнести:",
    "answer": "литосферу"
  },
  {
    "title": "Классическое определение материи с позиции диалектического материализма дано в работе:",
    "answer": "«Материализм и эмпириокритицизм»"
  },
  {
    "title": "Понятие движения является:",
    "answer": "абсолютным"
  },
  {
    "title": "К параметрам пространства относится:",
    "answer": "высота"
  },
  {
    "title": "Желание возродить идеалы и ценности античности характерно для эпохи:",
    "answer": "Возрождения"
  },
  {
    "title": "Идея диалектики впервые была обозначена в философии:",
    "answer": "Гераклита"
  },
  {
    "title": "Теоретическое оформление диалектики было сделано:",
    "answer": "Гегелем"
  },
  {
    "title": "Принцип всеобщей связи принадлежит:",
    "answer": "диалектике"
  },
  {
    "title": "Философия, исповедующая знание в его функции полезности, называется:",
    "answer": "прагматизмом"
  },
  {
    "title": "Отражение как философское понятие означает:",
    "answer": "любые изменения объекта в результате воздействия на него другого объекта"
  },
  {
    "title": "Истина есть адекватное отражение объекта познающим субъектом. Такая точка зрения принадлежит:",
    "answer": "марксизму"
  },
  {
    "title": "Ступени познания-:",
    "answer": "чувственное и рациональное"
  },
  {
    "title": "К рациональному познанию относятся следующие формы-:",
    "answer": "понятие, суждение, умозаключение"
  },
  {
    "title": "Выбрать определение истины, предложенное математиком Пуанкаре и в историю науки, оно вошло как конвенционалистская концепция истины:",
    "answer": "истина- результат соглашения ученых"
  },
  {
    "title": "Два уровня научного познания:",
    "answer": "теоретический и эмпирический"
  },
  {
    "title": "Каков наиболее фундаментальный критерий истины с позиции диалектического материализма:",
    "answer": "практика"
  },
  {
    "title": "Утверждение, что все в мире относительно и только относительно, является:",
    "answer": "релятивизмом"
  },
  {
    "title": "Что является принципиальным в процессе познания?",
    "answer": "необходимо наличие субъекта и объекта познания"
  },
  {
    "title": "Метод, основанный на переходе от общего знания к частному",
    "answer": "дедукция"
  },
  {
    "title": "Неявное осознание людьми общественного бытия без специальной познавательной деятельности:",
    "answer": "обыденное сознание"
  },
  {
    "title": "Методология это:",
    "answer": "учение о научном методе познания"
  },
  {
    "title": "Что такое сознание?",
    "answer": "субъективная реальность, целенаправленное отражение действительности"
  },
  {
    "title": "Существует несколько определений отражения. Какое из них является философским:",
    "answer": "отражение есть любая реакция на любое воздействие"
  },
  {
    "title": "Психический образ:",
    "answer": "идеален"
  },
  {
    "title": "Искусство, мораль, религия, политика –это:",
    "answer": "формы общественного сознания"
  },
  {
    "title": "В «ноосферной» модели человеческой цивилизации основная роль отведена:",
    "answer": "науке"
  },
  {
    "title": "Первая основная функция морали:",
    "answer": "регулятивная"
  },
  {
    "title": "Полагая, что ценность- это норма, проблему ценностей в социологию ввел:",
    "answer": "Вебер"
  },
  {
    "title": "Учение о красоте, о прекрасном в философии называется:",
    "answer": "эстетика"
  },
  {
    "title": "Духовные ценности:",
    "answer": "Имеют и практический и неутилитарный характер"
  },
  {
    "title": "Права человека- это одна из:",
    "answer": "Общечеловеческих ценностей"
  },
  {
    "title": "В переводе с латинского языка слово «мораль» означает:",
    "answer": "Нравственный"
  },
  {
    "title": "Ценностные отношения- это:",
    "answer": "Отношения между людьми по поводу существующих в обществе систем ценностей"
  },
  {
    "title": "Предметом этики является:",
    "answer": "мораль как явление общественной жизни;"
  },
  {
    "title": "Производственно-потребительские ценности – это:",
    "answer": "элемент материальных ценностей;"
  },
  {
    "title": "Сущность мифологического взгляда на мир состоит:",
    "answer": "в нерасчлененности, слитности, целостности миропонимания;"
  },
  {
    "title": "Философии не свойственна функция:",
    "answer": "технологическая;"
  },
  {
    "title": "Переход противоположностей друг в друга – это принцип:",
    "answer": "даосизма;"
  },
  {
    "title": "Причина человеческих страданий по буддизму:",
    "answer": "в жажде желаний;"
  },
  {
    "title": "Формулу тождества бытия и мышления вывел древнегреческий философ:",
    "answer": "Парменид;"
  },
  {
    "title": "Автором философского учения о «материи» и «форме» был:",
    "answer": "Аристотель;"
  },
  {
    "title": "Философские взгляды Гераклита Эфесского, Зенон Элейского … роднит:",
    "answer": "стихийная диалектика;"
  },
  {
    "title": "Последователей философии Аристотеля называют:",
    "answer": "перипатетиками;"
  },
  {
    "title": "Учение о Граде земном и Граде небесном создал:",
    "answer": "А. Августин;"
  },
  {
    "title": "Теоцентрическим мировоззрением можно назвать мировоззрение:",
    "answer": "эпохи Средневековья;"
  },
  {
    "title": "Патристика – это:",
    "answer": "совокупность теолого-философских взглядов христианских мыслителей."
  },
  {
    "title": "Философия стала «служанкой богословия». Какому периоду истории философии соответствует эта характеристика?",
    "answer": "эпохе Средних веков."
  },
  {
    "title": "Основная тенденция в мышлении, идеологии и культуре Ренессанса – это:\n-переход от теоцентрического к антропоцентрическому пониманию\nмира;",
    "answer": "борьба против антропоцентризма;"
  },
  {
    "title": "Основатель гелиоцентрической системы мира:",
    "answer": "Н. Коперник;"
  },
  {
    "title": "Пантеизм – это учение о единстве:",
    "answer": "бога и природы;"
  },
  {
    "title": "Признание двух независимых субстанций – мыслящей и протяженной – принадлежит:",
    "answer": "Р. Декарту;"
  },
  {
    "title": "Основоположник новоевропейского рационализма:",
    "answer": "Р. Декарт;"
  },
  {
    "title": "Препятствия на пути познания, порождающиеся употреблением неправильных слов, распространенных чаще всего на рынках, в общественных местах, Бэкон называл:",
    "answer": "идолами площади;"
  },
  {
    "title": "Логическая форма умозаключения, лежащая в основании эмпиризма, называется:",
    "answer": "индукцией;"
  },
  {
    "title": "По убеждению Ф. Бэкона, смысл, призвание и задачи науки – это:",
    "answer": "общественная польза и улучшение жизни людей;"
  },
  {
    "title": "Философия Нового времени опиралась на авторитет:",
    "answer": "науки;"
  },
  {
    "title": "Всякое знание начинается, по Канту:",
    "answer": "чувств;"
  },
  {
    "title": "По Ф. Бэкону, эмпирия- это:",
    "answer": "опыт, опирающийся на эксперимент;"
  },
  {
    "title": "По учению Спинозы существует только одна субстанция – это:",
    "answer": "природа-Бог;"
  },
  {
    "title": "Основатели диалектико-материалистической философии – это:",
    "answer": "К. Маркс и Ф. Энгельс;"
  },
  {
    "title": "Основным критерием марксистской типологии общества является:",
    "answer": "уровень развития производительных сил общества;"
  },
  {
    "title": "Энгельс упрекал материалистическую философию Нового времени из-за наличия в ее чертах:",
    "answer": "механистичности;"
  },
  {
    "title": "Основным этапом развития средневековой философии является:",
    "answer": "схоластика;"
  },
  {
    "title": "Три стадии интеллектуальной эволюции человечества по О. Конту:",
    "answer": "теологическая, метафизическая, позитивная;"
  },
  {
    "title": "Автором формационной концепции членения исторического процесса является:",
    "answer": "К. Маркс;"
  },
  {
    "title": "Вставить в цитату Маркса, недостающее слово:\n«Производственные отношения составляют реальный …. . , над\nкоторым возвышается юридическая и политическая надстройка»:",
    "answer": "базис;"
  },
  {
    "title": "Выберите верное определение, отражающее философию марксизма:",
    "answer": "народ – творец истории;"
  },
  {
    "title": "Философско-научное рассмотрение Вселенной:",
    "answer": "космология"
  },
  {
    "title": "Центральное понятие русского славянофильства:",
    "answer": "Соборность"
  },
  {
    "title": "В философии В. С. Соловьева центральной категорией является всеединство:",
    "answer": "диалектическое"
  },
  {
    "title": "Соловьев, Флоренский представители:",
    "answer": "религиозной философии;"
  },
  {
    "title": "Что абсолютизировал Маркс в своей теории общественных формаций:",
    "answer": "приоритет базиса над настройкой"
  },
  {
    "title": "Этот жырау был одержим поисками земли обетованной – жер-уйык и критиковал хана Джангира. Его имя:",
    "answer": "Асан-кайгы;"
  },
  {
    "title": "Родоначальник немецкой классической философии:",
    "answer": "Кант"
  },
  {
    "title": "Что означает понятие «метафизика» в системе античного мышления:",
    "answer": "учение о первопричинах бытия"
  },
  {
    "title": "Автором этики благоговения перед жизнью является:",
    "answer": "Альберт Швейцер;"
  },
  {
    "title": "Проверка процедуры истинности в логическом позитивизме\nназывается:",
    "answer": "верификация;"
  },
  {
    "title": "Критерием научной рациональности теории по К. Попперу является:",
    "answer": "принципиальная опровергаемость;"
  },
  {
    "title": "Новое искусство ХХ века стало «бесчеловечным», отвлеченным, холодным и ироничным, - так считал автор работы «Дегуманизация искусства»:",
    "answer": "Ортега-и-Гассет;"
  },
  {
    "title": "Чувственно-наглядный образ, сохраняемый в памяти и воспроизводимый в сознании:",
    "answer": "представление"
  },
  {
    "title": "Способом существования материи в марксистской философии является:",
    "answer": "движение;"
  },
  {
    "title": "Выберите концепцию пространства и времени, являющейся сейчас общепринятой, исходя из достижений науки:",
    "answer": "реляционная;"
  },
  {
    "title": "Сочинения Аристотеля:",
    "answer": "охватывают практически все науки, известные в древности "
  },
  {
    "title": "Философская категория, выражающая длительность существования материальных объектов, определенную последовательность событий реальной действительности.",
    "answer": "Время"
  },
  {
    "title": "Одно из важнейших сочинений К. Поппера посвященная проблеме развития общества",
    "answer": "Открытое общество и его враги"
  },
  {
    "title": "Абсолютизация роли и значения чувственных данных в философии и научном познании связана с направлением:",
    "answer": "сенсуализма"
  },
  {
    "title": "Метод познания в философии и науке, когда мысль движется от общих положений к частным выводам:",
    "answer": "дедукция"
  },
  {
    "title": "Определение человека как символического животного принадлежит:",
    "answer": "Э. Кассиреру"
  },
  {
    "title": "Учение, суть которого состоит в том, что удовольствие является единственным благом:",
    "answer": "Гедонизм "
  },
  {
    "title": "Строгий нравственный закон И. Канта носит название:",
    "answer": " категорический императив "
  },
  {
    "title": "Автор концепции «открытого общества»:",
    "answer": " К. Поппер "
  },
  {
    "title": "Организации западных ученых, социологов, общественных деятелей, сформулировавших понятие \"глобальные проблемы\"",
    "answer": "\"Римский клуб\""
  },
  {
    "title": "Что такое теология?",
    "answer": "учение о Боге "
  },
  {
    "title": "Кто из мыслителей создал философскую поэму «Кутадгу билик»:",
    "answer": " Ж. Баласагуни "
  },
  {
    "title": "Автор работы «Мусульманский Ренессанс»:",
    "answer": "А. Мец А. Тойнби"
  },
  {
    "title": "Кто из философов создал основные категории диалектики:",
    "answer": "Г. Гегель "
  },
  {
    "title": "Кто из немецких философов является автором труда «Основы философии будущего»",
    "answer": "Л. Фейербах "
  },
  {
    "title": "Кто развивает пантеистическое учение в период Нового времени:",
    "answer": " Б. Спиноза "
  },
  {
    "title": "Одно из ключевых понятий М. Фуко в книге «Слова и вещи»:",
    "answer": " эпистема "
  },
  {
    "title": "Кому принадлежит идея: «Человек - существо играющее».",
    "answer": " И. Хейзинга "
  },
  {
    "title": "Основной философский труд Шакарима — “Три …”:",
    "answer": " Истины "
  },
  {
    "title": "В творчестве какого казахского мыслителя этнографические, исторические, географические исследования приобрели философский характер:",
    "answer": " Ч. Валиханов "
  },
  {
    "title": "В качество метода познания для сенсуализма характерно:",
    "answer": "признание приоритетной роли чувств в познании"
  },
  {
    "title": "Что означает в переводе «гуманизм»:",
    "answer": " человечность "
  },
  {
    "title": "Религиозное учение о конечной судьбе мира и человека:",
    "answer": "Онтология"
  },
  {
    "title": "Традиция приписывает введение термина “философия”",
    "answer": " Пифагору "
  },
  {
    "title": "Один из первых греческих философов, математик, один из «Семи мудрецов»",
    "answer": "Фалес "
  },
  {
    "title": "Тип философского мировоззрения, в основе которого лежит объяснение всего сущего через господство необъяснимой, сверхъестественной силы, Бога",
    "answer": "теоцентризм "
  },
  {
    "title": "Когда философия учит, ничего сразу не принимать и не отвергать без глубокого и самостоятельного размышления и анализа, то ее деятельность связана с",
    "answer": "критической функцией "
  },
  {
    "title": "Основная форма произведений Платона",
    "answer": "Диалоги "
  },
  {
    "title": "Определение «Философия - служанка богословия» характеризует период",
    "answer": "Средневековья "
  },
  {
    "title": "Авиценна - западное прочтение имени:",
    "answer": "Ибн-Сина "
  },
  {
    "title": "Самое известное произведение средневекового европейского мыслителя Августина Блаженного:",
    "answer": "Исповедь "
  },
  {
    "title": "Понятие «атом» в переводе с греческого означает:",
    "answer": "Неделимый "
  },
  {
    "title": "Первым в истории философской мысли теоретически осмыслил категорию бытие",
    "answer": "Парменид "
  },
  {
    "title": "Сознание по свое природе:",
    "answer": "идеально"
  },
  {
    "title": "Автор утверждения «Я мыслю, значит, существую»",
    "answer": "Декарт "
  },
  {
    "title": "Автор высказывания: «Мыслю, следовательно, существую»?",
    "answer": "Р Декарт      "
  },
  {
    "title": "В ранней философии категория «сознание» определялась через понятие",
    "answer": "душа "
  },
  {
    "title": "Учение, утверждающее об ограниченных возможностях человека в познании мира, называется:",
    "answer": "скептицизм "
  },
  {
    "title": "Вид познания, вплетенный в жизнедеятельности субъекта, но не обладающий доказательной силой, называется:",
    "answer": "обыденным "
  },
  {
    "title": "Логическая операция перехода от частного к общему называется",
    "answer": "Индукция "
  },
  {
    "title": "Совокупность подходов, приемов, способов решения различных практических и познавательных проблем - это:",
    "answer": "методика "
  },
  {
    "title": "Образ «сверхчеловека» был предложен в философских произведениях:",
    "answer": "Ф. Ницше "
  },
  {
    "title": "В чем суть человеческой жизни согласно Буддизму",
    "answer": "Страдание "
  },
  {
    "title": "Заратустра - герой философских размышлений:",
    "answer": "Ф. Ницше "
  },
  {
    "title": "Сократ является примером:",
    "answer": "мудрого правителя "
  },
  {
    "title": "Сократ придерживался мнения, что высшей ценность является",
    "answer": "добродетель "
  },
  {
    "title": "Автор работы «Никомахова этика»",
    "answer": "Аристотель "
  },
  {
    "title": "В своих высказываниях Конфуций отмечает, что «Чрезмерность так же плоха, как и отставание», поясняя важнейший этический, антропологический и социально-политический принцип -",
    "answer": "Путь золотой середины "
  },
  {
    "title": "Понимание общественной жизни через законы и категории биологии характеризует",
    "answer": "Социальный дарвинизм "
  },
  {
    "title": "Автором знаменитого социально-философского трактата «Город Солнца» является:",
    "answer": "Кампанелла Т."
  },
  {
    "title": "Приоритетное развитие в какой области отражает категория «цивилизация»?",
    "answer": "техника "
  },
  {
    "title": "Выделите основной элемент политической структуры общества:",
    "answer": "государство "
  },
  {
    "title": "Какое направление в философии ХХ в. выдвигает на первый план проблему жизни и смерти человека",
    "answer": "экзистенциализм "
  },
  {
    "title": "Какое философское учение утверждает единство бога и природы?",
    "answer": "пантеизм "
  },
  {
    "title": "Какой принцип является ядром диалектики и указывает на причину и источник развития?",
    "answer": "закон единства и борьбы противоположностей "
  },
  {
    "title": "Какой принцип диалектики помогает понять, как конкретное в действительности трансформируется в конкретное познание?",
    "answer": "восхождение от абстрактного к конкретному "
  },
  {
    "title": "Какой принцип диалектики аккумулирует в себе познавательную возможность законов и категорий диалектики и организует процесс познания?",
    "answer": "восхождение от абстрактного к конкретному"
  },
  {
    "title": "Какой закон логики утверждает, что в процессе определенного рассуждения всякое понятие и суждение должно быть тождественно само по себе?",
    "answer": "закон тождества "
  },
  {
    "title": "Какая форма мышления из перечисленных отражает общие, существенные признаки и свойства предметов и явлений?",
    "answer": "понятие "
  },
  {
    "title": "Социальная мысль античности содержится в трудах",
    "answer": "Платона, Аристотеля"
  },
  {
    "title": "Миропонимание составляет … сторону мировоззрения",
    "answer": "познавательно-интеллектуальную "
  },
  {
    "title": "Критерий истинности знаний в учении диалектического материализма",
    "answer": "Фальсификация"
  },
  {
    "title": "Успех европейской цивилизации тесно связан с тем, насколько удается соединнить выгоду и",
    "answer": "справедливость "
  },
  {
    "title": "Средневековый мыслитель периода схоластики, предложивший 5 доказательств бытия Бога",
    "answer": "Фома Аквинский"
  },
  {
    "title": "Философская категория, обозначающая протяженность материальных объектов, их величину и расположение относительно друг друга  ",
    "answer": "Пространство "
  },
  {
    "title": "Исторический тип мировоззрения, отличающийся рациональностью, рефлективностью ",
    "answer": "философия "
  },
  {
    "title": "Аристотель выделяет 2 рода добродетелей соответственно двум частям души ",
    "answer": "разумные и иррациональные "
  },
  {
    "title": "Сравнивал сознание новорожденного ребенка  с «чистой доской»",
    "answer": "Д.Локк"
  },
  {
    "title": "Фундаментальное понятие философии К.Юнга",
    "answer": "архетип коллективного бессознательного"
  },
  {
    "title": "Концепция культуры в учении З.Фрейда связана с понятием",
    "answer": "Бессознательное "
  },
  {
    "title": "Фальсифицируемость как критерий научности эмпирической теории ввел",
    "answer": "К.Поппер "
  },
  {
    "title": "С диалектическим законом единства и борьбы противоположностей связана категория",
    "answer": "Отрицание"
  },
  {
    "title": "Суждение «Удивление побуждает людей философствовать» принадлежит",
    "answer": "Аристотелю "
  },
  {
    "title": "В своей общественной трудовой деятельности человек",
    "answer": "Подчиняется природе"
  },
  {
    "title": "В англоязычной литературе «естественная теология до сих пор часто именуется",
    "answer": "философией религии "
  },
  {
    "title": "Отрасль философского знания, занимающаяся исследованиями теории познания",
    "answer": "Гносеология"
  },
  {
    "title": "Философ ХХвек, провозгласивший идею конца культуры и «заката Европы»",
    "answer": "Шпенглер"
  },
  {
    "title": "Средневековый философ, утверждавщий, что история провляется как движение от «земного града» к «граду Божьему» ",
    "answer": "Августин Аврелий"
  },
  {
    "title": "В переводе гуманизм» означает ",
    "answer": "человечность"
  },
  {
    "title": "Раздел философии, который изучает бытие, его формы",
    "answer": "онтология"
  },
  {
    "title": "Представители цивилизационного подхода в изучении проблем развития человечества",
    "answer": "О.Шпенглер, А.Тойнби, С.Хантингтон"
  },
  {
    "title": "Основоположник казахского Просвещения",
    "answer": "Ч.Валиханов "
  },
  {
    "title": "Этическая концепция, утверждающая наличие некого абсолютого положительного в нравственном отношении  должно составлять смысл человеческой жизни ",
    "answer": "идеализм"
  },
  {
    "title": "Сократ занимался по преимуществу … вопросами",
    "answer": " научными "
  },
  {
    "title": "Знание(духовное и нравственное), которое не может быть просто «принято к сведению», а требует от человека жизненного ответа это-",
    "answer": "мировоззрение"
  },
  {
    "title": "Отрасль философского знания, исследующая мир религии",
    "answer": "Философия религии"
  },
  {
    "title": "Содержание наших знаний, существующее независимо от человека, есть",
    "answer": "Абсолютная истина "
  },
  {
    "title": "Исторический тип мировоззрение, отличающийся рациональностью,рефлективностью ",
    "answer": "философия"
  },
  {
    "title": "Ф.Ницше можно назвать",
    "answer": "Прововедником индивидуализма"
  },
  {
    "title": "Метод теоретического познание",
    "answer": "логический"
  },
  {
    "title": "Д.Беркли, утверждая «существовать- значит быть воспринимаемым», занимал позицию ",
    "answer": "субъективного идеализма"
  },
  {
    "title": "Философская категория, обозначающая протяженность материальных объектов, их величину и расположение относительно друг друга. ",
    "answer": "Пространство "
  },
  {
    "title": "Главное убеждение Сократа заключалось в том, что истинная нравственность, высшая добродетель – это: ",
    "answer": "знание "
  },
  {
    "title": "Определение человека как политического животного принадлежит: ",
    "answer": "Аристотелю "
  },
  {
    "title": "Философское наследие Бухар-жырау отражено ",
    "answer": "В стихах, восхваляющих деятельность биев и султанов, направленных на единство народа "
  },
  {
    "title": "Этическое начало лежит в основе всякой культуры полагал: ",
    "answer": "Швейцер "
  },
  {
    "title": "В чем состоит сущность иррационализма? ",
    "answer": "Направление в философии, делающей основой миропонимания нерациональные формы познания (интуиция, вживание, переживания) "
  },
  {
    "title": "Кто отмечает дедукцию как основной метод познания: ",
    "answer": "Р. Декарт "
  },
  {
    "title": "Кто исследовал индукцию как метод познания: ",
    "answer": "Ф. Бэкон "
  },
  {
    "title": "Философское учение о сущности и существовании человека:",
    "answer": "антропология"
  },
  {
    "title": "Благо – это ценность",
    "answer": "на которую главным образом направлены человеческие достижения "
  },
  {
    "title": "В чем суть кризиса объяснения в науке на рубеже  XIX-XX  вв. с философских позиций? ",
    "answer": "в переходе к новому пределу осмысления реального мира"
  },
  {
    "title": "Термин  \"философская антропология \" в современной философии трактуется как?",
    "answer": "раздел и философское направление"
  },
  {
    "title": "Согласно ибн-Рушду, мир это?",
    "answer": "непрерывно изменяющийся процесс"
  },
  {
    "title": "Труды какого философа аль-Фараби перевел на арабский язык сопровождая их комментариями?",
    "answer": "Аристотеля"
  },
  {
    "title": "Какой философ античности не написал ни одного философского труда?",
    "answer": "Сократ"
  },
  {
    "title": "Какие вопросы находились в центре внимания конфуцианства?",
    "answer": "проблемы воспитания, образования, социальной стабильности"
  },
  {
    "title": "Укажите дату возникновения философии?",
    "answer": "середина 1тыс.до н.э."
  },
  {
    "title": "Один из основателей школы закона (легизм), создавший модель деспотического государства,в  котором все  равны  перед законом?",
    "answer": "Хань-Фэй"
  },
  {
    "title": "Как называется метод научного прогнозирования, основанный на перенесении тенденций, имеющихся в настоящем на будущее?",
    "answer": "экстраполяция"
  },
  {
    "title": "Какое философское направление утверждает, что человек обретает свою сущность, уже существуя?",
    "answer": "экзистенциализм"
  },
  {
    "title": "Какая еще одна подсистема представлена в обобщенном виде в  мировоззрении, кроме познавательной и  поведенческой?",
    "answer": "эмоциональная"
  },
  {
    "title": "Кто из этих философов представляет атеистическую ветвь экзистенциализма?",
    "answer": "Хайдеггер, Камю, Сартр"
  },
  {
    "title": "Как называется форма  знания, которая требует дальнейшего обоснования и проверки?",
    "answer": "гипотеза"
  },
  {
    "title": "Отрицание всеобщего характера причинности характерно для?",
    "answer": "Индетерминизма"
  },
  {
    "title": "Укажите один из основных принципов материалистической диалектики?",
    "answer": "развитие"
  },
  {
    "title": "Древнейший памятник индийской культуры и философии",
    "answer": " Веды"
  },
  {
    "title": "Форма выражения философских взглядов в традиционной казахской культуре",
    "answer": "Устное народное творчество"
  },
  {
    "title": "Идеолог движения Реформации",
    "answer": "М. Лютер"
  },
  {
    "title": "Социальный пароцесс, зависящий от природных условий",
    "answer": "Рост народонаселения"
  },
  {
    "title": "Знаменитая апория Зенона Элейского",
    "answer": " «Ахиллес и черепаха»"
  },
  {
    "title": "Соответствие знаний самим предметам характеризует классическую концепцию",
    "answer": "Истины"
  },
  {
    "title": "Глобальные проблемы современности отражают цивилизационные противоречия?",
    "answer": "планетарного  масштаба"
  },
  {
    "title": "Укажите категорию философии?",
    "answer": "сущность "
  },
  {
    "title": "Укажите специфику философского мировоззрения?",
    "answer": "рефлексивный тип ; теоретическая, понятийная форма"
  },
  {
    "title": "Эмоционально-психологическую сторону мировоззрения составляет?",
    "answer": "Мироощущение"
  },
  {
    "title": "Что часто подразумевают под «мегамиром»?",
    "answer": "космос, Вселенную"
  },
  {
    "title": "Укажите философов эпохи Возрождения?",
    "answer": "Н.Кузанский , Дж.Пико делла Мирандола"
  },
  {
    "title": "Как называется механическое соединение разнородных взглядов, идей фактов?",
    "answer": "эклектика"
  },
  {
    "title": "Укажите основной философский труд Ф.Бэкона?",
    "answer": "\"Новый органон\""
  },
  {
    "title": "В чем суть кризиса объяснения в науке на рубеже  XIX-XX  ввс философских позиций? ",
    "answer": "в переходе к новому пределу осмысления реального мира"
  },
  {
    "title": "Что является основанием, главным понятием  философской системы Гегеля?",
    "answer": "абсолютная идея"
  },
  {
    "title": "Укажите категории учения Конфуция?",
    "answer": "порядок, добродетель, человечность"
  },
  {
    "title": "Как называется рациональный аспект мировоззрения?",
    "answer": "миропонимание"
  },
  {
    "title": "Термин \"аксиология \" означает?",
    "answer": "теория ценностей"
  },
  {
    "title": "Термин \"рефлексия\" означает?",
    "answer": "форма самосознания"
  },
  {
    "title": "Как называется форма рационального мышления,с помощью которой что-либо отрицается или утверждается?",
    "answer": "суждение"
  },
  {
    "title": "Как называется философское учение, которое находит своих последователей?",
    "answer": "философским течением"
  },
  {
    "title": "Какой философ античности не написал ни одного философского  труда?",
    "answer": "Сократ"
  },
  {
    "title": "Как называется метод научного  прогнозирования, основанный на перенесении тенденций , имеющихся в настоящем на будущее?",
    "answer": "экстраполяция"
  },
  {
    "title": "Что часто подразумевают под «макромиром»?",
    "answer": "живую и неживую природу"
  },
  {
    "title": "Что часто подразумевают под «микромиром»?",
    "answer": "малекулярный уровень "
  },
  {
    "title": "Какой раздел философии изучает цель, движущие  силы, смысл и направленность   исторического процесса ",
    "answer": "социальная философия и философия  истории "
  },
  {
    "title": "В чем сущность концепции географического детерминизма?",
    "answer": "основные факты истории объясняются географическими  условиями"
  },
  {
    "title": "Что включает понятие \"сверх - я\" по  З.Фрейду?",
    "answer": "установки  общества,  социальность внутри сознания"
  },
  {
    "title": "Кто заложил основы механистического и метафизического материализма? ",
    "answer": "Ньютон"
  },
  {
    "title": "Как называл Ф.Бэкон заблуждения человека, связанные с его верой в авторитеты?",
    "answer": "идолы театра"
  },
  {
    "title": "Укажите главное понятие психоанализа, получившее философское толкование?",
    "answer": "бессознательное"
  },
  {
    "title": "Кто сформулировал  апории \"Дихотомия \",  \"Ахиллес и черепаха \", \"Стрела\"? ",
    "answer": "Зенон"
  },
  {
    "title": "Законы какой науки философы-материалисты ХУШ в утверждали в  качестве всеобщих и универсальных?",
    "answer": "механики"
  },
  {
    "title": "Какой тип отношений человека к миру отражает вопрос И.Канта \"Что я  должен делать\"?",
    "answer": "практический"
  },
  {
    "title": "Укажите одну из важнейших особенностей атрибутов материи?",
    "answer": "взаимосвязь атрибутов"
  },
  {
    "title": "Укажите первый элемент триады Гегеля?",
    "answer": "тезис"
  },
  {
    "title": "Укажите общее положение философского сенсуализма?",
    "answer": "\"ничего нет в интеллекте, чего не было бы раньше в чувствах \""
  },
  {
    "title": "Целостный образ предмета, данный посредством наблюдения, называется?",
    "answer": "представлением"
  },
  {
    "title": "Как называется результат синтеза наиболее  фундаментальных знаний о мире в кахдый конкретный период развития науки?",
    "answer": "парадигма"
  },
  {
    "title": "О Конт (основатель позитивизма) разделил историю познания природы на три стадии: теологическую, метафизическую и ..?",
    "answer": " философскую"
  },
  {
    "title": "И.Кант по своим мировоззренческим взглядам был?",
    "answer": "идеалистом"
  },
  {
    "title": "Кто определил пространство и время  как априорные формы чувственности?",
    "answer": "И.Кант"
  },
  {
    "title": "Платон утверждал, что реальный мир есть?",
    "answer": "бледное отражение мира идей"
  },
  {
    "title": "Как называется позиция, согласно которой все явления природы обладают  психическими свойствами?",
    "answer": "гилозоизм"
  },
  {
    "title": "Мир есть соединение идеальных сущностей и вещей, формы и материи, согласно?",
    "answer": "Аристотелю"
  },
  {
    "title": "Выделите категории диалектики?",
    "answer": "противоречие, качество, мера, отрицание"
  },
  {
    "title": "Фалес в качестве первоначала мира утверждал?",
    "answer": "воду"
  },
  {
    "title": "Кто  является автором учения о монадах?",
    "answer": "Лейбниц"
  },
  {
    "title": "Цивилизация, по мнению О.Шпенглера представляет собой?",
    "answer": "упадок, деградацию культуры"
  },
  {
    "title": "Объясните  понятие антиномии?",
    "answer": "суждения, которые взаимоисключают друг друга"
  },
  {
    "title": "Для какого типа культуры характерна ориентация на новации  и активное преобразование мира?",
    "answer": "европейского "
  },
  {
    "title": "Этимология понятия «материя»?",
    "answer": "вещество, материал"
  },
  {
    "title": "Как называется теория понимания текстов и интерпретации феноменов культуры?",
    "answer": "герменевтика"
  },
  {
    "title": "Преувеличение относительности знания называется?",
    "answer": "формализмом"
  },
  {
    "title": "Позиция,  согласно которой с помощью науки будут разрешены все проблемы и противоречия человечества,называется?",
    "answer": "сциентизм"
  },
  {
    "title": "Какой тип отношений человека к миру отражает вопрос И.Канта  \"Что я могу знать\"?",
    "answer": "познавательный"
  },
  {
    "title": "В каком понятии отражается процесс взаимодействия природы и общества, подчеркивается активная роль науки и разума человека?",
    "answer": "ноосферы"
  },
  {
    "title": "Укажите высший организующий элемент ноосферы?",
    "answer": "разум человека и общества"
  },
  {
    "title": "Чем отличается представление В.Вернадского о ноосфере от  представлений Э.Леруа  и П.Тейяра -де-Шардена?",
    "answer": " теологической направленностью -ничем не отличаются"
  },
  {
    "title": "Каким термином обозначаются в философии техники любые устройства, созданные человеком?",
    "answer": "артефакты"
  },
  {
    "title": "Как называется основная функция культуры передачи навыков, знаний, предметов от поколения к поколению?",
    "answer": "трансляции"
  },
  {
    "title": "Как называется философский подход к объяснению общества, согласно которому человеческое общество - естественное продолжение закономерностей природы и космоса",
    "answer": "(Вернадский, Чижевский, Гумилев и др.)?"
  },
  {
    "title": "Укажите три основных формы  чувственной ступени познания?",
    "answer": "ощущение, восприятие, представление"
  },
  {
    "title": "Какие первоначала утверждала  школа локаята-чарвака?",
    "answer": "земля, вода, огонь, воздух "
  },
  {
    "title": "Укажите античную трактовку диалектики?",
    "answer": "искусство спора, диалога, вид прения"
  },
  {
    "title": "Как называется  прием мышления, связанный с разложением объекта на стороны, элементы с целью их самостоятельного изучения?",
    "answer": "анализ"
  },
  {
    "title": "Процесс построения объектов, не существующих в реальной действительности, называется?",
    "answer": "абстрагированием"
  },
  {
    "title": "Какая категория диалектики полярна категории формы, соотносится с ней?",
    "answer": "содержание"
  },
  {
    "title": "Сущность сознания:",
    "answer": "воля"
  },
  {
    "title": "Какой феномен культуры в современном мире является основным источником новаций в технике и технологии  ( синтез знания и деятельности)?",
    "answer": "наука"
  },
  {
    "title": "Какую особенность биологического пространства отметил В.Вернадский?",
    "answer": "структурность"
  },
  {
    "title": "Архетип по К.Юнгу?",
    "answer": "доопытные идеи, элемент бессознательного"
  },
  {
    "title": "Творчество Ф.Достоевского оказало значительное влияние на формирование?",
    "answer": "экзистенциализма"
  },
  {
    "title": "Чем, главным образом, отличается обыденное сознание от научного?",
    "answer": "опорой на чувственные данные"
  },
  {
    "title": "Как называется способ мышления, отличительными сторонами которого являются односторонность, абсолютизация отдельного, устойчивости?",
    "answer": "метафизика"
  },
  {
    "title": "Какой элемент природы имел большое значение в жизни общества на ранних стадиях?",
    "answer": "климат"
  },
  {
    "title": "Какое явление выступит наиболее существенным и всеохватывающим для современных НТР?",
    "answer": "освоение космоса"
  },
  {
    "title": "Какие два подхода возможны к типологизации этапов общественного развития?",
    "answer": "формационный и  цивилизационный"
  },
  {
    "title": "Какой тип социальности пропущен в данной модели исторического движения:  традиционное … постиндустриальное общество?",
    "answer": "индустриальное общество"
  },
  {
    "title": "Укажите метод эмпирического исследования?",
    "answer": "наблюдение"
  },
  {
    "title": "Как называется соединение разнородных взглядов, идей, принципов или теорий?",
    "answer": "эклектикой"
  },
  {
    "title": "Какая из перечисленных технологий развивается наиболее быстрыми темпами в настоящее время?",
    "answer": "информационная"
  },
  {
    "title": "Укажите основной принцип западно-европейской средневековой философии? ",
    "answer": "теоцентризм"
  },
  {
    "title": "Укажите главный принцип философии Возрождения?",
    "answer": "антропоцентризм"
  },
  {
    "title": "Как называется философская позиция, возникшая в античности, согласно которой наши знания о вещах не могут быть ни истинными, ни ложными?",
    "answer": "скептицизм"
  },
  {
    "title": "Субстанциальную концепцию  пространства и времени в наиболее полном системном виде разработал?",
    "answer": "Ньютон"
  },
  {
    "title": "Как называется  комплекс взаимодействующих элементов?",
    "answer": "система"
  },
  {
    "title": "Большинство философских систем, сложившихся в Новое Время в концепции познания, противопоставляют две его основные ступени?",
    "answer": "чувственное и рациональное"
  },
  {
    "title": "Философские системы, преувеличивающие  роль чувственного познания?",
    "answer": "сенсуализм"
  },
  {
    "title": "Какая категория  выражает переход от  одного  качественного состояния к другому, коренной перелом в процессе развития?",
    "answer": "скачок"
  }
]