module.exports = [
  {
    title: 'Суретте берілген мүшелерді біріктіретін жүйе',
    answer: 'эндокринді'
  },
  {
    title: 'Суреттегі 3 санымен белгіленген безге тән сипаттама',
    answer: 'тироксин гормонын бөледі'
  },
  {
    title: 'Өздігінен тозаңдану көрсетілген сурет',
    answer: '1'
  },
  {
    title: 'Жәндіктер арқылы тозаңданатын өсімдіктердің ерекшеліктеріне жатпайды',
    answer: 'тозаңдары құрғақ, жеңіл'
  },
  {
    title: 'Кеңірдектің жоғарғы ұшын жауып жатқан без',
    answer: 'қалқанша'
  },
  {
    title: 'Дара жынысты гүлдер',
    answer: 'гүлдерінде тек қана аналықтары немесе аталықтары болады'
  },
  
  {
    title: 'Аралас бездер көрсетілген суреттегі нөмірлер',
    answer: '6 7 8'
  },
  {
    title: 'Дене температурасының тұрақты болуын реттейтін ми бөлімі',
    answer: 'ортанғы ми'
  },
  
  {
    title: 'Жақыннан көргіштік кезіндегі сәуленің қиылысуы бейнеленген',
    answer: 'б сурет'
  },
  {
    title: 'Жарық сәулелерін фокустайды',
    answer: 'көзбұршақ'
  },
  {
    title: 'Ішінде жасуша шырыны бар N2 органоид атауы',
    answer: 'вакуоль'
  },
  {
    title: 'Өсімдік және жануарлар жасушасына тән ортақ бөліктер',
    answer: 'қабықша ядро цитоплазма'
  },
  {
    title: 'Адамда қимыл қозғалысқа жауапты мидың бөлігі',
    answer: 'ортаңғы ми'
  },
  {
    title: 'Жұлынның жалғасы болатын ми бөлімі',
    answer: 'сопақша ми'
  },
  {
    title: 'Артқы миға жатады',
    answer: 'ми көпірі'
  },
  {
    title: 'Теріні ультракүлгін сәуледен қорғайды',
    answer: 'меланин'
  },
  {
    title: 'Дерма қабаты түзілген ұлпа',
    answer: 'тығыз дәнекер'
  },
  {
    title: 'Көленке сүйгіш өсімдік',
    answer: 'інжугүл'
  },
  {
    title: 'Бөлшектену сатысынан кейін басталады',
    answer: 'бластула'
  },
  {
    title: 'Этодерма қабатынан түзіледі',
    answer: 'тырнақ'
  },  
  {
    title: 'Қанқа сүйектері пайда болатын саты',
    answer: 'мезодерма'
  },
  {
    title: 'Синапс арқылы белгілерді беру не арқылы жүзеге асырылады',
    answer: 'медиатор'
  },
  {
    title: 'АТФ синтездейтін органойд',
    answer: 'митондрия'
  },
  {
    title: 'Бүйректің функциялық бірлігі',
    answer: 'нефрон'
  },
  {
    title: 'Метафаза кезеңіндегі өзгеріс',
    answer: 'хромосомалар экватор жазықтығына жиналуы'
  },
  {
    title: 'Бүйректің салмағы',
    answer: '150г'
  },
  {
    title: 'Ядрошықтар мен ядро қабықшасының бұзылуы басталатын кезең',
    answer: 'профаза'
  },
  {
    title: 'ЭПТ бөлінеді',
    answer: '2'
  },
  {
    title: 'Ұзын өсіндінің сыртындағы майтәрізді зат қалай аталады?',
    answer: 'миелин'
  },
  {
    title: 'Нәруызды синтездейтін органиод',
    answer: 'Рибосома'
  },
  {
    title: 'Түс беретін органиод',
    answer: 'Пластид'
  },
  {
    title: 'Нейрондар бір-бірімен арнайы құрылымдар - ......',
    answer: 'Синапс'
  },
  {
    title: 'Интерфаза қанша сатыдан тұрады',
    answer: '3'
  },
  {
    title: 'Нейронның қысқы тармақталған өсінділері қалай аталады',
    answer: 'дендрит'
  },
  {
    title: 'Бүйректе қанша қабат болады',
    answer: '2'
  },
  {
    title: 'Зәр қайда жиналады',
    answer: 'қуықта'
  },
  {
    title: 'Артерияға тән',
    answer: 'жүректен шыққан қанды тартады'
  },
  {
    title: 'Репликация ұғымының мағынасы',
    answer: 'ДНҚ молекуласының екі еселенуі'
  },
  {
    title: 'Үлкен қан айналым шеңбері',
    answer: 'оң жақ қарынша -> өкпе -> сол жак жүрекше'
  },
  {
    title: 'Жапырақтар мен өркендердің Күн жарығы бағытында өсуі',
    answer: 'жағымды фототропизм'
  },
  {
    title: 'Тері рецепторлары орналасқан қабат',
    answer: 'эпидерис'
  },
  {
    title: 'Көрсетілген тізбектегі нуклеотидтердің арасындағы сутектік байланыс',
    answer: 'А-Т=8; Г-Ц=12'
  },
  {
    title: 'Алыстан көргіштік кезіндегі сәуленің қиылысуы бейнеленген',
    answer: 'ғ - сурет'
  },
  {
    title: 'Гүлсерікті құрайды',
    answer: 'күлте мен тостағанша'
  },
  
  {
    title: 'Алты жүз кітапты қорапқа бөліп салу керек. Әр қорапқа 15 кітап сияды.',
    answer: '600-ді 15-ке бөлу'
  },
  {
    title: 'Поштадағы 5 түрлі маркадан неше тәсілмен 6 марка сатып алуға болатынын табыңыз',
    answer: '30'
  },
  
  {
    title: 'Биіктігі 12 м болатын үйдің үстінде көгершін отыр. Көгершін 13 метр қашықтықта М нүктесінде тұрған қоретендіргішке үшып бару керек. Жердегі проекциясы',
    answer: '5 м'
  },
  {
    title: 'Алмас шаршы торкөздерге бөлінген тақта пайдаланылатын ойын ойнады. D5 тен G7 ге жол',
    answer: '2 жоғары 3 оңға'
  },
  
  {
    title: 'Сағаттың минуттық тілі бір күнгі таңғы сағат 6.20-дан 8.00-ге дейін қанша градусқа',
    answer: '600'
  },
  {
    title: 'Төмендегі функциялардың ең кіші оң периодтарын салыстырыңыз (cos2x ctg2x)',
    answer: 'A > B'
  },
  
  {
    title: 'Асан, Үсен және Досан бір түзудің бойында тұр. Бұларға Қосан жақындады. ...... Досан мен Асанның арақашықтығы',
    answer: '1 м'
  },
  {
    title: 'Төмендегі иррационал сандардың ішіндегі ең үлкенін көрсетіңіз',
    answer: '3 _/11'
  },
  {
    title: 'Асан шаршыларды сызып отырып белгілі бір заңдылықтың бар екенін түсіні',
    answer: 'а + В + ү = 90'
  },
  {
    title: 'Асан нысанға мылтықпен оқ атып, 12 метрдегі нысанға дәл тигізді. Оқ нысанадан 32 см-ге көтерілген...',
    answer: 'h = -0.01x<sup>2</sup> + 0.12x'
  },
  {
    title: 'Сурет бойынша заңдылықты анықтап .... 56 <> 14 = ?',
    answer: '16'
  },
  {
    title: 'Оксид пен су түзе ыдырайтын қышқыл',
    answer: 'H<sub>2</sub>CO<sub>3</sub>'
  },
  {
    title: 'Әлсіз негіз бен әлсіз қышқыл тұзы',
    answer: 'Al<sub>2</sub>S<sub>3</sub>'
  },
  {
    title: 'Na2CO3 ерітіндісіндегі фенолфталейн индикаторының түсі',
    answer: 'таңқурай түсті'
  },
  {
    title: 'Екінегізді қышқылдар',
    answer: 'күкірт, күкіртсутек, кремний'
  },
  {
    title: 'Al(NO3)3 тұзының ортасы және гидролиз сатысы',
    answer: 'қышқылдық 3'
  },
  {
    title: 'Заттардың сутектік көрсеткішпен сәйкестігі',
    answer: '1-С 2-В 3-А'
  },
  {
    title: 'Қышқылдарға тән диссоциациялану теңдеуі',
    answer: '2H<sup>+</sup> + SO<sup>2-</sup><sub>3</sub>'
  },
  {
    title: 'Тербелістің периоды',
    answer: '10 с'
  },
  {
    title: 'Жіптің керілу күшін 4 есе азайту үшін ...',
    answer: '8мм'
  },
  {
    title: 'Жіптің керілу күші',
    answer: '3*10<sup>-3</sup>H'
  },
  {
    title: 'Дене тербелген қозғалыс теңдеуі',
    answer: 'x = 1.5sin0.5пt'
  },
  {
    title: 'тербелістің жиілігі',
    answer: '0,1гц'
  },
  {
    title: 'Жіпке ілінген шарикке',
    answer: '3*10<sup>-3</sup>H'
  },
  {
    title: 'Зарядталған шариктегі электрондар саны',
    answer: '2,5*10<sup>10</sup>'
  },
  {
    title: 'Тербеліс амплитудасы',
    answer: '1,5м'
  },
  {
    title: 'India was the first inventor of ...',
    answer: 'cotton clothes numbers and plastic surgery'
  },
  {
    title: 'Plastic Surgery',
    answer: 'was done about 600 BC'
  },
  {
    title: 'The text is about',
    answer: 'important inventions throughout the world'
  },
  {
    title: 'The invention mistakenly thought og origin is',
    answer: 'numbers'
  },
  {
    title: 'Plastic Surgery',
    answer: 'a medical operation to improve the appearance of a part of someone\'s body'
  },
  {
    title: 'The earliest invention(s) in the text',
    answer: 'plastic surgery and chocolate'
  },
  {
    title: 'Numbers were invented by',
    answer: 'the Arabs'
  },
  {
    title: 'The thing(s) Europeans found later than others',
    answer: 'all of them'
  },
  {
    title: 'Paper was',
    answer: 'invented in China'
  },
  {
    title: 'The writer tries',
    answer: 'to raise our awareness about this inventions'
  },
]